{
    "visibility": {
        "visibility": "public"
    },
    "name": "**Traffic Sign Recognition**",
    "definition": {
        "code": [
            {
                "type": "repo",
                "repo_type": "github",
                "owner": "waynecoffee9",
                "owner_type": "User",
                "name": "Traffic-Sign-Classifier",
                "url": "https://github.com/waynecoffee9/Traffic-Sign-Classifier",
                "stars": 0,
                "pushed_at": "2019-11-25 18:35:08+00:00",
                "created_at": "2019-04-22 17:52:05+00:00",
                "language": "Jupyter Notebook",
                "description": "Design a deep neural network to classify German traffic signs",
                "frameworks": [
                    "scikit-learn",
                    "TensorFlow"
                ]
            },
            {
                "type": "code",
                "name": "CarND-Traffic-Sign-Classifier-Project",
                "sha": "8c49db0e30a0e7f2f0ab051762bcf0db08f0718d",
                "filetype": "dir",
                "connection": {
                    "name": "github_url",
                    "source": {
                        "url": "https://github.com/waynecoffee9/Traffic-Sign-Classifier/tree/master/CarND-Traffic-Sign-Classifier-Project"
                    }
                },
                "num_files": 14
            },
            {
                "type": "code",
                "name": "examples",
                "sha": "ccb6e3ab5cc6047bf9abc1e8cb1fa05d1949c04f",
                "filetype": "dir",
                "connection": {
                    "name": "github_url",
                    "source": {
                        "url": "https://github.com/waynecoffee9/Traffic-Sign-Classifier/tree/master/examples"
                    }
                },
                "num_files": 24
            }
        ]
    },
    "authors": [
        {
            "name": "Wayne Chen",
            "email": "waynechen1210@gmail.com",
            "github_id": "waynecoffee9"
        }
    ],
    "tags": [],
    "description": "Design a deep neural network to classify German traffic signs",
    "extraction": [
        {
            "type": "github",
            "url": "https://github.com/waynecoffee9/Traffic-Sign-Classifier",
            "stars": 0,
            "issues": true,
            "readme": "# **Traffic Sign Recognition** \n\n## Writeup\n\n---\n\n**Build a Traffic Sign Recognition Project**\n\nThe goals / steps of this project are the following:\n* Load the data set\n* Explore, summarize and visualize the data set\n* Design, train and test a model architecture\n* Use the model to make predictions on new images\n* Analyze the softmax probabilities of the new images\n* Summarize the results with a written report\n\n\n[//]: # (Image References)\n\n[image1]: ./examples/trainingQTY.jpg \"trainingQTY\"\n[image2]: ./examples/validQTY.jpg \"validQTY\"\n[image3]: ./examples/testQTY.jpg \"testQTY\"\n[image4]: ./examples/before_augmentation.jpg \"Before Augmentation\"\n[image5]: ./examples/augmentation.jpg \"Augmentation\"\n[image6]: ./examples/augmentQTY.jpg \"Total Training Set\"\n[image7]: ./examples/incep_overall.jpg \"Inception v4, 1\"\n[image8]: ./examples/my_incep.jpg \"My Inception v4 Net\"\n[image9]: ./examples/validation_recall.jpg \"Validation Recall\"\n[image10]: ./examples/validation_precision.jpg \"Validation Precision\"\n[image11]: ./examples/class_16_41.jpg \"Misclassification\"\n[image12]: ./examples/new.jpg \"New Images\"\n[image13]: ./examples/image1_prob.jpg \"Image Top 5 Probabilities\"\n[image14]: ./examples/image2_prob.jpg \"Image Top 5 Probabilities\"\n[image15]: ./examples/image3_prob.jpg \"Image Top 5 Probabilities\"\n[image16]: ./examples/image4_prob.jpg \"Image Top 5 Probabilities\"\n[image17]: ./examples/image5_prob.jpg \"Image Top 5 Probabilities\"\n[image18]: ./examples/layer_vis1.jpg \"Feature map 1\"\n[image19]: ./examples/layer_vis2.jpg \"Feature map 2\"\n[image20]: ./examples/layer_vis3.jpg \"Feature map 3\"\n\n\n## Rubric Points\n### Here I will consider the [rubric points](https://review.udacity.com/#!/rubrics/481/view) individually and describe how I addressed each point in my implementation.  \n\n---\n### Writeup / README\n\n#### 1. Provide a Writeup / README that includes all the rubric points and how you addressed each one. You can submit your writeup as markdown or pdf. You can use this template as a guide for writing the report. The submission includes the project code.\n\nYou're reading it! and here is a link to my [project code](https://github.com/waynecoffee9/Traffic-Sign-Classifier/blob/master/CarND-Traffic-Sign-Classifier-Project/Traffic_Sign_Classifier-inception.ipynb)\nIf you are unable to view it under github, use https://nbviewer.jupyter.org/ and paste the link to view.\n\n### Data Set Summary & Exploration\n\n#### 1. Provide a basic summary of the data set. In the code, the analysis should be done using python, numpy and/or pandas methods rather than hardcoding results manually.\n\nI used the pandas library to calculate summary statistics of the traffic\nsigns data set:\n\n* Number of training examples = 34799\n* Number of validation examples = 4410\n* Number of testing examples = 12630\n* Image data shape = (32, 32, 3)\n* Number of classes = 43\n\n#### 2. Include an exploratory visualization of the dataset.\n\nHere is an exploratory visualization of the data set. Three bar charts show image counts by class in training, validation, and test sets.  One can see that image counts vary a lot among classes.  This can potentially negatively affect accuracies for classes with fewer images.  Data augmentation will be introduced later in the preprocessing stage.\n\n![alt text][image1]\n![alt text][image2]\n![alt text][image3]\n\n### Design and Test a Model Architecture\n\n#### 1. Describe how you preprocessed the image data. What techniques were chosen and why did you choose these techniques? Consider including images showing the output of each preprocessing technique. Pre-processing refers to techniques such as converting to grayscale, normalization, etc. (OPTIONAL: As described in the \"Stand Out Suggestions\" part of the rubric, if you generated additional data for training, describe why you decided to generate additional data, how you generated the data, and provide example images of the additional data. Then describe the characteristics of the augmented training set like number of images in the set, number of images for each class, etc.)\n\nFirst, I normalized all training images to have float32 from 0 to 1.  I found the accuracy increases faster than -1 to 1 during network training.\nThe matricies below simply show one random image before and after normalization.\n\nBefore normalization:\n\n[[51 36 45 ... 80 79 73]\n\n [47 34 38 ... 64 75 79]\n \n [45 32 38 ... 61 68 71]\n \n ...\n \n [43 38 34 ... 46 42 37]\n \n [44 36 31 ... 36 33 35]\n \n [41 36 38 ... 52 48 50]]\n \nAfter normalization:\n\n[[0.1849315  0.08219178 0.14383562 ... 0.38356164 0.37671232 0.33561644]\n\n [0.15753424 0.06849315 0.09589041 ... 0.2739726  0.34931508 0.37671232]\n \n [0.14383562 0.05479452 0.09589041 ... 0.25342464 0.30136988 0.3219178 ]\n \n ...\n \n [0.13013698 0.09589041 0.06849315 ... 0.15068494 0.12328767 0.0890411 ]\n \n [0.1369863  0.08219178 0.04794521 ... 0.08219178 0.06164384 0.07534247]\n \n [0.11643836 0.08219178 0.09589041 ... 0.19178082 0.16438356 0.1780822 ]]\n\n \n\nAs mentioned before, data augmentation is applied to even out image quantity difference among classes, and to include variations of same images.\n\n* sharpen or smoothing\n* random rotate image\n* random stretch/squeeze image \n* random darken partial image\n* random move image\n\nHere is an example of a traffic sign image before and after augmentation.  The image is stretched horizontally and partially darkened at the bottom.\n\n![alt text][image4] ![alt text][image5]\n\nWhen all training images are added up, the quantity shows:\n\n![alt text][image6]\n\nAs a last step, the training set is shuffled to remove any order.\n\n\n#### 2. Describe what your final model architecture looks like including model type, layers, layer sizes, connectivity, etc.) Consider including a diagram and/or table describing the final model.\n\nMy final model uses scaled down version of inception v4.\n\nA typical inception v4 net consists of the following architecture (Reference: https://arxiv.org/pdf/1602.07261.pdf):\n\n![alt text][image7]\n\nEach block contains layers of convolutions and pooling in series and parallel.  Please refer to pages 3 and 4 in the reference PDF provided above for the detailed layers.\n\nMy inception model has fewer filter depths for faster training time.  See below:\n\n![alt text][image8]\n\nThe only fully connected weights are between dropout and the final output layer.  The rest are convolutions and pooling.\n\n\n\n#### 3. Describe how you trained your model. The discussion can include the type of optimizer, the batch size, number of epochs and any hyperparameters such as learning rate.\n\nTo train the model, I used Adam Optimizer because it seems to be faster than traditional gradient descent.  There are also other benefits mentioned online (Reference: https://machinelearningmastery.com/adam-optimization-algorithm-for-deep-learning/)\n\nThe batch size is 128, which is a typical value.  For number of epochs, I set it to 6.  Every time 6 epochs are done, the trained weights are saved.  I regenerate the whole data augmentation and continue until the accuracies have reached peaks.\n\nFor learning rate, I setup maximum rate (also default) as 0.002.  As training set accuracy is closer to 100%, learning rate will be adjusted automatically after each epoch.\n\n```javascript\n    learn_rate_fac = 0.02\n    default_learn_rate = 0.002\n    dyn_alpha = min((1 - train_accuracy)*learn_rate_fac, default_learn_rate)\n```\n\nFor L2 regularization, beta is set to a fixed value of 0.001.\n\nFor dropout, I keep 80% of the weights during training.\n\n#### 4. Describe the approach taken for finding a solution and getting the validation set accuracy to be at least 0.93. Include in the discussion the results on the training, validation and test sets and where in the code these were calculated. Your approach may have been an iterative process, in which case, outline the steps you took to get to the final solution and why you chose those steps. Perhaps your solution involved an already well known implementation or architecture. In this case, discuss why you think the architecture is suitable for the current problem.\n\nMy final model results were:\n* training set accuracy of 99%+\n* validation set accuracy of 99%+\n* test set accuracy of 98%+\n\nIf a well known architecture was chosen:\n* Inception v4 was chosen for traffic sign classifier.\n* This is a very suitable architecture because it has a very high accuracy for classifier (general inception v4 can be used to classify 1000 classes), and it is quite efficient.\n* It can be concluded this model works very well because all 3 data sets have very high accuracies, which means the model is not under or over fitting (balanced variance and bias).\n\nAdditional visualization of the validation accuracy is analyzed to understand what works or not.\n\nBelow is the validation set recall and precision by class.  Note that class 16 has a low recall (false negative), meaning images from class 16 were predicted as some other clases.  In precision chart, class 41 has a low value (false positive).  It is likely that many class 16 images were misclassified as class 41.\n\n![alt text][image9]\n![alt text][image10]\n\nImages were pulled from classes 16 and 41 and quickly one can see that some class 16 images have red circular borders are quite faded so they could be similar to class 41 images.  Below are classes 16 (left) and 41 (right) sample images.\n\n![alt text][image11]\n\n### Test a Model on New Images\n\n#### 1. Choose five German traffic signs found on the web and provide them in the report. For each image, discuss what quality or qualities might be difficult to classify.\n\nHere are five German traffic signs that I found on the web:\n\n![alt text][image12]\n\nThe first image might be difficult to classify because ...\n\n#### 2. Discuss the model's predictions on these new traffic signs and compare the results to predicting on the test set. At a minimum, discuss what the predictions were, the accuracy on these new predictions, and compare the accuracy to the accuracy on the test set (OPTIONAL: Discuss the results in more detail as described in the \"Stand Out Suggestions\" part of the rubric).\n\nHere are the results of the prediction:\n\n| Image\t\t\t        |     Prediction\t        \t\t\t\t\t| \n|:---------------------:|:---------------------------------------------:| \n| Children crossing     | Children crossing  \t\t\t\t\t\t\t| \n| Right-of-way          | Right-of-way\t\t\t\t\t\t\t\t\t|\n| Priority road\t\t\t| Priority road\t\t\t\t\t\t\t\t\t|\n| Turn right ahead \t\t| Turn right ahead\t\t\t\t \t\t\t\t|\n| Road work \t\t\t| Road work         \t\t\t\t\t\t\t|\n\n\nThe model was able to correctly guess 5 of the 5 traffic signs, which gives an accuracy of 100%, which is close to 98% from the test set.\n\n#### 3. Describe how certain the model is when predicting on each of the five new images by looking at the softmax probabilities for each prediction. Provide the top 5 softmax probabilities for each image along with the sign type of each probability. (OPTIONAL: as described in the \"Stand Out Suggestions\" part of the rubric, visualizations can also be provided such as bar charts)\n\nHere are the bar charts of the top 5 probabilities for 5 new images.  For all 5 images, they are very close to 100% certainty.  This means the model is really well trained.\n\nImage 1: Children crossing\n\n![alt text][image13]\n\nImage 2: Right-of-way\n\n![alt text][image14]\n\nImage 3: Priority road\n\n![alt text][image15]\n\nImage 4: Turn right ahead\n\n![alt text][image16]\n\nImage 5: Road work\n\n![alt text][image17]\n\n\n\n### (Optional) Visualizing the Neural Network (See Step 4 of the Ipython notebook for more details)\n#### 1. Discuss the visual output of your trained network's feature maps. What characteristics did the neural network use to make classifications?\n\nHere are some of the visualized feature maps evaluated on the first new image (children crossing).  It seems some feature maps picked up the shape of the triangle.  Some feature maps picked up the shape of the human figures inside the triangle.  Some feature maps picked up the blue sky on the left.\n\n![alt text][image18]\n![alt text][image19]\n![alt text][image20]\n",
            "readme_url": "https://github.com/waynecoffee9/Traffic-Sign-Classifier",
            "frameworks": [
                "scikit-learn",
                "TensorFlow"
            ]
        }
    ],
    "references": [
        {
            "title": "Inception-v4, Inception-ResNet and the Impact of Residual Connections on Learning",
            "arxiv": "1602.07261",
            "year": 2016,
            "url": "http://arxiv.org/abs/1602.07261v2",
            "abstract": "Very deep convolutional networks have been central to the largest advances in\nimage recognition performance in recent years. One example is the Inception\narchitecture that has been shown to achieve very good performance at relatively\nlow computational cost. Recently, the introduction of residual connections in\nconjunction with a more traditional architecture has yielded state-of-the-art\nperformance in the 2015 ILSVRC challenge; its performance was similar to the\nlatest generation Inception-v3 network. This raises the question of whether\nthere are any benefit in combining the Inception architecture with residual\nconnections. Here we give clear empirical evidence that training with residual\nconnections accelerates the training of Inception networks significantly. There\nis also some evidence of residual Inception networks outperforming similarly\nexpensive Inception networks without residual connections by a thin margin. We\nalso present several new streamlined architectures for both residual and\nnon-residual Inception networks. These variations improve the single-frame\nrecognition performance on the ILSVRC 2012 classification task significantly.\nWe further demonstrate how proper activation scaling stabilizes the training of\nvery wide residual Inception networks. With an ensemble of three residual and\none Inception-v4, we achieve 3.08 percent top-5 error on the test set of the\nImageNet classification (CLS) challenge",
            "authors": [
                "Christian Szegedy",
                "Sergey Ioffe",
                "Vincent Vanhoucke",
                "Alex Alemi"
            ]
        }
    ],
    "domain": {
        "domain_type": "Computer Vision",
        "domain_prob": 0.9999907536289631,
        "task": "Image Classification",
        "task_prob": 0.6334453183266286
    },
    "training": {
        "datasets": [
            {
                "name": "ImageNet"
            }
        ]
    }
}