{
  "arxivLinks": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://arxiv.org/abs/1312.5602",
      "https://arxiv.org/abs/2004.06627",
      "https://arxiv.org/abs/1401.1888"
    ],
    "technique": "Regular expression"
  },
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/Wentworth1996/Summer_Intern_Progress",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2020-06-12T06:47:35Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2020-06-15T06:17:01Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9706578009211129,
        0.988034402094355,
        0.8811684976715535
      ],
      "excerpt": "This project is mainly to record my internship at Millennium, i.e. the papers I read, the tools I learned, the toy examples I experimented on, the ideas I proposed for trading futures & the questions, etc. I won't include any intranet resources here, neither will I fork any internship codes.  \nFor the following two reasons, I built this project. First, recording my daily progress helps me better reflect and retrospect. Even though I've learned a library, e.g. Dask, a priori, I still need all the documentation and examples for help when I really work on Dask, since I can barely remember all the interfaces by heart. For this reason, I will also include all the links I looked for help. Similarly, recording the main ideas & methods of every paper I read is essential for building my own trading strategy, especially because an internship strategy is almost a \"combination\" and \"implementation\". Personally, in the first two years I start working as a quantitative researcher, I will read those classic works of my predecessors: Standing on the shoulders of giants is a good way for research. Secondly, this will help me better demonstrate my work to my mentor, Alex. \nThe materials I used are basically written in English. However, out of some reasons, I inevitably included a few Chinese and Frech resources. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9154685924852671
      ],
      "excerpt": "The Dask Documentation, the Dask.Distributed Documentation and the examples are substantial materials for learning Dask. I've learned the APIs for Array, Bag, Dataframe, Delayed. But I haven't learned Distributed in details. It seems an advanced API for scheduling. I read until Build Understanding/Efficiency. See also Stanford. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.990763754451318,
        0.9777936025600278,
        0.8723857963138877,
        0.9597162173838502,
        0.9245114905779163,
        0.9599005847249935
      ],
      "excerpt": "Notorious AQR paper. Typical old Chicago school paper with high school maths. Formula in Page 17 claimed that the return is proportional to the position. Not very clear: what is \"cross section\", ex-ante vol, how to distinguish speculators and hedgers. Reviewed up to page 28. \nThe Gomoko project basically implements the AlphaZero to Gomoko Games. It provides a RL coding framework.  Atari the first DQN. See also cutting plane method, simplex table. \nMany papers... some been read in details but not anticipate to implement. [Paper I] (https://arxiv.org/abs/2004.06627) it is rather a graduation thesis but the points are clearly presented. \nPage reviewd. Better find some more technical papers. LSTM, or more generally, they recurrent network, seems the only DL model for time series. \nPage contains a tutorial for SQLAlchemy. Easy! Berkeley SQL contains the fundamental query sentences. \nAirflow page contains the official documentation. I haven't gone into details since it is too practical. Better consult this page when actually working on it. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9008759235259165
      ],
      "excerpt": "What is the \"cross-section\"? This link explained the concept in a understandable way but that's not enough. If the study of cross-section aims to answer the question why stock A earns higher/lower returns than stock B, then does the cross-section simply rank the returns in a universe? \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9233988993743779,
        0.9351787840943054,
        0.8511374167693578,
        0.9713649755805379
      ],
      "excerpt": "although many plunges in history are equally difficult to explain. The resurgent coronavirus cases due to past protests are not sufficient to explain since the negative sentiment that appeared many days ago should have been slowly digested day by day.  \nI would rather attribute this to the behavior of certain funds. But could a few number of funds be that powerful? \nFréchet distance, a mathematically-rigorous method to measure the similarities between two (continuous) time series, i.e. curve. The scores maybe useful to construct an arbitrage strategy, e.g. pair trading. Timing okay...academic style pair-trading timing rule. \nArbitrage. Paper I (cointegration from Multivariate Ornstein-Uhlenbeck process's perspectives) reviewd in details. Vectorization provides an introduction to the related algebra. Complex eigenvector transform explains the naive matrix pseudo-diagonalization in this paper. \n",
      "technique": "Supervised classification"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/Wentworth1996/Summer_Intern_Progress/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 1,
      "date": "Thu, 09 Dec 2021 10:48:23 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/Wentworth1996/Summer_Intern_Progress/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "Wentworth1996/Summer_Intern_Progress",
    "technique": "GitHub API"
  },
  "installation": [
    {
      "confidence": [
        0.8904768687700566
      ],
      "excerpt": "Following Alex's and Jing's instructions, I armed myself familiar with the following topics: \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/Wentworth1996/Summer_Intern_Progress/issues{/number}",
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Yuxiang's Intern at Millennium, Summer 2020, as Quantitative Developer",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "Summer_Intern_Progress",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "Wentworth1996",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/Wentworth1996/Summer_Intern_Progress/blob/master/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 1,
      "date": "Thu, 09 Dec 2021 10:48:23 GMT"
    },
    "technique": "GitHub API"
  }
}