{
  "arxivLinks": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://arxiv.org/abs/1511.06434\n·        https://arxiv.org/abs/1607.07539\n·        https://arxiv.org/abs/1406.2661\n\n\n\nData:\n\n·        https://www.nasa.gov/feature/goddard/2019/how-nasa-protects-astronauts-from-space-radiation-at-moon-mars-solar-cosmic-rays\n·        https://www.designnews.com/automation-motion-control/3d-printing-moon-and-mars\n·        https://3dprintingindustry.com/news/nasa-experiments-3d-printed-radiation-shields-aboard-iss-114504/\n·        https://www.nasa.gov/mission_pages/station/research/news/3d-printing-in-space-long-duration-spaceflight-applications\n·        https://www.intechopen.com/books/satellites-missions-and-technologies-for-geosciences/the-impact-of-space-radiation-environment-on-satellites-operation-in-near-earth-space\n·        https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5896968/\n·        https://www.researchgate.net/publication/260705009_POWER_REQUIREMENTS_FOR_THE_NASA_MARS_DESIGN_REFERENCE_ARCHITECTURE_DRA_50\n·        https://mars.nasa.gov/mars2020/spacecraft/rover/arm/\n·        https://www.researchgate.net/publication/280831119_INFLUENCE_OF_MINERAL_GRAIN_SIZE_GRAIN_SIZE_DISTRIBUTION_AND_MICRO-_CRACKS_ON_ROCKS'_MECHANICAL_STRENGTH\n·        http://www.aalco.co.uk/datasheets/Stainless-Steel_St-St-Introduction_61.ashx\n·        https://www.sciencedirect.com/science/article/pii/B9780081000397000038\n·        https://www.hq.nasa.gov/alsj/tools/Welcome.html\n·        https://nasa3d.arc.nasa.gov/models\n\n# Tags\n#machine learning, #integrated system. #space rover, #space exploration, #energy saving, #new software",
      "https://arxiv.org/abs/1607.07539\n·        https://arxiv.org/abs/1406.2661\n\n\n\nData:\n\n·        https://www.nasa.gov/feature/goddard/2019/how-nasa-protects-astronauts-from-space-radiation-at-moon-mars-solar-cosmic-rays\n·        https://www.designnews.com/automation-motion-control/3d-printing-moon-and-mars\n·        https://3dprintingindustry.com/news/nasa-experiments-3d-printed-radiation-shields-aboard-iss-114504/\n·        https://www.nasa.gov/mission_pages/station/research/news/3d-printing-in-space-long-duration-spaceflight-applications\n·        https://www.intechopen.com/books/satellites-missions-and-technologies-for-geosciences/the-impact-of-space-radiation-environment-on-satellites-operation-in-near-earth-space\n·        https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5896968/\n·        https://www.researchgate.net/publication/260705009_POWER_REQUIREMENTS_FOR_THE_NASA_MARS_DESIGN_REFERENCE_ARCHITECTURE_DRA_50\n·        https://mars.nasa.gov/mars2020/spacecraft/rover/arm/\n·        https://www.researchgate.net/publication/280831119_INFLUENCE_OF_MINERAL_GRAIN_SIZE_GRAIN_SIZE_DISTRIBUTION_AND_MICRO-_CRACKS_ON_ROCKS'_MECHANICAL_STRENGTH\n·        http://www.aalco.co.uk/datasheets/Stainless-Steel_St-St-Introduction_61.ashx\n·        https://www.sciencedirect.com/science/article/pii/B9780081000397000038\n·        https://www.hq.nasa.gov/alsj/tools/Welcome.html\n·        https://nasa3d.arc.nasa.gov/models\n\n# Tags\n#machine learning, #integrated system. #space rover, #space exploration, #energy saving, #new software",
      "https://arxiv.org/abs/1406.2661\n\n\n\nData:\n\n·        https://www.nasa.gov/feature/goddard/2019/how-nasa-protects-astronauts-from-space-radiation-at-moon-mars-solar-cosmic-rays\n·        https://www.designnews.com/automation-motion-control/3d-printing-moon-and-mars\n·        https://3dprintingindustry.com/news/nasa-experiments-3d-printed-radiation-shields-aboard-iss-114504/\n·        https://www.nasa.gov/mission_pages/station/research/news/3d-printing-in-space-long-duration-spaceflight-applications\n·        https://www.intechopen.com/books/satellites-missions-and-technologies-for-geosciences/the-impact-of-space-radiation-environment-on-satellites-operation-in-near-earth-space\n·        https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5896968/\n·        https://www.researchgate.net/publication/260705009_POWER_REQUIREMENTS_FOR_THE_NASA_MARS_DESIGN_REFERENCE_ARCHITECTURE_DRA_50\n·        https://mars.nasa.gov/mars2020/spacecraft/rover/arm/\n·        https://www.researchgate.net/publication/280831119_INFLUENCE_OF_MINERAL_GRAIN_SIZE_GRAIN_SIZE_DISTRIBUTION_AND_MICRO-_CRACKS_ON_ROCKS'_MECHANICAL_STRENGTH\n·        http://www.aalco.co.uk/datasheets/Stainless-Steel_St-St-Introduction_61.ashx\n·        https://www.sciencedirect.com/science/article/pii/B9780081000397000038\n·        https://www.hq.nasa.gov/alsj/tools/Welcome.html\n·        https://nasa3d.arc.nasa.gov/models\n\n# Tags\n#machine learning, #integrated system. #space rover, #space exploration, #energy saving, #new software"
    ],
    "technique": "Regular expression"
  },
  "citation": [
    {
      "confidence": [
        0.9944484218006108,
        0.9944484218006108,
        0.9944484218006108
      ],
      "excerpt": "·        https://arxiv.org/abs/1511.06434 \n·        https://arxiv.org/abs/1607.07539 \n·        https://arxiv.org/abs/1406.2661 \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9686679014285212
      ],
      "excerpt": "·        https://www.researchgate.net/publication/260705009_POWER_REQUIREMENTS_FOR_THE_NASA_MARS_DESIGN_REFERENCE_ARCHITECTURE_DRA_50 \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9686679014285212
      ],
      "excerpt": "·        https://www.researchgate.net/publication/280831119_INFLUENCE_OF_MINERAL_GRAIN_SIZE_GRAIN_SIZE_DISTRIBUTION_AND_MICRO-_CRACKS_ON_ROCKS'_MECHANICAL_STRENGTH \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9785643756558006
      ],
      "excerpt": "·        https://www.sciencedirect.com/science/article/pii/B9780081000397000038 \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/ahmedabdel-hady/Space-Xplores-Nasaspaceapp2020",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2020-10-04T17:40:11Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2020-10-31T22:09:47Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        1
      ],
      "excerpt": "Space exploration is now the fastest-growing subject. This was, however at the cost of billions worth of projects and twice the amount effort. Obi-Wan Kenobi is an integrated system of a space rover updated and modified to use minimum energy with the greatest efficiency possible. It aims to revolutionize the entire industry, rendering it a profitable organization. This is managed by a new arm designed to indulge the biggest and most accurate amount of information while also not sacrificing the energy and a brand new software that takes the camera’s 2-D image and process it with sensors on the rover to produce a high-quality 3-D environment.\nHow We Addressed This Challenge\nObi-Wan Kenobi is space rover designed to gather information about foreign plants and there composition in a new way. We have made it with many implementations improving on the previous rovers using new technics, mechanics, and software in astronomical ways. Obi-Wan Kenobi aims to take the prior models of space rovers and modify on them in ways that revolutionize the entire subject of space exploration by maximizing the amount of information it can indulge and allaying every drop of wasted energy putting it into more work.\n\n\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        0.9956208368960668,
        0.9996314664397753,
        0.9319798755223018,
        0.9937772475047855,
        0.9991493734013988,
        0.9972896246345047,
        0.9989302840541534,
        0.9950403870896903,
        0.9364185027555766,
        0.9994063547727408,
        0.9802660912054064,
        0.9969978866472399,
        0.9949640915338935,
        0.9908028893563757,
        0.9939455218075075,
        0.9899116454524587,
        0.99736777266836,
        0.987253861250359,
        0.987032758260957,
        0.9794948177802496
      ],
      "excerpt": "Obi-Wan Kenobi starts by observing the area around it using a camera that interprets 3-D objects as 2-D images containing an amount of distortion due to the rays and other emissions from the sun that are abundant in an unprotected atmosphere or in vacuum. With the help of an ultraviolet rays sensor, infrared rays sensor, and a Gieger sensor, a sensor used for the detection and measurement of all types of radiation: alpha, beta and gamma radiation, the rover enters these images in the system as a matrix input. These images are then used as samples to create a probability distribution, which will allow as to determine the best choice for filling any missing parts in the original image. In order for the system to fill these gaps, it needs to gain as much information as possible from the context close to the missing area and also to develop an artificial perception of the image as a whole. We use an adversarial training method known as GAN (Generative Adversarial Networks) where two functions will fight against each other so that to force the machine to create an artificial substitute that will be both plausible and natural to human understanding.  \nThis is a machine learning model, which means it gets more accurate in its assessments and calculations to identify, analyze a material, and render it a 3-d model with no distortion the more it is trained to identify, analyze, and render objects 3-d models with no distortion, creating a distribution of reference, ere mission and keeps what it learned preserving the ability to learn more by the time. This precise feature makes the rover renewable and coping with any changes in the environment or human technology. In other words, it makes it more sustainable and adapting. By scanning through a particular image, the machine can decide which features are missing and thus to try and regenerate them, based on the new and the distribution of reference. Our convolutional neural network is finally able to reconstruct the objects by approximating the original object. This whole process is mostly dependent on a software far from Obi-Wan Kenobi that takes its images and make all the necessary transformations. All the rover does is observe and send images using the camera, no other strains on the system or the energy are participating in the process. A hygrometer is also used to measure and report both moisture and air temperature, and an anemometer is also used for measuring winds' speed and direction. \nBased on the information the rover has provided by observing the medium and analyzing the materials using the camera, we have a thorough idea about the environment, the surrounding materials and exact details about the atmosphere and what the materials went through. Then, we decide the best place to move the rover to in order to start analyzing a certain material more closely and take samples. The wheels now start. \nThe carbon fiber of which the body of Obi-Wan Kenobi is made of is 30% lighter reducing the amount of fuel the movement requires and fastens the rover significantly. It also is 43% stronger than steel, giving it further sustainability. \nNow that the rover is in the area it is intended to be in, the process of taking the samples begins. An added extension to the arm with a length of 30 mm (scaled to fit in the simulated part) is used as a crashing part which uses the power of the motor to transform large rocks into grains. These grains are a better source of information because of the higher accuracy of examination they can offer us. Then, we added an external part to the bottom of the arm, a closing part, to give the arm the freedom and ability to transport these grains the next step, which is the basic analysis. The material used in this arm was adapted to suit with the environment and with the main mission for this specific part. The Graining part is made from stainless steel because of its 505 MPa of ultimate tensile strength and 8.5 hardness on Mohs scale. These properties make stainless steel a perfect choice for such mission. For the rest of the arm, we choose the cladding as a main material. Cladding has the ability to perform in hard conditions because of its heat insulation and light weight. In addition, Cladding will not break because if its high durability. This makes cladding the perfect material for the arm structure mission. \nAfter taking the sample, an XRF spectrometer to further help the process of gathering information as fast as possible. XRF is a spectrometer used to measure the chemical makeup of rocks at a very fine scale. It seeks changes in textures and chemicals in the planetary rocks and soil left behind by any ancient microbial life. Also, its X-ray beam moves as easily as a laser pointer in a human's hand. Tiny motors give it freedom of motion, like a mini version of the six-legged, motion-control system flight simulators use. In addition, its X-ray beam can focus on rock features as small as a grain of salt. That lets XRF find any small traces of life that microbes maybe left behind and is helped by the grinder aforesaid as it turns rocks into tiny grains. XRF detects over 20 chemical \"fingerprints\" - even when the amount is only a few parts per million. It finds the exact tiny spot in a rock where each chemical is. All these information gathered are then sent to the main server to be observed, analyzed, and benefited from even before Obi Wan Kenobi returns. \nAs mentioned earlier, space exploration is a very wide subject that is growing exponentially and that offered to us hope to things we never fancied hoping. In the light of that, we found that planets and other foreign objects are a great offer for magnanimous discoveries that we have yet to find, the tool to get the most precious of these information is the space rover. However, these devices, as of current age, are extremely expensive and inefficient relative to the potential it acquires. Space rovers acquire a potential to know the history of some planets, what they went through, and maybe even detecting if there was life on this planet before and how it came to a halt. \nThese potential abilities have been regarded as far dreams because of the rovers' energy and money consuming nature. This model aims to change that by offering new means and exploration and introducing young technologies that are guaranteed to expand the subject itself. Our new implementation should minimize the energy consumption in the rover up to 50% by reducing its weight. The new sensors and system to identify the materials and provide us with images of higher quality should minimize the situation in which the rover has to move, helping reduce energy consumption. And finally, the newly designed arm should skyrocket the amount of information we \ncan get from the materials due to its sustainability, accuracy, and the XRF spectrometer that can detect details of materials down to molecular level. \nThere are several goals for sending missions to other planets, including searching for water and living organisms and searching for an opportunity to live in such places, but the most prominent of those is examining the soil and rocks of this planets in order to study the possible resources. These missions was done by Rovers on the moon then on mars. We have a hope in humanity and what it can do that pierce the skies. We really think that our place does not end in Earth and this is it. We were born on mother Earth, but our place in among the stars. This is why we search and think of any way to help enhance our technologies, especially those related to astronomy, We believe. \nThe process of developing the project is sorted and specified as following: \nWe started by searching about the means of space exploration, what are they, which are the most effective, and which has to most potential to help greatly. Our choice fell on space rovers. As said before, biggest missions for exploring other planets were sent to explore planets' composition and search for water and maybe even life. These missions were done by Rovers on the moon then on mars. The process of examining the soil suffers from 2 main problems: Power consumption and accuracy of results. \nAccording to NASA statistics, rovers are using 20% of its power in examining the soil parts, but these results are not accurate enough because of the rocky surface of Mars which makes the process of taking samples much harder, so we have created a solution for these problems in order to make the process more efficient. \nFirst, we examined the arm used by NASA's rovers and simulated it (with a smaller scale and simple structure) on the 3D designing program SOLIDWORKS in order to implement our upgrade on the basics of the already used hand. This choice is to make it as applicable as possible. Then we began to make our upgrades, leading to the arm with its properties aforesaid. \nAfter that, we started developing a new software to help minimize the effort spent by the rover and energy with it. For that, we've used Python 3.8, Transflow, and PHP programming languages in order to make the right algorithms to detect the distortion, learn from it and implement on it producing the final 3-D figures. \nFinally we needed a tool that provided hardware with what it needs as well as software and the main human server in order to take the best out of every one and to blend everything together making a completed entity of a device. \nFor that we decided to use ultraviolet spectroscopy in order to detect every ray in the area and to help the software develop the image. We have also used Gieger sensor and integrated it with the software to further work on the quality of the image and help transform it into an accurate 3-D figure. \nFor the hardware, we used an XRF spectrometer and attached it to arm in order to give us the most delicate and accurate details about the materials. \nWe added an anemometer in order to detect the intensity and the direction of the wind, giving us insight about natural processes such as corrosion and wind system of a planet. We also added a humidity meter as a new article was published by NASA that there might be an enclosed, yet partially empty, atmosphere that is able to store water vapor that the heat does not able it to condense. This hygrometer can help us detect such thing. \nFinally, we used carbon fiber as a material of the body due to its light weight and high pressure sustaining. We used stainless steel as the handle of the arm due to its hardness and durability, and we used Cladding as the material of the rest of the arm due to its sustainability and durability. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8979411005071259
      ],
      "excerpt": "Data & Resources \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8044496815594876,
        0.9412972372742411
      ],
      "excerpt": "·        https://www.nasa.gov/mission_pages/station/research/news/3d-printing-in-space-long-duration-spaceflight-applications \n·        https://www.intechopen.com/books/satellites-missions-and-technologies-for-geosciences/the-impact-of-space-radiation-environment-on-satellites-operation-in-near-earth-space \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "Nasa Space App Ismailia 2020",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/ahmedabdel-hady/Space-Xplores-Nasaspaceapp2020/releases",
    "technique": "GitHub API"
  },
  "faq": [
    {
      "confidence": [
        1
      ],
      "excerpt": "﻿In the process of making this project, meaningful experiences were made. The subtlety of the problems was endearing as they were so small and we would work with each other to solve them. This bring us to really feel the care for each other and understand teamwork better. A member of us has made an entire website dedicated to this project, bringing into details every aspect and part of it for further reference. Another one has made an outstanding 3-D model of the arm that is over the top. Another one had a really great experience with writing, the pressure of it and how to turn it into a game to enjoy thoroughly. During this project, everyone of use got out with a huge lesson and an even bigger memory.\n\nHow We Used Space Agency Data in This Project\nThe links and sources that were our references and best guide to us are as follows:\n\nhttps://mars.nasa.gov/msl/spacecraft/rover/arm/#chimra\nIt helped us in coming up with the idea of using XRF spectroscopy as it used x-ray spectrometer as it uses two kinds of radiation to measure the amounts and types of chemical elements that are present but it had a problem that it took so much time to operate and it only operated in the day but XRF Can operate day or night and takes about one-third of the time to process readings.\n\nhttps://mars.nasa.gov/msl/rover-3d/\nThis 3D design of a Rover was with a great benefit in our journey in designing the 3D parts. By giving a more detailed picture of the rovers, we became able to simulate the basic parts and use it in implementing our upgrades.\n\n\n\nhttps://mars.nasa.gov/mars2020/spacecraft/rover/arm/ \n\nThe design of NASA's robots was very enlightening for us because it gave us a clear picture of the main components of the robot, especially the arm. It was also informative because it helped us to detect the possible problems that we might solve.\nhttps://www.hq.nasa.gov/alsj/tools/Welcome.html\n\nThis catalog was our source for understanding the main tools used by NASA teams, including its dimensions and material. This helped us in improving the problems we observed from this catalog. In addition, its work frame was responsible for making ours\nhttps://nasa3d.arc.nasa.gov/models\n\nThis source of modules was a great source for designs which is varied in its features. This was essential for our brainstorming plan because it gave us a bunch of ideas and designs. Also, it gave us the opportunity to use past modules of already used parts.\n\n",
      "technique": "Header extraction"
    }
  ],
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 0,
      "date": "Tue, 28 Dec 2021 20:26:14 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/ahmedabdel-hady/Space-Xplores-Nasaspaceapp2020/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "ahmedabdel-hady/Space-Xplores-Nasaspaceapp2020",
    "technique": "GitHub API"
  },
  "installation": [
    {
      "confidence": [
        0.8626798667210626
      ],
      "excerpt": "·        https://mars.nasa.gov/mars2020/spacecraft/rover/arm/ \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8491737638821341
      ],
      "excerpt": "·        https://nasa3d.arc.nasa.gov/models \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/ahmedabdel-hady/Space-Xplores-Nasaspaceapp2020/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Python",
      "PHP",
      "HTML"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "name": "MIT License",
      "url": "https://api.github.com/licenses/mit"
    },
    "technique": "GitHub API"
  },
  "licenseText": {
    "confidence": [
      1.0
    ],
    "excerpt": "b'MIT License\\n\\nCopyright (c) 2020 Ahmed Abdelhady\\n\\nPermission is hereby granted, free of charge, to any person obtaining a copy\\nof this software and associated documentation files (the \"Software\"), to deal\\nin the Software without restriction, including without limitation the rights\\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\\ncopies of the Software, and to permit persons to whom the Software is\\nfurnished to do so, subject to the following conditions:\\n\\nThe above copyright notice and this permission notice shall be included in all\\ncopies or substantial portions of the Software.\\n\\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\\nSOFTWARE.\\n'",
    "technique": "File Exploration"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Space-Xplores-Nasaspaceapp2020",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "Space-Xplores-Nasaspaceapp2020",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "ahmedabdel-hady",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/ahmedabdel-hady/Space-Xplores-Nasaspaceapp2020/blob/main/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 1,
      "date": "Tue, 28 Dec 2021 20:26:14 GMT"
    },
    "technique": "GitHub API"
  },
  "topics": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "obi-wan-kenobi",
      "rover",
      "machine-learning",
      "ai",
      "tensorflow",
      "nasa",
      "nasa-spaceapps-challenge",
      "nasa-api"
    ],
    "technique": "GitHub API"
  },
  "usage": [
    {
      "confidence": [
        1
      ],
      "excerpt": "Presentation address:\nhttps://prezi.com/view/IVcKdFSYdpR1vnmgnOYO/\n\n",
      "technique": "Header extraction"
    }
  ]
}