{
  "citation": [
    {
      "confidence": [
        1
      ],
      "excerpt": "- ",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        0.8498605443470728
      ],
      "excerpt": "출처: Attention is All You Need [https://arxiv.org/pdf/1706.03762.pdf] \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8283216015784888
      ],
      "excerpt": "Encoder는 왜 여러 개의 layer를 겹쳐 쌓는 것일까? 각 Encoder Layer의 역할은 무엇일까? 결론부터 말하자면, 각 Encoder Layer는 input으로 들어오는 vector에 대해 더 높은 차원(넓은 관점)에서의 context를 담는다. 높은 차원에서의 context라는 것은 더 추상적인 정보라는 의미이다. Encoder Layer는 내부적으로 어떠한 Mechanism을 사용해 context를 담아내는데, Encoder Layer가 겹겹이 쌓이다 보니 처음에는 원본 문장에 대한 낮은 수준의 context였겠지만 이후 context에 대한 context, context의 context에 대한 context ... 와 같은 식으로 점차 높은 차원의 context가 저장되게 된다. Encoder Layer의 내부적인 작동 방식은 곧 살펴볼 것이기에, 여기서는 직관적으로 Encoder Layer의 역할, Encoder 내부의 전체적인 구조만 이해하고 넘어가자. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9321597499656605
      ],
      "excerpt": "Multi-Head Attention은 Self-Attention을 병렬적으로 여러 개 수행하는 layer이다. 때문에 Multi-Head Attention을 이해하기 위해서는 Self-Attention에 대해 먼저 알아야만 한다. Attention이라는 것은 넓은 범위의 전체 data에서 특정한 부분에 집중한다는 의미이다. 다음의 문장을 통해 Attention의 개념을 이해해보자. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8109194328925066
      ],
      "excerpt": "Self-Attention에서는 총 3개의 vector가 새로 등장한다. Query, Key, Value이다. 각각의 역할은 다음과 같다. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8714162992508173
      ],
      "excerpt": "Key: attention을 구하고자 하는 대상 token을 의미 \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9999887851776386,
        0.971679416046096
      ],
      "excerpt": "Query, Key, Value가 각각 어떤 token을 가리키는지는 이해가 됐을 것이다. 하지만, 그래서 Query, Key, Value라는 세 vector의 구체적인 값은 어떻게 만들어지는지는 우리는 아직 알지 못한다. 정말 간단하게도, input으로 들어오는 token embedding vector를 fully connected layer에 넣어 세 vector를 만들어낸다. 세 vector를 생성해내는 FC layer는 모두 다르기 때문에, 결국 self-attention에서는 Query, Key, Value를 구하기 위해 3개의 서로 다른 FC layer가 존재한다. 이 FC layer들은 모두 같은 input dimension, output dimension을 갖는다. input dimension이 같은 이유는 당연하게도 모두 다 token embedding vector를 input으로 받기 때문이다. 한편, 세 FC layer의 output dimension이 같다는 것을 통해 각각 별개의 FC layer로 구해진 Query, Key, Value가 구체적인 값은 다를지언정 같은 dimension을 갖는 vector가 된다는 것을 알 수 있다. 즉, Query, Key, Value의 shape는 모두 동일하다. 앞으로 이 세 vector의 dimension을 $d_k$로 명명한다. 여기서 $k$는 Key를 의미하는데, 굳이 Query, Key, Value 중 Key를 이름으로 채택한 이유는 특별히 있지 않고, 단지 논문의 notation에서 이를 채택했기 때문이다. 정리하자면, Query, Key, Value는 모두 $d_k$의 dimension을 갖는 vector이다. 이제 위에서 얘기했던 Key, Value가 다른 값을 갖는 이유를 이해할 수 있다. input은 같은 token embedding vector였을지라도 서로 다른 FC layer를 통해서 각각 Key, Value가 구해지기 때문에 같은 token을 가리키면서 다른 값을 갖는 것이다. \n이제 Query, Key, Value를 활용해 Attention을 계산해보자. Attention이라고 한다면 어떤 것에 대한 Attention인지 불명확하다. 구체적으로, Query에 대한 Attention이다. 이 점을 꼭 인지하고 넘어가자. 이후부터는 Query, Key, Value를 각각 $Q$, $K$, $V$로 축약해 부른다. Query의 Attention은 다음과 같은 수식으로 계산된다. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8498605443470728
      ],
      "excerpt": "출처: Attention is All You Need [https://arxiv.org/pdf/1706.03762.pdf] \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8498605443470728
      ],
      "excerpt": "출처: Attention is All You Need [https://arxiv.org/pdf/1706.03762.pdf] \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8498605443470728,
        0.8184428348523783
      ],
      "excerpt": "출처: Attention is All You Need [https://arxiv.org/pdf/1706.03762.pdf] \n지금까지의 Self-Attention에 대한 개념은 모두 Multi-Head Attention Layer를 이해하기 위한 것이었다. Attention 계산을 논문에서는 Scaled Dot-Product Attention이라고 명명한다. Transformer는 Scaled Dot Attention을 한 Encoder Layer마다 1회씩 수행하는 것이 아니라 $h$회 수행한 뒤, 그 결과를 종합해 사용한다. 이 것이 Multi-Head Attention Layer이다. 이러한 작업을 수행하는 이유는 여러 Attention을 잘 반영하기 위해서이다. 만약 하나의 Attention만 반영한다고 했을 때, 예시 문장에서 'it'의 Attention에는 'animal'의 것이 대부분을 차지하게 될 것이다. 하지만 여러 종류의 attention을 반영한다고 했을 때 'tired'에 집중한 Attention까지 반영된다면, 최종적인 'it'의 Attention에는 'animal'을 지칭한다는 정보, 'tired' 상태라는 정보까지 모두 담기게 될 것이다. 이 것이 Multi-Head Attention을 사용하는 이유이다. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8714162992508173
      ],
      "excerpt": "Multi-Head Attention Layer를 실제 code로 구현해보자. 위에서 구현했던 calculate_attention()을 사용한다. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9321597499656605
      ],
      "excerpt": "    key = transform(key, self.key_fc_layer) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9763162561870891
      ],
      "excerpt": "Encoder Layer는 위에서 다뤘던 Multi-Head Attention Layer와 Feed-Forwad Layer로 구성된다. 그러나 사실은 Encoder Layer를 구성하는 두 layer는 Residual Connection으로 둘러싸여 있다. Residual Connection이라는 것은 정말 단순하다. $y = f(x)$를 $y=f(x)+x$로 변경하는 것이다. 즉, output을 그대로 사용하지 않고, output에 input을 추가적으로 더한 값을 사용하게 된다. 이로 인해 얻을 수 있는 이점은 명확하다. Back Propagation 도중 발생할 수 있는 Gradient Vanishing을 방지할 수 있다. 개념적으로는 이 것이 전부이다. 여기에 더해 논문에서 채택한 Layer Normalization까지 추가한다. 간단하게 코드로 구현해보자. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9982063141659211,
        0.9321597499656605
      ],
      "excerpt": "Decoder Layer는 Encoder Layer와 달리 Multi-Head Attention Layer가 2개가 존재한다. 첫번째 layer는 Masked Multi-Head Attention Layer라고 부르는데, 이는 위에서 언급했던 subsequent masking이 적용되기 떄문이다. 두번째 layer는 특징이 Encoder에서 넘어온 Context를 input으로 받아 사용한다는 것이다. 즉, Encoder의 Context는 Decoder 내 각 Decoder Layer의 두번째 Multi-Head Attention Layer에서 사용되게 된다. 마지막 Position-wise Feed-Forward Layer는 Encoder Layer의 것과 완전히 동일하므로 설명을 생략한다. 이제 두 Multi-Head Attention Layer에 대해서 Encoder의 것과 비교하며 특징을 살펴보자. \nMasked Multi-Head Attention Layer에 대한 설명은 특별한 것이 없다. Encoder의 것과 완전히 동일한데 다만 mask로 들어오는 인자가 일반적인 pad masking에 더해 subsequent masking까지 적용되어 있다는 점만이 차이일 뿐이다. 즉, 이 layer는 Self-Attention을 수행하는 layer이다. 'Self'에 주목하자. 같은 sentence 내 token들 사이의 attention을 찾는 것이다. 이는 다음 Multi-Head Attention Layer와 가장 큰 차이점이다. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9734334817100387
      ],
      "excerpt": "지금 와서 Multi-Head Attention Layer를 보면 이전과 다르게 보일 것이다. query, key, value를 굳이 각각 별개의 인자로 받은 이유는 Decoder Layer 내에서 query와 key, value는 서로 다른 embedding에서 넘어오기 때문이다. \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/cpm0722/transformer_pytorch",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2020-11-22T08:35:03Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-11-02T06:35:52Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.83718068102951
      ],
      "excerpt": "    def transform(x, fc_layer): #: reshape (n_batch, seq_len, d_embed) to (n_batch, h, seq_len, d_k) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.860059181823877,
        0.8043749996699634,
        0.8588347943308506
      ],
      "excerpt": "현실에서는, 특히나 model 학습 초창기에는 위처럼 잘못된 token을 생성해내고, 그 이후 계속적으로 잘못된 token이 생성될 것이다. 초반에 하나의 token이 잘못 도출되었다고 이후 token이 모두 다 잘못되게 나온다면 제대로 된 학습이 진행되기 힘들 것이다. 따라서 이를 위해 Teacher Forcing을 사용한다. \nTeacher Forcing은 실제 labeled data(Ground Truth)를 RNN cell의 input으로 사용하는 것이다. 정확히는 Ground Truth의 [:-1]로 slicing을 한 것이다(마지막 token인 EOS token을 제외하는 것이다). 이를 통해서 model이 잘못된 token을 생성해내더라도 이후 제대로 된 token을 생성해내도록 유도할 수 있다. \n하지만 이는 model 학습 과정에서 Ground Truth를 포함한 dataset을 갖고 있을 때에나 가능한 것이기에 Test나 실제로 Real-World에 Deliever될 때에는 model이 생성해낸 이전 token을 사용하게 된다. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.860059181823877
      ],
      "excerpt": "Transformer를 생성하는 예제 함수 make_model()은 다음과 같이 작성할 수 있다. 실제 논문 상에서는 $d_{embed}$와 $d_{model}$을 구분하지 않고 통합해서 $d_{model}$로 사용했지만, 이해를 돕기 위해 지금까지 분리해 사용했다. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.860059181823877,
        0.860059181823877
      ],
      "excerpt": "#: 실제 model 생성 \nmodel = Transformer( \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.860059181823877
      ],
      "excerpt": "return model \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "Transformer(Attention Is All You Need) Implementation in Pytorch",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/cpm0722/transformer_pytorch/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 0,
      "date": "Sat, 25 Dec 2021 00:47:11 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/cpm0722/transformer_pytorch/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "cpm0722/transformer_pytorch",
    "technique": "GitHub API"
  },
  "hasExecutableNotebook": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://raw.githubusercontent.com/cpm0722/transformer_pytorch/main/transformer.ipynb"
    ],
    "technique": "File Exploration"
  },
  "invocation": [
    {
      "confidence": [
        0.907712520488279,
        0.8359299706379749
      ],
      "excerpt": "Transformer는 input sentence를 넣어 output sentence를 생성해내는 model이다. input과 동일한 sentence를 만들어낼 수도, input의 역방향 sentence를 만들어낼 수도, 같은 의미의 다른 언어로 된 sentence를 만들어낼 수도 있다. 이는 model의 train 과정에서 정해지는 것으로, label을 어떤 sentence로 정할 것인가에 따라 달라진다. 결국 Transformer는 sentence 형태의 input을 사용해 sentence 형태의 output을 만들어내는 함수로 이해할 수 있다. \n$ \\text{Transformer}(x)\\x,\\ y\\text{ : sentence} $ \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8163012035434292
      ],
      "excerpt": "Value: attention을 구하고자 하는 대상 token을 의미 (Key와 동일한 token) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8481449418903522
      ],
      "excerpt": "    #: query, key, value's shape: (n_batch, seq_len, d_k) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8629920582736479
      ],
      "excerpt": "calculate_attention()의 인자로 query, key, value, mask를 받는다. mask는 pad mask matrix일 것이다. pad mask matrix는 Transformer 외부 (대개 Batch class)에서 생성되어 Transformer에 인자로 들어오게 된다. query, key, value는 서로 다른 FC Layer를 거쳐 $\\text{n_batch} \\times \\text{max_seq_len} \\times d_k$로 변형되었다. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.803564247763383,
        0.8481449418903522,
        0.8164255860924499
      ],
      "excerpt": "def forward(self, query, key, value, mask=None): \n    #: query, key, value's shape: (n_batch, seq_len, d_embed) \n    #: mask's shape: (n_batch, seq_len, seq_len) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.839290883268242
      ],
      "excerpt": "    out = self.calculate_attention(query, key, value, mask) #: out's shape: (n_batch, h, seq_len, d_k) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8060813455504295
      ],
      "excerpt": "인자로 받은 query, key, value는 실제 $Q$, $K$, $V$ matrix가 아니다. $Q$, $K$, $V$ 계산을 위해서는 각각 FC Layer 에 input으로 sentence(실제로는 mini-batch이므로 다수의 sentence)를 넣어줘야 하는데, 이 sentence를 의미하는 것이다. Self-Attention이기에 당연히 $Q$, $K$, $V$는 같은 sentence에서 나오게 되는데 왜 별개의 인자로 받는지 의문일 수 있다. 이는 Decoder의 작동 원리를 알고 나면 이해할 수 있을 것이다. 인자로 받은 query, key, value는 sentence이므로 shape는 ($\\text{n_batch} \\times \\text{seq_len} \\times d_{embed}$)이다. mask matrix는 기본적으로 한 문장에 대해 ($\\text{seq_len} \\times \\text{seq_len}$)의 shape를 갖는데, mini-batch이므로 ($\\text{n_batch} \\times \\text{seq_len} \\times \\text{seq_len}$)의 shape를 갖는다. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8481449418903522
      ],
      "excerpt": "    #: query, key, value's shape: (n_batch, seq_len, d_k) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8385182728255672
      ],
      "excerpt": "우선 $d_k$를 중심으로 $Q$와 $K$ 사이 행렬곱 연산을 수행하기 때문에 $Q$, $K$, $V$의 마지막 dimension은 반드시 $d_k$여야만 한다. 또한 attention_score의 shape는 마지막 두 dimension이 반드시 ($\\text{seq_len} \\times \\text{seq_len}$)이어야만 masking이 적용될 수 있기 때문에 $Q$, $K$, $V$의 마지막 직전 dimension(.shape[-2])은 반드시 $\\text{seq_len}$이어야만 한다. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8193003071479553
      ],
      "excerpt": "    out = self.multi_head_attention_layer(query=x, key=x, value=x, mask=mask) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8179345893902109,
        0.8143966368397063
      ],
      "excerpt": "def forward(self, src, trg, mask): \n    encoder_output = self.encoder(src, mask) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8359299706379749
      ],
      "excerpt": "$\\text{FFN}(x)=\\text{max}(0, xW_1+b_1)W_2 + b_2$ \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8462666485673652
      ],
      "excerpt": "가장 처음에 Transformer의 전체 구조를 이야기할 때 봤던 Decoder의 구조이다. Context와 Some Sentence를 input으로 받아 Output Sentence를 출력한다. Context는 Encoder의 output이라는 것은 이해했다. Transformer model의 목적을 다시 상기시켜 보자. input sentence를 받아와 output sentence를 만들어내는 model이다. 대표적으로 번역과 같은 task를 처리할 수 있을 것이다. 번역이라고 가정한다면, Encoder는 Context를 생성해내는 것, 즉 input sentence의 정보를 압축해 담아내는 것을 목적으로 하고, Decoder는 Context를 활용해 output sentence를 만들어내는 것을 목적으로 한다. 그렇다면 Decoder는 input으로 Context만 받아야 하지, 왜 다른 추가적인 sentence를 받을까? 또 이 sentence는 도대체 무엇일까? 이에 대해 알아보자. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8892625917143743
      ],
      "excerpt": "    mask = np.triu(np.ones(atatn_shape), k=1).astype('uint8') #: masking with upper triangle matrix \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8189832825408754
      ],
      "excerpt": "make_std_mask()는 subsequent_mask()를 호출해 subsequent mask을 생성하고, 이를 pad mask와 결합한다. 위의 code는 Transformer 내부가 아닌 Batch class 내에서 실행되는 것이 바람직할 것이다. mask 생성은 Transformer 내부 작업이 아닌 전처리 과정에 포함되기 때문이다. 따라서 Encoder에 적용되는 pad mask와 동일하게 Batch class 내에서 생성될 것이다. 이는 결국 Transformer 외부에서 넘어와야 하기 때문에 Transformer code가 수정되어야 한다. 기존에는 Encoder에서 사용하는 pad mask(src_mask)만이 forward()의 인자로 들어왔다면, 이제는 Decoder에서 사용할 subsequent mask (trg_mask)도 함께 주어진다. 따라서 forward()의 최종 인자는 src, trg, src_mask, trg_mask이다. 각각 Encoder의 input, Decoder의 input, Encoder의 mask, Decoder의 mask이다. forward() 내부에서 decoder의 forward()를 호출할 때 역시 변경되는데, trg_mask가 추가적으로 인자로 넘어가게 된다. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.803564247763383
      ],
      "excerpt": "def forward(self, query, key, value, mask=None): \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8025472048583212
      ],
      "excerpt": "        out = layer(x, mask, encoder_output, encoder_mask) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8193003071479553,
        0.803196181461259
      ],
      "excerpt": "    out = self.masked_multi_head_attention_layer(query=x, key=x, value=x, mask=mask) \n    out = self.multi_head_attention_layer(query=out, key=encoder_output, value=encoder_output, mask=encoder_mask) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8340992551989391
      ],
      "excerpt": "code가 난해한데, 직관적으로 작동 원리만 이해하고 넘어가도 충분하다. PositionalEncoding의 목적은 positional정보(대표적으로 token의 순서, 즉 index number)를 정규화시키기 위한 것이다. 단순하게 index number를 positionalEncoding으로 사용하게 될 경우, 만약 training data에서는 최대 문장의 길이가 30이었는데 test data에서 길이 50인 문장이 나오게 된다면 30~49의 index는 model이 학습한 적이 없는 정보가 된다. 이는 제대로 된 성능을 기대하기 어려우므로, positonal 정보를 일정한 범위 안의 실수로 제약해두는 것이다. 여기서 $sin$함수와 $cos$함수를 사용하는데, 짝수 index에는 $sin$함수를, 홀수 index에는 $cos$함수를 사용하게 된다. 이를 사용할 경우 항상 -1에서 1 사이의 값만이 positional 정보로 사용되게 된다. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8524209969009525
      ],
      "excerpt": "우리가 결국 해내고자 하는 목표는 Decoder의 output이 sentence, 즉 token의 sequence가 되는 것이다. 그런데 Decoder의 output은 그저 ($\\text{n_batch} \\times \\text{seq_len} \\times \\text{d_model}$)의 shape를 갖는 matrix일 뿐이다. 이를 vocabulary를 사용해 실제 token으로 변환할 수 있도록 차원을 수정해야 한다. 따라서 FC Layer를 거쳐 마지막 dimension을 $\\text{d_model}$에서 $\\text{len(vocab)}$으로 변경한다. 그래야 실제 vocabulary 내 token에 대응시킬 수 있는 값이 되기 때문이다. 이후 softmax 함수를 사용해 각 vocabulary에 대한 확률값으로 변환하게 되는데, 이 때 log_softmax를 사용해 성능을 향상시킨다. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8172342705654815
      ],
      "excerpt": "log_softmax에서는 dim=-1이 되는데, 마지막 dimension인 len(vocab)에 대한 확률값을 구해야 하기 때문이다. \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/cpm0722/transformer_pytorch/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Jupyter Notebook"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "## [원본 포스트](https://cpm0722.github.io/pytorch-implementation/transformer)",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "transformer_pytorch",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "cpm0722",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/cpm0722/transformer_pytorch/blob/main/README.md",
    "technique": "GitHub API"
  },
  "requirement": [
    {
      "confidence": [
        1
      ],
      "excerpt": "Machine Learning에 대한 기본적인 지식(Back Propagation, Activation Function, Optimizer, Softmax, KL Divergence, Drop-out, Normalization, Regularization, RNN 등)과 NLP의 기본적인 지식(tokenizing, word embedding, vocabulary, Machine Translation, BLEU Score 등)을 안다고 가정한다. 또한 Python, pytorch를 사용해 간단한 model을 만들어낼 수 있다는 것을 전제로 한다.\n\n",
      "technique": "Header extraction"
    }
  ],
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 2,
      "date": "Sat, 25 Dec 2021 00:47:11 GMT"
    },
    "technique": "GitHub API"
  },
  "topics": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "nlp",
      "transformer",
      "pytorch",
      "nlp-model"
    ],
    "technique": "GitHub API"
  }
}