{
  "acknowledgement": [
    {
      "confidence": [
        1
      ],
      "excerpt": "Special thanks to AI Research Lab in Neowiz Play Studio (http://neowizplaystudio.com/ko/) that allowed me to use resources for the project. If you need a white-background dataset, please send an e-mail to the address given below contact information.\n\n위 프로젝트 진행을 위한 리소스를 사용하도록 허락해주신 네오위즈플레이스튜디오 내의 AI연구소에게 감사드립니다. 혹시 제가 사용한 하얀색 배경의 캐릭터 이미지가 필요하신 분들이 있다면 아래 이메일 주소로 문의주시면 감사하겠습니다. \n\n\n",
      "technique": "Header extraction"
    }
  ],
  "arxivLinks": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://arxiv.org/abs/1701.07875</p>\n<p>(2"
    ],
    "technique": "Regular expression"
  },
  "citation": [
    {
      "confidence": [
        0.9350518741113235
      ],
      "excerpt": "For previous works, visit: https://github.com/dabsdamoon/Anime-Colorization \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9105368110547479,
        0.9278824608274014,
        0.9115465676107721
      ],
      "excerpt": "이전 결과물과 관련해서는 이 링크를 참조해주시면 감사하겠습니다 (https://github.com/dabsdamoon/Anime-Colorization). \n<p> (1) https://en.wikipedia.org/wiki/CIELAB_color_space</p> \n<p> (2) https://www.aces.edu/dept/fisheries/education/pond_to_plate/documents/ExplanationoftheLABColorSpace.pdf</p> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9586556701111782
      ],
      "excerpt": "GAN에 관련해서는 이전 repo에 설명하였기 때문에 생략하도록 하겠습니다. 이전 repo에서는 GAN을 제대로 사용하지 못했던 것 같아서, 이번에 다시 한번 적용하여 나은 결과를 도출하고자 하였습니다. 제가 참고한 코드들은 (1)과 (2)에서 참조하였습니다. 또한, GAN을 이용한 많은 colorization project들이 ResNet 혹은 U-Net 구조를 사용합니다. 몇몇 간단한 실험들을 통해, 본 colorization에서는 U-Net 구조가 좀 더 나은 것 같아서 U-Net 구조를 사용하였습니다 (위 결정은 제 개인적인 휴리스틱에서 기반한 결정이기 때문에, 결정과 관련해서 조언들이 있으시다면 언제든지 말씀해주시면 감사하겠습니다).  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.973783563895836
      ],
      "excerpt": "<h5>U-Net architecture: https://lmb.informatik.uni-freiburg.de/people/ronneber/u-net)</h5> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9944484218006108,
        0.8111036989382164,
        0.9944484218006108
      ],
      "excerpt": "<p>(1) https://arxiv.org/abs/1701.07875</p> \n<p>(2) https://vincentherrmann.github.io/blog/wasserstein/(/p> \n<p>(3) https://arxiv.org/pdf/1704.00028.pdf </p> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9741524126558423
      ],
      "excerpt": "<h5>Difference between WGAN weight-clipping and gradient penalty (https://arxiv.org/pdf/1704.00028.pdf) </h5> \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/dabsdamoon/Anime-Colorization-v0.2",
    "technique": "GitHub API"
  },
  "contact": [
    {
      "confidence": [
        1
      ],
      "excerpt": "<p>facebook: https://www.facebook.com/dabin.moon.7 </p>\n<p>email: dabsdamoon@neowiz.com</p>\n",
      "technique": "Header extraction"
    }
  ],
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2019-05-17T03:05:47Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-11-30T04:58:29Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9754846419406816
      ],
      "excerpt": "This repository is an upgrade version of Anime colorization I've done previously by using Keras. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8692651862443214
      ],
      "excerpt": "Since the size of danbooru image dataset is too big, only moeimouto-faces.zip dataset has been used. Notice that in this time I only selected images without background (white background) so that the model can detect facial parts more specifically. Same as the previous repo, I've converted RGB image to LAB image and use L channel for input and AB channel as output. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9826140100638772
      ],
      "excerpt": "After reviewing previous repo, I decided to make more clear definition of objective. My objective is <h5>\"To realistically color gray images!\"</h5> Note that I exclusively tried to use GAN since I want to color the gray image into many different color images. The example similar to my objective can be found in League of Legends, where the game sells chroma packs, a original scheme with different colorizations. In regular supervised learning method, however, one grayscale should have deterministic colorization label in order to train algorithms, and the trained algorithm would yield only the given deterministic colorizations. GAN algorithm, on the other hand, is semi-supervised learning method; in other words, the trained generator from GAN would yield colorization results that seem to be fit into the distribution of colorized images, not the specific colorization. Thus, I treid to use GAN for this project, and gave different noises for testing to observe how the trained generator colorizes a gray image differently.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9789109659219261
      ],
      "excerpt": "Since I've explained about GAN in previous repo, I'll skip the explanation. It seemed that previous repo did not reveal the true power of GAN, so I tried to apply GAN again for this colorization project, hoping the result gets better in this time. Codes I've referenced are from (1) and (2). Also, many colorization projects with GAN model use either ResNet or U-Net architecture for generator. After some experiments, it seems for me that U-Net architecture works better, so I decided to use U-Net architecture (Since the decision is based on my heuristics, it would be grateful if one can give any helpful advice either supporting or objecting the decision). \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8991177558278289
      ],
      "excerpt": "Below are inputs(grayscale) and outputs(colored) of the trained generator using GAN (epoch = 8,192): \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9554398150606609
      ],
      "excerpt": "Well, not as well-colored as \"chroma\", but at least the generator gave me some different colorization results reasonable for me. For example, the generator detects facial parts (eyes, hair, mouth, etc) and colorizes them differently. Also, it's interesting for me to see the colorization result of Taylor, an example out of distribution, seems better than the in-distribution example. Now, I'm going to apply different GAN model called WGAN-GP. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9929930458467465
      ],
      "excerpt": "As I mentioned in previous repo, WGAN(Wasserstein GAN) is one of those new versions by Arjovsky and Bottou (2017)(1), which applies Wasserstein loss instead of KL and JS divergence used for distance for the loss function in original GAN. In (1), the paper brings in the concept of weight clipping the weights in the discriminator in order to satisfy the Lipschitz constraint on the discriminator, a constraint that has to be satisfied in order to compute WGAN loss (For more information, visit (2) since I personally think it's so fat the best explanation I've read about the relationship between WGAN and Lipschitz constraint). \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9685209221874038
      ],
      "excerpt": "However, WGAN also contains some problems such as capacity underuse or exploding/vanishing gradient problem: It's quite obvious that the discriminator will not be optimal if one clips its weight values into certain clipping value. Also, WGAN itself is quite sensitive about the clipping value, so exploding/vanishing gradient problem can be easily occurred. Thus, a new technique of gradient penalty has been introduced in (3), which directly constrains the gradient norm of the discriminator’s output with respect to its input (This is very brief explanation of WGAN-GP, so I recommend reading (3) in order to fully understand WGAN-GP). Interesting point to note is that the discriminator in WGAN-GP does not use BatchNormalization layer since batch normalization makes correlation among inputs of the layer. If there is a correlation among inputs of layer, the gradient norm of the discriminator's output with respect to its input will be changed.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8991177558278289
      ],
      "excerpt": "Below are inputs(grayscale) and outputs(colored) of the trained generator using WGAN-GP (epoch = 2,048): \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8617623819059805
      ],
      "excerpt": "It seems to me that the quality of colorization gets better after using WGAN-GP, but I cannot \"quantify\" how much the result is improved from GAN result. Still, it was worthwhile for me to run WGAN-GP codes and get comparably decent result for colorization. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9962774028563142
      ],
      "excerpt": "So far, I've done coloriztaion of grayscale image to color image. After I've been training algorithms many times with different parameters it seems that WGAN-GP generally seems to produce better results than GAN. However, WGAN-GP is quite slow, and sometimes GAN also produces seemingly better results! It's also ambiguous to define \"better colorization\", so I've learned that professional knowledge regarding colorization is also needed for the project. Also, there are some codes needed to be improved: For example, to apply RandomWeightedAverage, I gave global parameters (batch_size, img_shape_d), which needs to be changed whenever the size of batch is changed :(:( \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "Colorize gray images to RGB with selected dataset (white background only)",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/dabsdamoon/Anime-Colorization-v0.2/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 1,
      "date": "Thu, 23 Dec 2021 08:40:10 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/dabsdamoon/Anime-Colorization-v0.2/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "dabsdamoon/Anime-Colorization-v0.2",
    "technique": "GitHub API"
  },
  "installation": [
    {
      "confidence": [
        0.8918974083095406
      ],
      "excerpt": "이전 결과물과 관련해서는 이 링크를 참조해주시면 감사하겠습니다 (https://github.com/dabsdamoon/Anime-Colorization). \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8976884542297275
      ],
      "excerpt": "One can obtain the dataset used from: https://www.kaggle.com/mylesoneill/tagged-anime-illustrations#danbooru-metadata.zip.  \n",
      "technique": "Supervised classification"
    }
  ],
  "invocation": [
    {
      "confidence": [
        0.8160768449886273
      ],
      "excerpt": "아래의 이미지들은 GAN 모델로 만든 generator의 input(흑백 이미지)와 output(채색 이미지) 입니다 (epoch = 8,192): \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8174540907975313,
        0.8385995582866712
      ],
      "excerpt": "또한 제가 언급한대로 하나의 흑백 이미지를 25가지의 다른 noise들을 사용하여 채색하는 실험을 진행하였습니다. 본 실험에서는 두 장의 다른 흑백 이미지를 사용했는데요, 하나는 training set에 존재하는 흑백이미지고, 다른 하나는 제가 현재 플레이중인 브라운더스트  게임의 캐릭터인 \"테일러\"의 이미지입니다. \n<h5>ONE IN TRAINING DATASET</h5> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8174540907975313
      ],
      "excerpt": "제가 원하던 chroma 급의 퀄리티는 아니지만... 뭐 적어도 generator가 이해가 되는 범위의 다양한 색칠 결과물을 내주었기 때문에 만족하겠습니다. 얼굴 부분부분(눈, 머리, 입 등)을 각각 다르게 색칠하는 게 인상적이네요. 또한, training 분포에 속해있지 않은 BrownDust의 테일러 이미지를 분포에 포함된 애니메이션 캐릭터 이미지보다 더 잘 색칠 것 같다는 느낌이 들어 흥미로웠습니다. 이번에는 다른 algorithm인 WGAN-GP을 한번 사용하고자 합니다. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8693674945303581
      ],
      "excerpt": "아래의 이미지들은 WGAN-GP 모델로 만든 generator의 input(흑백 이미지)와 output(채색 이미지) 입니다 (epoch = 2,048): \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8385995582866712
      ],
      "excerpt": "<h5>ONE IN TRAINING DATASET</h5> \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/dabsdamoon/Anime-Colorization-v0.2/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "HTML",
      "Python"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Anime-Colorization v0.2",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "Anime-Colorization-v0.2",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "dabsdamoon",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/dabsdamoon/Anime-Colorization-v0.2/blob/master/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 2,
      "date": "Thu, 23 Dec 2021 08:40:10 GMT"
    },
    "technique": "GitHub API"
  }
}