{
  "arxivLinks": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://arxiv.org/abs/1810.04805v1, 2018. Em: https://arxiv.org/pdf/1810.04805.pdf\n\nLe, Quoc; Mikolov, Tomas. Distributed Representations of Sentences and Documents. arXiv preprinted https://arxiv.org/abs/1405.4053v2, 2014. Em: https://arxiv.org/pdf/1405.4053v2.pdf\n\nRumelhart, David; Hinton, Geoffrey; Williams, Ronald. Learning representations by back-propagatings errors. Nature Vol 323, 1986. Em: https://www.iro.umontreal.ca/~pift6266/A06/refs/backprop_old.pdf ",
      "https://arxiv.org/abs/1405.4053v2, 2014. Em: https://arxiv.org/pdf/1405.4053v2.pdf\n\nRumelhart, David; Hinton, Geoffrey; Williams, Ronald. Learning representations by back-propagatings errors. Nature Vol 323, 1986. Em: https://www.iro.umontreal.ca/~pift6266/A06/refs/backprop_old.pdf "
    ],
    "technique": "Regular expression"
  },
  "citation": [
    {
      "confidence": [
        0.9999999733321946,
        0.9733794630186853
      ],
      "excerpt": "O objetivo do presente trabalho foi treinar um algoritmo de classificação que pudesse identificar se um texto científico foi elaborado por uma empresa do setor de Óleo & Gás. Para tal, foram extraídos cerca de 25.000 resumos de artigos científicos em inglês utilizando a API da Elsevier, uma das maiores editoras científicas do mundo. Com os documentos extraídos foram preparadas as bases de treino e de teste. Foi utilizado um algoritmo de vetorização de texto, Doc2Vec (Le et al., 2014), para se criar os atributos necessários para se treinar um algoritmo de classificação. Os algoritmos de vetorização de textos buscam, de forma não supervisionada, distribuir os textos em um espaço vetorial levando em consideração a semântica dos documentos. <br/> \nApós testar diversos algoritmos e hiperparâmetros, chegou-se a um F1-score de 86,5% na classificação dos textos utilizando uma Multilayer Perceptron (MLP) (Rumelhart et al., 1986) com 5.000 camadas escondidas e vetorização dos textos de dimensão 50. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9944291469313679
      ],
      "excerpt": "Para a tarefa de identificar quais os artigos eram relevantes foi utilizado o campo “Afiliação” dos autores. Ou seja, caso um dos autores do documento fosse “afiliado” a uma empresa de Petróleo foi considerado que esse era um documento relevante. Esses artigos foram classificados como “O&G” = True. Ao total foram identificados cerca de 15.000 artigos das principais empresas de Petróleo. Os termos utilizados para identificar as empresas de petróleo foram: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9719634626091888
      ],
      "excerpt": "Para compor os documentos classificados como “O&G” = False, foram extraídos os primeiros 1.000 documentos de cada ano, iniciando em 2000 e terminando no ano de 2017.<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9892794222021172,
        0.9779332705307948
      ],
      "excerpt": "•   DOI – Código de identificação do documento utilizado pela Elsevier<br/> \n•   Title – Título do documento<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9507374082549614
      ],
      "excerpt": "•   O&G – Identificação de que pelo menos um dos autores era afiliado a uma empresa de petróleo.<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9970175614009024
      ],
      "excerpt": "Antes de iniciar as etapas de vetorização dos textos e de treinar os algoritmos de classificação foi necessário realizar um pré-processamento dos textos. Segue abaixo um exemplo típico de como o texto foi extraído: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9525675960743487
      ],
      "excerpt": "Pode-se notar a presença de “\\n” que denota quebra de linha, além de vários espaços em branco no início e fim do parágrafo. Também notamos que diversos textos iniciaram com a palavra “Abstract”, ou outra similar (“Publisher Summary”, \"Summary\" ou \"Fundamento\"). Por fim, alguns textos estavam vazios contendo apenas a palavra “Unknown”.<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9630811906933039,
        0.9999607997429768,
        0.9999983647140324
      ],
      "excerpt": "Ao final do pré-processamento restaram 25.645 artigos, sendo 14.418 de “O&G” e 11.227 de outras áreas.<br/> \nAntes de iniciar as etapas de vetorização dos documentos e treino dos algoritmos de classificação o corpus foi dividido em base de treino e base de teste. A base de treino tinha 90% dos documentos e a de teste 10%. As vetorizações e treinamentos foram realizadas apenas na base de treino. \nO algoritmo de vetorização de documentos utilizado foi o Doc2Vec. Este algoritmo é a implantação dos modelos de “Document Embeddings” proposto por Le et al (2014). Foram propostos dois modelos de vetorização de documentos, um é o Phrase Vector – Distributed Memory” (PV-DM) e o outro é o “Phrase Vector – Distributed bag of words” PV-DBOW. Os dois modelos são estruturas de redes neurais que utilizam vetores de palavras e vetores de documentos para prever as palavras seguintes de uma determinada “janela de palavras”. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8356013927728488
      ],
      "excerpt": "•   DM -  Algoritmo de treino a ser usado, PV-DM ou PV-DBOW<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8356013927728488
      ],
      "excerpt": "•   Epochs – Número de iterações sobre o corpus<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8968592401678916,
        0.991553275592551
      ],
      "excerpt": "Inicialmente, os vetores são iniciados com um valor aleatório para cada documento. Conforme o treinamento vai ocorrendo ao longo dos diversos documentos e das diversas épocas de iteração, os valores dos vetores vão se aproximando da representação semântica do conteúdo do documento. <br/> \nAo final da fase de treinamento, o modelo treinado consegue inferir um vetor para um determinado texto que lhe é informado. A fase seguinte, consequentemente, consiste em inferir um vetor para todos os artigos, tanto para a base de treino quanto para a base de teste. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8339103140509874,
        0.823093396043115
      ],
      "excerpt": "A segunda abordagem iniciava treinando um algoritmo “Decision tree” exatamente da mesma forma que na primeira abordagem. Em seguida, utilizou-se o atributo “feature_importances_” do algoritmo “Decision tree” para se identificar quais os atributos do vetor Doc2Vec eram mais importantes para se prever “O&G”. Dessa forma, foi possível utilizar no classificador um número menor de atributos do que o tamanho do vetor treinado. Essa abordagem tentou representar os documentos em um espaço vetorial mais amplo, permitindo uma representação semântica mais variada, e ao mesmo evitar “overfiting” dos modelos de classificação.<br/> \nOs modelos de classificação testado , sempre usando biblioteca Scikit Learn, foram:<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8592871015078041,
        0.9970005095926127
      ],
      "excerpt": "As métricas de avaliação utilizadas para a escolha dos hiperparâmetros e algoritmos foi F1-score. Também foi calculado os valores de acurácia, precisão e revocação. \nUma técnica testada foi o “data augmentation”. O objetivo era ampliar o conjunto de treino possibilitando um melhor treinamento dos algoritmos de vetorização e de classificação. Também foi aplicado um certo desbalanceamento de forma que os documentos “O&G” ficassem sobrerrepresentados. O intuito era de representar com mais detalhes os atributos relacionados aos documentos de “O&G”.<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8047696154562745,
        0.9030859728368266
      ],
      "excerpt": "Algoritmo de Classificação – Support Vector Machine<br/> \nTeste/ Treino – 10% / 90%<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8356013927728488,
        0.8109194328925066
      ],
      "excerpt": "Número de atributos usados para treino – 100<br/> \nApós treinar e classificar usando os hiperparâmetros do caso base chegou-se às seguintes métricas de classificação:<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8283216015784888,
        0.9030859728368266
      ],
      "excerpt": "Algoritmo de Classificação – Multilayer Perceptron com 5000 camadas escondidas<br/> \nTeste/ Treino – 10% / 90%<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9990883107155913,
        0.9999999750896226,
        0.9999936979358408
      ],
      "excerpt": "A vetorização de texto pode ser utilizada em combinação com os algoritmos clássicos em tarefas de classificação. No entanto, apesar de se possuir um corpus relativamente grande e testando diversas combinações de hiperparâmtros, essa técnica demonstrou não ultrapassar a barreira de F1-score de 87%. Para muitas tarefas esse resultado é “boa o suficiente” e com certeza realiza a tarefa muito mais rápido do que seres humanos. No entanto, se for necessário uma acurácia maior será preciso utilizar uma técnica mais robustas e com custo computacional maior, como as técnicas de Deep Learning para Processamento de Linguagem Natural. \nDevlin, Jacob; Chang, Ming-Wei; Lee, Kenton; Toutanova, Kristina. BERT: Pre-training of deep bidirectional transformers for language understanding. arXiv preprinted arXiv:1810.04805v1, 2018. Em: https://arxiv.org/pdf/1810.04805.pdf \nLe, Quoc; Mikolov, Tomas. Distributed Representations of Sentences and Documents. arXiv preprinted arXiv:1405.4053v2, 2014. Em: https://arxiv.org/pdf/1405.4053v2.pdf \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/fabiocorreacordeiro/Elsevier_abstracts-Classification",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2019-01-03T09:58:07Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2019-03-22T14:36:54Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9993214485712676
      ],
      "excerpt": "\"\\n               Abstract\\n               \\n                  Technology advancements and the increasing need for fresh water resources have created the potential for desalination of oil field brine (produced water) to be a cost-effective fresh water resource for beneficial reuse. At the mature oil and gas production areas in the northeast of Brazil, the majority of wells produce a substantial amount of water in comparison with oil production (more than 90%). At these fields, the produced water has to be treated on site only for oil and solids removal aiming re-injection. The aim of this work is to assess the quality of the produced water stream after a reverse osmosis desalination process in terms of physicochemical characteristics influencing reuse of the water for irrigation or other beneficial uses.\\n               \\n            \" \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8243307787453192
      ],
      "excerpt": "Para a classificação foram testadas duas estratégias diferentes. A primeira consistia em utilizar os vetores do algoritmo Doc2Vec como atributos para os algoritmos de classificação e a coluna “O&G” como classe a ser prevista. Em seguida utilizou alguns dos algoritmos da biblioteca Scikit Learn  para treinar e avaliar o classificador.<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8616362602843775
      ],
      "excerpt": "Os modelos de classificação testado , sempre usando biblioteca Scikit Learn, foram:<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8979411005071259
      ],
      "excerpt": "Data Augmentation – Não<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8979411005071259
      ],
      "excerpt": "Data Augmentation – Não<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "O objetivo desse trabalho foi treinar um algoritmo de classificação que pudesse identificar se um texto científico foi elaborado por uma empresa do setor de Óleo & Gás. ",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/fabiocorreacordeiro/Elsevier_abstracts-Classification/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 0,
      "date": "Sat, 25 Dec 2021 15:03:06 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/fabiocorreacordeiro/Elsevier_abstracts-Classification/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "fabiocorreacordeiro/Elsevier_abstracts-Classification",
    "technique": "GitHub API"
  },
  "hasExecutableNotebook": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://raw.githubusercontent.com/fabiocorreacordeiro/Elsevier_abstracts-Classification/master/Abstract%20Classification.ipynb",
      "https://raw.githubusercontent.com/fabiocorreacordeiro/Elsevier_abstracts-Classification/master/Abstract%20Extration.ipynb",
      "https://raw.githubusercontent.com/fabiocorreacordeiro/Elsevier_abstracts-Classification/master/Abstract%20Concatenation.ipynb"
    ],
    "technique": "File Exploration"
  },
  "invocation": [
    {
      "confidence": [
        0.853492186136904
      ],
      "excerpt": "•   Total<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8183181927103621
      ],
      "excerpt": "•   Epoch – 100<br/> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8183181927103621
      ],
      "excerpt": "•   Epoch – 100<br/> \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/fabiocorreacordeiro/Elsevier_abstracts-Classification/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Jupyter Notebook"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Elsevier_abstracts-Classification",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "Elsevier_abstracts-Classification",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "fabiocorreacordeiro",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/fabiocorreacordeiro/Elsevier_abstracts-Classification/blob/master/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 1,
      "date": "Sat, 25 Dec 2021 15:03:06 GMT"
    },
    "technique": "GitHub API"
  }
}