{
  "arxivLinks": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://arxiv.org/abs/1711.11585",
      "https://arxiv.org/abs/1903.07291",
      "https://arxiv.org/abs/1703.00848",
      "https://arxiv.org/abs/1804.04732",
      "https://arxiv.org/abs/1905.01723",
      "https://arxiv.org/abs/2007.07431",
      "https://arxiv.org/abs/1808.06601",
      "https://arxiv.org/abs/1808.06601",
      "https://arxiv.org/abs/2007.08509",
      "https://arxiv.org/abs/2104.07659"
    ],
    "technique": "Regular expression"
  },
  "citation": [
    {
      "confidence": [
        0.865307621850189
      ],
      "excerpt": "optimized implementation of several image and video synthesis methods developed at NVIDIA. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9771037828882837,
        0.9957590444343235
      ],
      "excerpt": "|pix2pixHD     | Learn a mapping that converts a semantic image to a high-resolution photorealistic image.                       |    Wang et. al. CVPR 2018 | \n|SPADE             | Improve pix2pixHD on handling diverse input labels and delivering better output quality.                        |    Park et. al. CVPR 2019 | \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9788706545635925,
        0.9886056731719062
      ],
      "excerpt": "|UNIT               | Learn a one-to-one mapping between two visual domains.                                                          |    Liu et. al. NeurIPS 2017 | \n|MUNIT             | Learn a many-to-many mapping between two visual domains.                                                        |    Huang et. al. ECCV 2018 | \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9719694102387836
      ],
      "excerpt": "|COCO-FUNIT   | Improve FUNIT with a content-conditioned style encoding scheme for style code computation.                      |    Saito et. al. ECCV 2020 | \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9983751449426307,
        0.9782166590862389
      ],
      "excerpt": "|vid2vid         | Learn a mapping that converts a semantic video to a photorealistic video.                                       |    Wang et. al. NeurIPS 2018 | \n|fs-vid2vid   | Learn a subject-agnostic mapping that converts a semantic video and an example image to a photoreslitic video.  |    Wang et. al. NeurIPS 2019 | \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/NVlabs/imaginaire",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2020-07-15T01:17:40Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-12-28T02:05:02Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9571063900105204
      ],
      "excerpt": "Imaginaire is a pytorch library that contains \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9463436363460922
      ],
      "excerpt": "We have a tutorial for each model. Click on the model name, and your browser should take you to the tutorial page for the project. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "NVIDIA's Deep Imagination Team's PyTorch Library",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/nvlabs/imaginaire/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 317,
      "date": "Tue, 28 Dec 2021 11:27:37 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/NVlabs/imaginaire/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "NVlabs/imaginaire",
    "technique": "GitHub API"
  },
  "hasScriptFile": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://raw.githubusercontent.com/nvlabs/imaginaire/master/scripts/build_lmdb.sh",
      "https://raw.githubusercontent.com/nvlabs/imaginaire/master/scripts/test_training.sh",
      "https://raw.githubusercontent.com/nvlabs/imaginaire/master/scripts/test_inference.sh",
      "https://raw.githubusercontent.com/nvlabs/imaginaire/master/scripts/install.sh",
      "https://raw.githubusercontent.com/nvlabs/imaginaire/master/scripts/start_local_docker.sh",
      "https://raw.githubusercontent.com/nvlabs/imaginaire/master/scripts/build_docker.sh"
    ],
    "technique": "File Exploration"
  },
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/NVlabs/imaginaire/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Python",
      "Cuda",
      "Shell",
      "C++",
      "Batchfile",
      "Makefile"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "name": "Other"
    },
    "technique": "GitHub API"
  },
  "licenseText": {
    "confidence": [
      1.0
    ],
    "excerpt": "b'# NVIDIA Source Code License for Imaginaire \\n\\n## 1. Definitions \\n \\n- \\xe2\\x80\\x9cLicensor\\xe2\\x80\\x9d means any person or entity that distributes its Work. \\n\\n-  \\xe2\\x80\\x9cSoftware\\xe2\\x80\\x9d means the original work of authorship made available under this License. \\n\\n-  \\xe2\\x80\\x9cWork\\xe2\\x80\\x9d means the Software and any additions to or derivative works of the Software that are made available under this License. \\n\\n-  \\xe2\\x80\\x9cNVIDIA Processors\\xe2\\x80\\x9d means any central processing unit (CPU), graphics processing unit (GPU), field-programmable gate array (FPGA), application-specific integrated circuit (ASIC) or any combination thereof designed, made, sold, or provided by NVIDIA or its affiliates. \\n\\n-  The terms \\xe2\\x80\\x9creproduce,\\xe2\\x80\\x9d \\xe2\\x80\\x9creproduction,\\xe2\\x80\\x9d \\xe2\\x80\\x9cderivative works,\\xe2\\x80\\x9d and \\xe2\\x80\\x9cdistribution\\xe2\\x80\\x9d have the meaning as provided under U.S. copyright law; provided, however, that for the purposes of this License, derivative works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the Work. \\n\\n-  Works, including the Software, are \\xe2\\x80\\x9cmade available\\xe2\\x80\\x9d under this License by including in or with the Work either (a) a copyright notice referencing the applicability of this License to the Work, or (b) a copy of this License. \\n\\n## 2. License Grant \\n\\n### 2.1 Copyright Grant. \\n\\nSubject to the terms and conditions of this License, each Licensor grants to you a perpetual, worldwide, non-exclusive, royalty-free, copyright license to reproduce, prepare derivative works of, publicly display, publicly perform, sublicense and distribute its Work and any resulting derivative works in any form.\\n\\n## 3. Limitations\\n\\n### 3.1 Redistribution. \\n\\nYou may reproduce or distribute the Work only if (a) you do so under this License, (b) you include a complete copy of this License with your distribution, and (c) you retain without modification any copyright, patent, trademark, or attribution notices that are present in the Work.\\n\\n### 3.2 Derivative Works.\\n\\nYou may specify that additional or different terms apply to the use, reproduction, and distribution of your derivative works of the Work (\\xe2\\x80\\x9cYour Terms\\xe2\\x80\\x9d) only if (a) Your Terms provide that the use limitation in Section 3.3 applies to your derivative works, and (b) you identify the specific derivative works that are subject to Your Terms. Notwithstanding Your Terms, this License (including the redistribution requirements in Section 3.1) will continue to apply to the Work itself.\\n \\n### 3.3 Use Limitation.\\n\\nThe Work and any derivative works thereof only may be used or intended for use non-commercially and with NVIDIA Processors. Notwithstanding the foregoing, NVIDIA and its affiliates may use the Work and any derivative works commercially. As used herein, \\xe2\\x80\\x9cnon-commercially\\xe2\\x80\\x9d means for research or evaluation purposes only.\\n\\n### 3.4 Patent Claims.\\n\\nIf you bring or threaten to bring a patent claim against any Licensor (including any claim, cross-claim or counterclaim in a lawsuit) to enforce any patents that you allege are infringed by any Work, then your rights under this License from such Licensor (including the grant in Section 2.1) will terminate immediately.\\n\\n### 3.5 Trademarks.\\n\\nThis License does not grant any rights to use any Licensor\\xe2\\x80\\x99s or its affiliates\\xe2\\x80\\x99 names, logos, or trademarks, except as necessary to reproduce the notices described in this License.\\n\\n### 3.6 Termination.\\n\\nIf you violate any term of this License, then your rights under this License (including the grant in Section 2.1) will terminate immediately.\\n\\n## 4. Disclaimer of Warranty. \\n\\nTHE WORK IS PROVIDED \\xe2\\x80\\x9cAS IS\\xe2\\x80\\x9d WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING WARRANTIES OR CONDITIONS OF M ERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE OR NON-INFRINGEMENT. YOU BEAR THE RISK OF UNDERTAKING ANY ACTIVITIES UNDER THIS LICENSE.  \\n\\n## 5. Limitation of Liability. \\n\\nEXCEPT AS PROHIBITED BY APPLICABLE LAW, IN NO EVENT AND UNDER NO LEGAL THEORY, WHETHER IN TORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE SHALL ANY LICENSOR BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT OF OR RELATED TO THIS LICENSE, THE USE OR INABILITY TO USE THE WORK (INCLUDING BUT NOT LIMITED TO LOSS OF GOODWILL, BUSINESS INTERRUPTION, LOST PROFITS OR DATA, COMPUTER FAILURE OR MALFUNCTION, OR ANY OTHER COMM ERCIAL DAMAGES OR LOSSES), EVEN IF THE LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. \\n'",
    "technique": "File Exploration"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Imaginaire",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "imaginaire",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "NVlabs",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "Organization",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/NVlabs/imaginaire/blob/master/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 3009,
      "date": "Tue, 28 Dec 2021 11:27:37 GMT"
    },
    "technique": "GitHub API"
  }
}