{
  "acknowledgement": [
    {
      "confidence": [
        1
      ],
      "excerpt": "We thank professor Dr. Ming Dong for his guidance with the concepts of Deep Learning &amp; his insights regarding the approach of solving a classification task like this and teaching assistant Mr. Qisheng He for his valuable inputs with Keras &amp; Tensorflow.\n\n",
      "technique": "Header extraction"
    }
  ],
  "arxivLinks": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://arxiv.org/abs/1406.2661](https://arxiv.org/abs/1406.2661",
      "https://arxiv.org/abs/1406.2661",
      "https://arxiv.org/abs/1511.06434](https://arxiv.org/abs/1511.06434",
      "https://arxiv.org/abs/1511.06434"
    ],
    "technique": "Regular expression"
  },
  "citation": [
    {
      "confidence": [
        1
      ],
      "excerpt": "1. I. J. Goodfellow, J. Pouget-Abadie, M. Mirza, B. Xu, D. Warde-Farley, S. Ozair, A. Courville, &amp; Y. Bengio. (2014, Jun.). &quot;Generative Adversarial Networks.&quot; ArXiv E-Prints. [On-line]. Available: [https://arxiv.org/abs/1406.2661](https://arxiv.org/abs/1406.2661) [7 May 2018].\n2. A. Radford, L. Metz, &amp; S. Chintala. (2016, Jan.). &quot;Unsupervised representation learning with deep convolutional generative adversarial networks.&quot; ArXiv E-Prints. [On-line]. Available: [https://arxiv.org/abs/1511.06434](https://arxiv.org/abs/1511.06434) [7 Jan 2016].\n3. Unsupervised Learning for Cell-level Visual Representation in Histopathology Images with Generative Adversarial Networks Bo Hu] , Ye Tang] , Eric I-Chao Chang, Yubo Fan, Maode Lai and Yan Xu\\*.[https://arxiv.org/pdf/1711.11317.pdf](https://arxiv.org/pdf/1711.11317.pdf)\n4. V. Vargas &amp; J. Koller. &quot;GAN-for-Nuclei-Detection.&quot; Internet: [https://github.com/vmvargas/GAN-for-Nuclei-Detection](https://github.com/vmvargas/GAN-for-Nuclei-Detection) , May 7, 2018 [7 May 2018].\n5. J. Xu, L. Xiang, Q. Liu, H. Gilmore, J. Wu, J. Tang, &amp; A. Madabhushi, &quot;Stacked sparse autoencoder (SSAE) for nuclei detection on breast cancer histopathology images,&quot; in IEEE Transactions on Medical Imaging, Vol. 35 no. 1, pp. 119-130, July 2016. [https://europepmc.org/article/pmc/pmc4729702](https://europepmc.org/article/pmc/pmc4729702)\n6. Keras implementation of General Adversarial Network - [https://github.com/eriklindernoren/Keras-GAN](https://github.com/eriklindernoren/Keras-GAN)\n7. Coupled GAN code by authors - [https://github.com/mingyuliutw/CoGAN](https://github.com/mingyuliutw/CoGAN)\n8. Conditional GAN - [https://machinelearningmastery.com/how-to-develop-a-conditional-generative-adversarial-network-from-scratch/](https://machinelearningmastery.com/how-to-develop-a-conditional-generative-adversarial-network-from-scratch/)\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        0.8714162992508173
      ],
      "excerpt": "Dr. Ming Dong \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/pharikal/Breast-Cancer-Detection-Using-Deep-Learning",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2020-04-26T21:41:08Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-06-04T08:22:44Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9780815647304852,
        0.8511025184271078
      ],
      "excerpt": "CSC7991: Introduction to Deep Learning \nFinal Project Report \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9009614607129621
      ],
      "excerpt": "Group 7  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9996424085296082,
        0.998864203390071,
        0.9970479182468275,
        0.9973945811106046,
        0.9940417848890448,
        0.8245869333920658,
        0.9905326381626358,
        0.92460716329724,
        0.8299830077692933,
        0.9437647768430579
      ],
      "excerpt": "This course project is based on Nuclei Detection on Histopathology Images to identify Breast Cancer using Deep Learning. The major goal of this course project is to experiment deep learning techniques covered under CSC 7991: Introduction to Deep Learning and work towards implementation of those knowledge to develop a near to perfect model in predicting Breast Cancer. The more accurate the models are, more chances of artificial systems to predict if the person is having Breast Cancer. The process of Nuclei detection in high-grade breast cancer images is quite challenging in the case of image processing techniques due to certain heterogeneous characteristics of cancer nuclei such as enlarged and irregularly shaped nuclei. The visual attributes of cells, such as the nuclear morphology, are critical for histopathology image analysis.__Based on the proposed cell-level visual representation learning, we further develop a pipeline that exploits the varieties of cellular elements to perform histopathology image classification._ \nBreast Cancer is a group of disease in which cells in breast tissue change and divide uncontrollably leading to lump or mass. It is the most common type of cancer which causes 411,000 annual deaths worldwide. After skin cancer, breast cancer is the most common cancer diagnosed in women in the United States and still open area for research especially, the area digital image analysis. Hence the major motivation of this course project is to develop an effective product in medical domain that extracts features from histopathology images and helps in identification of breast cancer. \nSupervised learning with convolutional networks (CNNs) has seen huge adoption in computer vision applications but proven to be computationally extensive. Our implementation of this product covers conventional CNN approach to Generative adversarial networks (GAN) for nuclei-detection of histopathology images. GAN models have evolved over time. Thus, our further experiment contains multiple variations of GANs. The results are compared with respect to accuracy and performance, to find best deep learning model for our problem. \nConvolutional neural networks (CNN) is a special type of artificial neural network architecture with some features of the visual cortex and works phenomenally well on computer vision tasks like image classification, object detection, image recognition, etc. They are composed of many &quot;filters&quot;, which convolve, or slide across the data, and produce an activation at every slide position. But when it comes to data synthesizing and image-to-image translation, CNNs do not work that well. GANs typically works best as image synthesizers and typically use CNN architectures for their generator and discriminator models. \nGenerative adversarial networks (GANs) are algorithmic architectures that use two neural networks, pitting one against the other (thus the &quot;adversarial&quot;) in order to generate new, synthetic or fake instances of data that can pass for real data. The model consists of a generative model and a discriminative model – both realized as multilayer perceptrons (MLPs). In this architecture a generative model G captures the data distribution, and its adversary a discriminative model D estimates the probability that a sample came from the training data rather than G. The training procedure for G is to maximize the probability of D making a mistake. This framework corresponds to a minimax two-player. \nThe conditional generative adversarial network, or cGAN is a variation of GAN which involves the conditional generation of images by a generator model. Image generation can be conditional on a class label, in case available, allowing the targeted generation of images of a given domain. \nSupervised learning with convolutional networks (CNNs) has seen huge success in analyzing histopathological applications. In comparison to that unsupervised learning with CNN has not been successful. The idea of DCGAN help to mitigate that problem. A class of CNNs also known as DCGANs, which have certain architectural constraints, shows that they are suitable for unsupervised learning. We extend this architecture to make it supervised such that it can solve our classification with less computational cost. \nSGAN is an architecture which is based on semi-supervised context by forcing D to output N+1 different output class, N different &quot;real&quot; classes, and an additional fake class (anything that came from G). In our case, N=2 (real nuclei, and real non-nuclei). \nRegular GANs hypothesize the discriminator as a classifier with the sigmoid cross entropy loss function. This loss function may lead to the vanishing gradients problem during the learning process. To overcome such a problem, the conventional loss function for discriminator is replaced with least squares loss function. There are two benefits of LSGANs over regular GANs. First, LSGANs can generate higher quality images than regular GANs. Second, LSGANs perform more stable during the learning process. \nCOGAN consists of pair of GANs. Ming et al proposed CoGAN architecture can learn a joint distribution without any tuple of corresponding images. It can learn a joint distribution with just samples drawn from the marginal distributions. This is achieved by enforcing a weight-sharing constraint that limits the network capacity and favors a joint distribution solution over a product of marginal distributions one. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9987250499737484
      ],
      "excerpt": "The major motivation of this course project is to develop an effective product using Deep Learning method especially in the field of GANs and provide the comparable accuracy of the literature study done. Our novel contribution is to build all GAN models using supervised or semi-supervised learning methods and to choose best GAN model for classification of histopathology images in predicting breast cancer. Additionally, we will change some of the architectural constraints to fine tune the model accuracy and make the model suitable for supervised/semi-supervised learning. We propose additional momentum which stabilized most of our training procedure. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8513654429007592,
        0.9720983232124585,
        0.8704818582122114,
        0.9192535849839245
      ],
      "excerpt": "The original data set contains 537 hematoxylin–eosin (H &amp; E) stained histopathological images obtained from digitized glass slides. H&amp;E stained breast histopathology glass slides were scanned into a computer using a high-resolution whole slide scanner, Aperio ScanScope digitizer, at 40x optical magnification. \nThe dataset corresponds to 49 lymph node-negative and estrogen receptor positive breast cancer (LN-, ER+ BC) patients at Case Western Reserve University. For sake of running the models with our existing configurations we borrowed the dataset used by Xu et al which contains less amount samples. \nThe training data includes 2,000 nuclear and 6,000 non-nuclear patches. \nThere are 1,000 patches for validation, 500 nuclear patches and 500 non-nuclear. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "Dataset Link",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/pharikal/Breast-Cancer-Detection-Using-Deep-Learning/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 2,
      "date": "Tue, 28 Dec 2021 11:36:53 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/pharikal/Breast-Cancer-Detection-Using-Deep-Learning/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "pharikal/Breast-Cancer-Detection-Using-Deep-Learning",
    "technique": "GitHub API"
  },
  "installation": [
    {
      "confidence": [
        0.8230338648385525
      ],
      "excerpt": "The dataset can be obtained from  \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/pharikal/Breast-Cancer-Detection-Using-Deep-Learning/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Python"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Breast Cancer Detection using Deep Learning",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "Breast-Cancer-Detection-Using-Deep-Learning",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "pharikal",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/pharikal/Breast-Cancer-Detection-Using-Deep-Learning/blob/master/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 4,
      "date": "Tue, 28 Dec 2021 11:36:53 GMT"
    },
    "technique": "GitHub API"
  },
  "topics": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "deep-learning",
      "gan",
      "breast-cancer",
      "histopathology-images"
    ],
    "technique": "GitHub API"
  }
}