{
  "acknowledgement": [
    {
      "confidence": [
        1
      ],
      "excerpt": "***03.06.2020:*** _Privacy-Enhancement based on Minimum Information Units (PE-MIU) was added._\n\n***25.02.2020:*** _Negative Face Recognition was added._\n\n***17.12.2019:*** _Two more methods are currently under review and will be added as soon as they are accepted._\n\nThis repository provides implementations of different supervised and unsupervised methods to enhance the soft-biometric privacy of face recognition models.\n\nIf you use this code for a scientific publication, we would appreciate citations of the associated papers.\n\nFor further questions, please contact the provided e-mail adresses in the papers.\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        1
      ],
      "excerpt": "* [Research Paper (arXiv)](https://arxiv.org/abs/2002.09181)\n* [Implementation](./unsupervised/negative_face_recognition/negative_face_recognition.py)\n* [Example](./unsupervised/negative_face_recognition/nfr_example.py)\n\n**Unsupervised Enhancement of Soft-biometric Privacy with Negative Face Recognition**, 2020 \n\n***Abstract*** \n\nCurrent research on soft-biometrics showed that privacy-sensitive information can be deduced from biometric templates of an individual. Since for many applications, these templates are expected to be used for recognition purposes only, this raises major privacy issues. Previous works focused on supervised privacy-enhancing solutions that require privacy-sensitive information about individuals and limit their application to the suppression of single and pre-defined attributes. Consequently, they do not take into account attributes that are not considered in the training. In this work, we present Negative Face Recognition (NFR), a novel face recognition approach that enhances the soft-biometric privacy on the template-level by representing face templates in a complementary (negative) domain. While ordinary templates characterize facial properties of an individual, negative templates describe facial properties that does not exist for this individual. This suppresses privacy-sensitive information from stored templates. Experiments are conducted on two publicly available datasets captured under controlled and uncontrolled scenarios on three privacy-sensitive attributes. The experiments demonstrate that our proposed approach reaches higher suppression rates than previous work, while maintaining higher recognition performances as well. Unlike previous works, our approach does not require privacy-sensitive labels and offers a more comprehensive privacy-protection not limited to pre-defined attributes. \n\n```\n@misc{terhrst2020unsupervised,\n    title={Unsupervised Enhancement of Soft-biometric Privacy with Negative Face Recognition},\n    author={Philipp Terhörst and Marco Huber and Naser Damer and Florian Kirchbuchner and Arjan Kuijper},\n    year={2020},\n    eprint={2002.09181},\n    archivePrefix={arXiv},\n    primaryClass={cs.CV}\n}\n```\n\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        1
      ],
      "excerpt": "* [Research Paper (IEEE)](https://ieeexplore.ieee.org/document/9094207)\n* [Research Paper (ResearchGate)](https://www.researchgate.net/publication/341420117_PE-MIU_A_Training-Free_Privacy-Enhancing_Face_Recognition_Approach_Based_on_Minimum_Information_Units)\n* [Implementation](./training_free/pe_miu/privacy_enhancing_miu.py)\n* [Example](./training_free/pe_miu/example_pe_miu.py)\n\n**PE-MIU: A Training-Free Privacy-Enhancing Face Recognition Approach Based on Minimum Information Units**, IEEE Access, 2020\n\n***Abstract***\n\nResearch on soft-biometrics showed that privacy-sensitive information can be deduced from biometric data. Utilizing biometric templates only, information about a persons gender, age, ethnicity, sexual orientation, and health state can be deduced. For many applications, these templates are expected to be used for recognition purposes only. Thus, extracting this information raises major privacy issues. Previous work proposed two kinds of learning-based solutions for this problem. The first ones provide strong privacy-enhancements, but limited to pre-defined attributes. The second ones achieve more comprehensive but weaker privacy-improvements. In this work, we propose a Privacy-Enhancing face recognition approach based on Minimum Information Units (PE-MIU). PE-MIU, as we demonstrate in this work, is a privacy-enhancement approach for face recognition templates that achieves strong privacy-improvements and is not limited to pre-defined attributes. We exploit the structural differences between face recognition and facial attribute estimation by creating templates in a mixed representation of minimal information units. These representations contain pattern of privacy-sensitive attributes in a highly randomized form. Therefore, the estimation of these attributes becomes hard for function creep attacks. During verification, these units of a probe template are assigned to the units of a reference template by solving an optimal best-matching problem. This allows our approach to maintain a high recognition ability. The experiments are conducted on three publicly available datasets and with five state-of-the-art approaches. Moreover, we conduct the experiments simulating an attacker that knows and adapts to the systems privacy mechanism. The experiments demonstrate that PE-MIU is able to suppress privacy-sensitive information to a significantly higher degree than previous work in all investigated scenarios. At the same time, our solution is able to achieve a verification performance close to that of the unmodified recognition system. Unlike previous works, our approach offers a strong and comprehensive privacy-enhancement without the need of training.\n\n\n```\n@article{9094207,\n  author={P. {Terhörst} and K. {Riehl} and N. {Damer} and P. {Rot} and B. {Bortolato} and F. {Kirchbuchner} and V. {Struc} and A. {Kuijper}},\n  journal={IEEE Access}, \n  title={{PE-MIU}: A Training-Free Privacy-Enhancing Face Recognition Approach Based on Minimum Information Units}, \n  year={2020},\n  volume={8},\n  number={},\n  pages={93635-93647}\n}\n\n```\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        1
      ],
      "excerpt": " \nThis work was supported by the German Federal Ministry of Education and Research (BMBF) as well as by the Hessen State Ministry for Higher Education, Research and the Arts (HMWK) within the National Research Center for Applied Cybersecurity ATHENE.\n\nPortions of the research came from the Software Campus project supported by the German Federal Ministry of Education and Research (BMBF).\n\n",
      "technique": "Header extraction"
    }
  ],
  "arxivLinks": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://arxiv.org/abs/2002.09181"
    ],
    "technique": "Regular expression"
  },
  "citation": [
    {
      "confidence": [
        1.0
      ],
      "excerpt": "@article{9094207,\n  author={P. {Terhörst} and K. {Riehl} and N. {Damer} and P. {Rot} and B. {Bortolato} and F. {Kirchbuchner} and V. {Struc} and A. {Kuijper}},\n  journal={IEEE Access}, \n  title={{PE-MIU}: A Training-Free Privacy-Enhancing Face Recognition Approach Based on Minimum Information Units}, \n  year={2020},\n  volume={8},\n  number={},\n  pages={93635-93647}\n}",
      "technique": "Regular expression"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "@misc{terhrst2020unsupervised,\n    title={Unsupervised Enhancement of Soft-biometric Privacy with Negative Face Recognition},\n    author={Philipp Terhörst and Marco Huber and Naser Damer and Florian Kirchbuchner and Arjan Kuijper},\n    year={2020},\n    eprint={2002.09181},\n    archivePrefix={arXiv},\n    primaryClass={cs.CV}\n}",
      "technique": "Regular expression"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "@article{DBLP:journals/apin/TerhorstDKK19,\n  author    = {Philipp Terh{\\\"{o}}rst and\n               Naser Damer and\n               Florian Kirchbuchner and\n               Arjan Kuijper},\n  title     = {Unsupervised privacy-enhancement of face representations using similarity-sensitive\n               noise transformations},\n  journal   = {Appl. Intell.},\n  volume    = {49},\n  number    = {8},\n  pages     = {3043--3060},\n  year      = {2019},\n  url       = {https://doi.org/10.1007/s10489-019-01432-5},\n  doi       = {10.1007/s10489-019-01432-5},\n  timestamp = {Wed, 25 Sep 2019 17:51:08 +0200},\n  biburl    = {https://dblp.org/rec/bib/journals/apin/TerhorstDKK19},\n  bibsource = {dblp computer science bibliography, https://dblp.org}\n}",
      "technique": "Regular expression"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "@inproceedings{icb2019_PT,\n  author    = {Philipp Terh{\\\"{o}}rst and\n               Naser Damer and\n               Florian Kirchbuchner and\n               Arjan Kuijper},\n  title     = {Suppressing Gender and Age in Face Templates Using Incremental Variable Elimination},\n  booktitle = {2019 International Conference on Biometrics, {ICB} 2019, Crete,\n               Greece, June 4-7, 2019},\n  publisher = {{IEEE}},\n  year      = {2019},\n}",
      "technique": "Regular expression"
    },
    {
      "confidence": [
        0.9358223674441953
      ],
      "excerpt": "Research Paper \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9986750871215112
      ],
      "excerpt": "Suppressing Gender and Age in Face Templates Using Incremental Variable Elimination, International Conference on Biometrics (ICB), 2019 \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9822591650047073,
        0.9358223674441953
      ],
      "excerpt": "Research Paper (Springer) \nResearch Paper (ResearchGate) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8763238349208974
      ],
      "excerpt": "Unsupervised Privacy-enhancement of Face Representations Using Similarity-sensitive Noise Transformations, Applied Intelligence, 2018 \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/pterhoer/PrivacyPreservingFaceRecognition",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2019-12-17T15:08:08Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-11-14T05:09:17Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9962948360668018
      ],
      "excerpt": "Recent research on soft-biometrics showed that more information than just the person’s identity can be deduced from biometric data. Using face templates only, information about gender, age, ethnicity, health state of the person, and even the sexual orientation can be automatically obtained. Since for most applications these templates are expected to be used for recognition purposes only, this raises major privacy issues. Previous work addressed this problem purely on image level regarding function creep attackers without knowledge about the systems privacy mechanism. In this work, we propose a soft-biometric privacy enhancing approach that reduces a given biometric template by eliminating its most important variables for predicting soft-biometric attributes. Training a decision tree ensemble allows deriving a variable importance measure that is used to incrementally eliminate variables that allow predicting sensitive attributes. Unlike previous work, we consider a scenario of function creep attackers with explicit knowledge about the privacy mechanism and evaluated our approach on a publicly available database. The experiments were conducted to eight baseline solutions. The results showed that in many cases IVE is able to suppress gender and age to a high degree with a negligible loss of the templates recognition ability. Contrary to previous work, which is limited to the suppression of binary (gender) attributes, IVE is able, by design, to suppress binary, categorical, and continuous attributes. \n",
      "technique": "Supervised classification"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/pterhoer/PrivacyPreservingFaceRecognition/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 1,
      "date": "Sun, 26 Dec 2021 10:52:43 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/pterhoer/PrivacyPreservingFaceRecognition/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "pterhoer/PrivacyPreservingFaceRecognition",
    "technique": "GitHub API"
  },
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/pterhoer/PrivacyPreservingFaceRecognition/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Python"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "name": "MIT License",
      "url": "https://api.github.com/licenses/mit"
    },
    "technique": "GitHub API"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Privacy-Preserving Face Recognition",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "PrivacyPreservingFaceRecognition",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "pterhoer",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/pterhoer/PrivacyPreservingFaceRecognition/blob/master/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 8,
      "date": "Sun, 26 Dec 2021 10:52:43 GMT"
    },
    "technique": "GitHub API"
  },
  "topics": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "privacy-preserving",
      "face-recognition",
      "biometrics",
      "machine-learning",
      "similarity-sensitive-noise",
      "incremental-variable-elimination",
      "privacy"
    ],
    "technique": "GitHub API"
  }
}