{
  "acknowledgement": [
    {
      "confidence": [
        1
      ],
      "excerpt": "In contrast with the standard paradigms of machine learning, \nthe less common ​structured learning approach attempts to use structural information of both the classified objects and \nthe classification domain. An even lesser known research area takes this idea a step further by articulating \nthe structural aspect as a formal grammar that defines rules that derive signal constructs to classification constructs.\nWe propose an approach where both sound and its semantics are expressed in a manner that enables the detection system \nto take advantage of the structural aspects of both.\nThe importance of a structural framework is further supported as we attempt to go beyond detecting isolated \n​sound occurrence​ toward interpreting sequences of these occurrences and discovering ​sound generating activities​. \nThese sound generating activities can be expressed through ontologies \nand sequential rules composed from other semantical elements.\n \n\nThis approach has been coined as “syntactical pattern recognition” or “grammar induction”. These techniques have been \nused in Chinese character recognition [​4​], analysis of textures [​10​], medical diagnosis (heart disease detection) [​16​],\n visual scene recognition [​22​], movement recognition in video [​19​], activity monitoring in video [​19​], \n and closer to sound (since uni-dimensional time-series), seismic signal analysis (eg. in oil detection) [​8​] \n and ECG analysis [​18​, ​16​].\nAs far as we know, no research has been carried out to apply syntactical pattern recognition techniques \nto general sound recognition, and we intend to take inspiration in this literature in an effort to derive semantics \nfrom sound.\n\n",
      "technique": "Header extraction"
    }
  ],
  "arxivLinks": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://arxiv.org/abs/1609.03499\n\n[12] S. Kim, S. Sundaram, P. Georgiou, and S. Narayanan, “An N -gram model for unstructured audio signals toward \ninformation retrieval,” in Multimedia Signal Processing, 2010 IEEE International Workshop on, 2010. \n\n[13]  Stephanie Pancoast and Murat Akbacak, “Bag-of- Audio-Words Approach for Multimedia Event Classification”.\n\n[14] S. Pancoast and M. Akbacak, “N-gram extension for bag-of-audio-words,” in Proc. of the 38th IEEE International \nConference on Acoustics,Speech and Signal Processing(ICASSP"
    ],
    "technique": "Regular expression"
  },
  "citation": [
    {
      "confidence": [
        1
      ],
      "excerpt": "References \n\n[1] Aucouturier, J.-J., Defreville, B. and Pachet F.: “The bag-of-frames approach to audio pattern recognition: \nA sufficient model for urban soundscapes but not for polyphonic music.” \nIn: Journal of the Acoustical Society of America 122.2, pp 881–891 (2007) \t\n[2] Ehsan Amid, Annamaria Mesaros, Kalle Palomaki, Jorma Laaksonen, Mikko Kurimo, \n“Unsupervised feature extraction for multimedia event detection and ranking using audio content” \n- 2014 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP) - (2014)\n\n[3] V. Carletti, P. Foggia, G. Percannella, A. Saggese, N. Strisciuglio, and M. Vento, \n“Audio surveillance using a bag of aural words classifier,” Proc. of AVSS, pp. 81–86, 2013. \n\n[4] K. S. Fu, “Syntactic Pattern Recognition and Applications.” Prentice Hall, 1982.\n\n[5] R. I. Godoy, “Chunking sound for musical analysis”. CMMR 2008, Springer.\n\n[6] R.M. Gray, “Vector Quantization,”IEEE ASSP Magazine, Vol. 1, 1984 .\n\n[7] T.Heittola, A.Mesaros, A.Eronen, and T.Virtanen, “Context- dependent sound event detection,” \nEURASIP Journal on Audio, Speech, and Music Processing, 2013.\n\n[8] K.Y. Huang, “Syntactic Pattern Recognition for Seismic Oil Exploration”, \nSeries in Machine Percep. Artificial Intelligence, v. 46.\n\n[9] D. Jurafsky, “Speech and language processing”, 2nd edition, Prentice Hall, 2008.\n\n[10] B. Julesz, \"Textons, the elements of texture perceptions, and their interactions\", \nNature, vol 290., pp. 91-97, 1981.\n\n[11] WaveNet: “A Generative Model for Raw Audio”, Aaron van den Oord, Sander Dieleman, Heiga Zen, Karen Simonyan, \nOriol Vinyals, Alex Graves, Nal Kalchbrenner, Andrew Senior, Koray Kavukcuoglu, 2016, https://arxiv.org/abs/1609.03499\n\n[12] S. Kim, S. Sundaram, P. Georgiou, and S. Narayanan, “An N -gram model for unstructured audio signals toward \ninformation retrieval,” in Multimedia Signal Processing, 2010 IEEE International Workshop on, 2010. \n\n[13]  Stephanie Pancoast and Murat Akbacak, “Bag-of- Audio-Words Approach for Multimedia Event Classification”.\n\n[14] S. Pancoast and M. Akbacak, “N-gram extension for bag-of-audio-words,” in Proc. of the 38th IEEE International \nConference on Acoustics,Speech and Signal Processing(ICASSP). Vancouver, Canada: IEEE, 2013, pp. 778–782. \n\n[15]  H.Phan, A.Mertins, “Exploring superframe co-occurrence for acoustic event recognition,” in Proc. EUSIPCO, 2014, \npp. 631– 635. \n\n[16] Meyer-Baese, Schmid., “Pattern Recognition and Signal analysis in Medical Imaging”.\n\n[17] L. Su, C. Yeh, J. Liu, J. Wang, and Y. Yang. “A Systematic Evaluation of the Bag-of-Frames Representation for \nMusic Information Retrieval”, IEEE Transaction on Multimedia, Vol 16, N. 5, 2014.\n\n[18] P. Trahanias, E. Skordalakis, Syntactic Pattern Recognition of the ECG, IEEE transactions on pattern analysis \nand machine intelligence, v. 12, No. 7, 1990.\n\n[19] N.N Vo, A. Bobick, “From stochastic grammar to Bayes network: probabilistic parsing of complex activity”, \nCVPR 2014.\n\n[20] J. T. L Wang, M. Zaki and others, “Data mining in Bioinformatics”, Springer, 2005.\n\n[21] C. Yu, D. H. Ballard, “On the integration of grounding language and learning objects”, AAAI, 2004. \n\n[22] S-C. Zhu, D. Mumford, “A stochastic Grammar of Images”, \nFoundations and trends in Computer Vision and Graphics, 2006\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        0.8459073220557165
      ],
      "excerpt": "source: A streaming signal source \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8044296132830304
      ],
      "excerpt": "Not surprisingly, speech recognition is the sub-domain of sound recognition  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8000818949204008
      ],
      "excerpt": "natural language processing (NLP) to carry out general recognition tasks.  \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/otosense/slang",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2020-02-26T19:17:25Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-11-25T08:07:51Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.8982519008357125
      ],
      "excerpt": "Slang is a structural approach to sound/signal machine learning.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8986338734942269,
        0.8764610218028279
      ],
      "excerpt": "The signal's stream is transformed into a stream of symbols with associated  \nqualifications, quantifications and/or relations that can be used to analyze, interpret, and  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9109263483381254
      ],
      "excerpt": "We humans have developed many systems of symbols to represent or transmit various forms of information.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8956009841971494,
        0.9713900826316859,
        0.906181521716243,
        0.9579185689621441,
        0.85875319612272
      ],
      "excerpt": "- Natural spoken language, from phonemes to morphemes, to words and meta-word structures (simply put, grammar). \n- Written scripts to symbolize either the sounds of the spoken words, or the ideas they mean to symbolize.  \n- Similarly, various musical notation evolved in different times and parts of the world.  \nThese codified what was considered to be the essentials of musical expression, in \nsuch a way that it could be communicated in written form. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8918151969080561
      ],
      "excerpt": "What is more; what the symbols (say words) themselves lack in accuracy,  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9376132933936665,
        0.8631110449299365,
        0.9293654699507831
      ],
      "excerpt": "Slang's objective is to provide that ability for signal.  \nNote we will focus on sound mainly, since sound recognition is the birthplace of Slang,  \nand it makes communicating ideas simpler and possibly more intuitive.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9817366645865334
      ],
      "excerpt": "Imagine a device that could be dropped into a remote inhabited region with no prior knowledge of the local language.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9437414138687035,
        0.9692846691440872,
        0.9095975677439833
      ],
      "excerpt": "how these phonemes co-occur (learning words), and eventually patterns guiding the structure of word sequences (grammar).  \nIt has learned the syntax of the local language, unsupervised.  \nNow show it examples of concrete things people are talking about (this is called \"grounding a language\"),  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9406520060326955,
        0.9315814366500226,
        0.9196357894879839
      ],
      "excerpt": "The common thread through this learning evolutiion is the ability to detect and annotate patterns  \nand relate these patterns to each other from lower to higher levels of abstraction. \nHere are the ingredients of a typical running (as opposed to learning) pipeline. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9629177983320717
      ],
      "excerpt": "chunker: Is fed the signal stream and creates a stream of signal chunks of fixed size. Parametrized by chunk size and other things, particular to the kind of chunker. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8803615573242659
      ],
      "excerpt": "quantizer: Compute a symbol (call it \"snip\" -- think letter, phone or atom) from an fv -- the snip (say an integer) is from a finite set of snips. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9214000611983315
      ],
      "excerpt": "The source stream is fed to the chunker, creating a stream of chks, which are transformed into an stream of statss by doing: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8660446987761178
      ],
      "excerpt": "Over one or several observed windows, update incrementally some aggregates of the streaming stats, and given a condition on every new aggregate, trigger some action. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9904722582765693
      ],
      "excerpt": "that is closest to the syntactic method we propose.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8510016875746427,
        0.9656734082202434,
        0.930578828230095,
        0.8930018484035409
      ],
      "excerpt": "Advanced speech recognition uses natural language processing to improve accuracy in that  \nit exploits language contextual information in order to more accurately map sound to words. \nA language of sound would aspire to link sound to meaning in a similar combinatorial way, but offers a few differences  \n— some simplifying and other complexifying the task.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8125160377383571,
        0.8380425105521984,
        0.8178914783342888,
        0.9302749160117685
      ],
      "excerpt": "However, there is a fortuitous consideration: though natural language’s expressive power is expansive,  \nin sound recognition we need only to describe events relevant to sound. \nEssentially, SLANG represents both acoustic and semantic facets of the sound recognition pipeline as networks of  \ninterconnected elements. An attractive implication is the possibility to apply the extensive research in  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9475380694880275
      ],
      "excerpt": "yet the most significant quantitative characteristics of sound are kept in the properties of the elements,  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8785289588217334
      ],
      "excerpt": "These will be words and phrases that are connected to sound events. These elements could describe, for example, \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8024775935821888,
        0.9805614144727515,
        0.8087664520873933,
        0.9930977773304069
      ],
      "excerpt": "- sound generating activities that may have a very wide temporal range — such as ​storm​ or cooking.​ \nThe ​advantage​ of structured learning ​lies in its exploitation of the structure of the output space.  \nClip-clop, clippety-clop, clop, clopping, clunking​ and ​clumping​ can be considered to be synonyms of each other  \nin the context of sound. A ​clop​ (and its twins) is closer to ​knock​ and ​plunk than it is to ​hiss​ and ​buzz.​  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8958122511217962,
        0.9931168587079134
      ],
      "excerpt": "Semantic structure allows models to avoid problems of synonymy and polysemy,  \nbut also allow the emergence of a fuller picture of the sound’s contents  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8945929655200344,
        0.9036311287323547
      ],
      "excerpt": "Once connected to sound however, these relationships should be enhanced according to the acoustic similarities of  \nthe sounds the semantic constructs are related to.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8333051761301368,
        0.8080378093846635
      ],
      "excerpt": "so the semantic structure should be able to be edited and augmented for the application’s needs. \nOn the acoustic side of SLANG, a similar structured approach should be taken, identifying, symbolizing,  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9218142906639498
      ],
      "excerpt": "This process is based on the following steps: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9050535753723632,
        0.9403766370139639,
        0.8206838619156341
      ],
      "excerpt": "vectors of these frames. We will call these frame features. \n- Quantize the frame features, creating a codebook of frame features \n- Enhance the codebook with frame similarity information \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9116966904255944
      ],
      "excerpt": "- Carry out classification and structured learning techniques to link these patterns to semantic identifiers and structures \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8795436360157987,
        0.9092302685636118,
        0.9540795890744103,
        0.8658293719466323
      ],
      "excerpt": "An audio stream is chunked into short (and possibly overlapping) frames over which we compute suitable feature vectors.  \nThese features (e.g. spectrogram, chromagram, mel-spectrum, MFCC slices [17]) encode “instantaneous”  \ncharacteristics of sound — such as intensity and spectral features — but do not encompass wide-range characteristics  \nsuch as autocorrelation and intensity monotonicity.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9564851324269822,
        0.9401789247869665,
        0.8909210928491419,
        0.9462313892617842,
        0.8027696781664844,
        0.8432146886767968,
        0.8755753976586294
      ],
      "excerpt": "The frame features are then quantized to a discrete set of symbols [6].  \nVector quantization will map the frame features to a finite number of symbols that will represent all frame features  \nwithin a bounded region. These symbols, which we will call “snips” (short for “sound nips”) will play the role of our  \nsound language alphabet. We record statistical information about the feature space covered by each snip in order to  \nqualify and quantify feature-based relationships. \nQuantization maps multi-dimensional numerical features to unidimensional nominal ones, thereby seemingly losing all  \nsimilarity relationships that the numerical features contain.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.948509613649031
      ],
      "excerpt": "we associated with each snip, but it would be computationally intensive to have to generate these using  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8005921894064318
      ],
      "excerpt": "Instead, we will use the statistical relationships recorded about the feature space covered by the snips to build a  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8919858066229717,
        0.8864547858629178
      ],
      "excerpt": "In this network we can store information about snips themselves (the nodes) as well as pairs of snips (the links).  \nThis serves to keep and be able to readily key into, useful information about the snips and their relationships. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9100028564004946,
        0.9846117807979773
      ],
      "excerpt": "we will store statistics (such as mean and standard deviation) of the intensity of the feature subspace or train data  \nframes associated to the each snip. Further, we label the pairs of snips (links of the network) with information about  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9294404269286173,
        0.9063142648734596
      ],
      "excerpt": "One notable property to retain is the “snip confusion” metric,  \nwhich is the probability that a snip could have been another,  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.951904880424885
      ],
      "excerpt": "Further, enhancing the snip codebook with such information that links back to the original raw data,  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9619498082958989,
        0.877786900278863
      ],
      "excerpt": "In our framework, annotations replace both chunk features and semantic labels. An annotation specifies a segment of  \nsound and a property associated to it. Since we now represent sound by a sequence of snips, the segment can be specified  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9792094109728868
      ],
      "excerpt": "indexing, storage and retrieval needs. The property of an annotation can be any data that provides information about  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8885401276454857,
        0.8972884321768451
      ],
      "excerpt": "Annotations serve a purpose on both sides of the machine learning process:  \n- Marking sound segments with acoustical information that may allow models to link sound to meaning.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9552708004599804
      ],
      "excerpt": "part of the sound we are labeling and (b) we are not limited by single labels, but can express any multi-faceted and  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9894453649934501,
        0.902764747906866
      ],
      "excerpt": "or positive inference. The discovery of frequent patterns in sequential data is crucial in Bioinformatics [20].  \nThis can be compared to the use of n-grams and skip-grams in text processing.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9862187948731813
      ],
      "excerpt": "pattern mining processes with more “synonymous sets of words” to work with. Snip networks will serve to expand or  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9549484300259524
      ],
      "excerpt": "where words of a query are reduced (e.g. stemming [9] and stopword removal) or expanded  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9266987179546381,
        0.8660570313251207
      ],
      "excerpt": "- Pattern-homogeneous sub-sequences: The distribution of snips of a segment could be considered to belong to a  \nsame “topic” or latent semantic state. See for example the “bag of frames” techniques ([13], [15]),  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8986916093741474,
        0.9774084876753936,
        0.9798708680260214
      ],
      "excerpt": "- Aggregate features: Since snips use only short-range features, we seem to have lost the ability to use acoustic  \nfeatures that assume significance only over some period of time, but these can be approximated from the snip codebook  \nlink to the original frame features statistics and only those with highest significance and utility need to be recorded  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9433644180725925,
        0.8234443913625445,
        0.9925111052886643
      ],
      "excerpt": "- Semantic annotations: On the other end of the sound-to-semantics spectrum we can annotate low level semantic  \nidentifiers (such as cling, chop and splash) , wide-range segments with words describing a sound-generating  \nactivity (such as cooking), and context, which is crucial to the proper interpretation of sound events.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.888209310386918
      ],
      "excerpt": "This is not only useful as a sound search engine, but gives us all we need to extract acoustic and semantic constructs  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9234749725024305
      ],
      "excerpt": "Annotated segments provide relationships between acoustical facets of sound semantics through the co-occurrence of  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8766439507126449,
        0.9325665500815168,
        0.8158693138301099
      ],
      "excerpt": "Along with the aforementioned semantic and snips structures, this set of co-occurring properties can be used to  \ngenerate a (stochastic formal) grammar over the alphabet of snips and annotations.  \nThis grammar provides statistical rules that can be used to derive snips to targeted semantic annotations,  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9320371558554081
      ],
      "excerpt": "of the annotated segment. Similarly, a different semantic annotation might be more or less stable according to how  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.831383203060746,
        0.9080880833407243,
        0.8538402113423021
      ],
      "excerpt": "The annotation queryable system we propose can at the very least provide a modeler with the means to effectively extract  \nwell tuned training and testing data, as well as provide hints as to what acoustical facets are most correlated to the  \ntargeted semantic categories, from which any type of model can be applied. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8675149998224458,
        0.9394444720103378
      ],
      "excerpt": "that should be combined in such a manner as to derive the targeted semantical symbols.  \nIn practice, it is often useful to have a “light” model that efficiently detects only specific categories.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8327739895452372,
        0.9264271052474012
      ],
      "excerpt": "Indeed, automatons are a suitable choice considering we are given a sequence of symbols,  \nmust follow several combinatorial pathways, updated for every new incoming symbol, and when a “terminal” symbol is  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "A light weight version of Slang: Tools to build a language of sound.",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/thorwhalen/slang/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 2,
      "date": "Mon, 27 Dec 2021 05:00:05 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/otosense/slang/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "otosense/slang",
    "technique": "GitHub API"
  },
  "hasDocumentation": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://github.com/thorwhalen/slang/tree/master/docs"
    ],
    "technique": "File Exploration"
  },
  "installation": [
    {
      "confidence": [
        0.8201414380403408
      ],
      "excerpt": "source: A streaming signal source \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8982976774989356
      ],
      "excerpt": "aggregator: Over one or several observed windows, update incrementally some aggregates of the streaming stats. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8044963390326515
      ],
      "excerpt": "These steps will be detailed in the following sections. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8826002851819931
      ],
      "excerpt": "One notable property to retain is the “snip confusion” metric,  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8529226753850685
      ],
      "excerpt": "opens the possibility to merge codebooks or translate (at least approximately) one snipping system to another. \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/otosense/slang/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Python",
      "Makefile",
      "Batchfile"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "name": "Apache License 2.0",
      "url": "https://api.github.com/licenses/apache-2.0"
    },
    "technique": "GitHub API"
  },
  "licenseText": {
    "confidence": [
      1.0
    ],
    "excerpt": "b'                                 Apache License\\n                           Version 2.0, January 2004\\n                        http://www.apache.org/licenses/\\n\\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\\n\\n   1. Definitions.\\n\\n      \"License\" shall mean the terms and conditions for use, reproduction,\\n      and distribution as defined by Sections 1 through 9 of this document.\\n\\n      \"Licensor\" shall mean the copyright owner or entity authorized by\\n      the copyright owner that is granting the License.\\n\\n      \"Legal Entity\" shall mean the union of the acting entity and all\\n      other entities that control, are controlled by, or are under common\\n      control with that entity. For the purposes of this definition,\\n      \"control\" means (i) the power, direct or indirect, to cause the\\n      direction or management of such entity, whether by contract or\\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\\n      outstanding shares, or (iii) beneficial ownership of such entity.\\n\\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\\n      exercising permissions granted by this License.\\n\\n      \"Source\" form shall mean the preferred form for making modifications,\\n      including but not limited to software source code, documentation\\n      source, and configuration files.\\n\\n      \"Object\" form shall mean any form resulting from mechanical\\n      transformation or translation of a Source form, including but\\n      not limited to compiled object code, generated documentation,\\n      and conversions to other media types.\\n\\n      \"Work\" shall mean the work of authorship, whether in Source or\\n      Object form, made available under the License, as indicated by a\\n      copyright notice that is included in or attached to the work\\n      (an example is provided in the Appendix below).\\n\\n      \"Derivative Works\" shall mean any work, whether in Source or Object\\n      form, that is based on (or derived from) the Work and for which the\\n      editorial revisions, annotations, elaborations, or other modifications\\n      represent, as a whole, an original work of authorship. For the purposes\\n      of this License, Derivative Works shall not include works that remain\\n      separable from, or merely link (or bind by name) to the interfaces of,\\n      the Work and Derivative Works thereof.\\n\\n      \"Contribution\" shall mean any work of authorship, including\\n      the original version of the Work and any modifications or additions\\n      to that Work or Derivative Works thereof, that is intentionally\\n      submitted to Licensor for inclusion in the Work by the copyright owner\\n      or by an individual or Legal Entity authorized to submit on behalf of\\n      the copyright owner. For the purposes of this definition, \"submitted\"\\n      means any form of electronic, verbal, or written communication sent\\n      to the Licensor or its representatives, including but not limited to\\n      communication on electronic mailing lists, source code control systems,\\n      and issue tracking systems that are managed by, or on behalf of, the\\n      Licensor for the purpose of discussing and improving the Work, but\\n      excluding communication that is conspicuously marked or otherwise\\n      designated in writing by the copyright owner as \"Not a Contribution.\"\\n\\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\\n      on behalf of whom a Contribution has been received by Licensor and\\n      subsequently incorporated within the Work.\\n\\n   2. Grant of Copyright License. Subject to the terms and conditions of\\n      this License, each Contributor hereby grants to You a perpetual,\\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\\n      copyright license to reproduce, prepare Derivative Works of,\\n      publicly display, publicly perform, sublicense, and distribute the\\n      Work and such Derivative Works in Source or Object form.\\n\\n   3. Grant of Patent License. Subject to the terms and conditions of\\n      this License, each Contributor hereby grants to You a perpetual,\\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\\n      (except as stated in this section) patent license to make, have made,\\n      use, offer to sell, sell, import, and otherwise transfer the Work,\\n      where such license applies only to those patent claims licensable\\n      by such Contributor that are necessarily infringed by their\\n      Contribution(s) alone or by combination of their Contribution(s)\\n      with the Work to which such Contribution(s) was submitted. If You\\n      institute patent litigation against any entity (including a\\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\\n      or a Contribution incorporated within the Work constitutes direct\\n      or contributory patent infringement, then any patent licenses\\n      granted to You under this License for that Work shall terminate\\n      as of the date such litigation is filed.\\n\\n   4. Redistribution. You may reproduce and distribute copies of the\\n      Work or Derivative Works thereof in any medium, with or without\\n      modifications, and in Source or Object form, provided that You\\n      meet the following conditions:\\n\\n      (a) You must give any other recipients of the Work or\\n          Derivative Works a copy of this License; and\\n\\n      (b) You must cause any modified files to carry prominent notices\\n          stating that You changed the files; and\\n\\n      (c) You must retain, in the Source form of any Derivative Works\\n          that You distribute, all copyright, patent, trademark, and\\n          attribution notices from the Source form of the Work,\\n          excluding those notices that do not pertain to any part of\\n          the Derivative Works; and\\n\\n      (d) If the Work includes a \"NOTICE\" text file as part of its\\n          distribution, then any Derivative Works that You distribute must\\n          include a readable copy of the attribution notices contained\\n          within such NOTICE file, excluding those notices that do not\\n          pertain to any part of the Derivative Works, in at least one\\n          of the following places: within a NOTICE text file distributed\\n          as part of the Derivative Works; within the Source form or\\n          documentation, if provided along with the Derivative Works; or,\\n          within a display generated by the Derivative Works, if and\\n          wherever such third-party notices normally appear. The contents\\n          of the NOTICE file are for informational purposes only and\\n          do not modify the License. You may add Your own attribution\\n          notices within Derivative Works that You distribute, alongside\\n          or as an addendum to the NOTICE text from the Work, provided\\n          that such additional attribution notices cannot be construed\\n          as modifying the License.\\n\\n      You may add Your own copyright statement to Your modifications and\\n      may provide additional or different license terms and conditions\\n      for use, reproduction, or distribution of Your modifications, or\\n      for any such Derivative Works as a whole, provided Your use,\\n      reproduction, and distribution of the Work otherwise complies with\\n      the conditions stated in this License.\\n\\n   5. Submission of Contributions. Unless You explicitly state otherwise,\\n      any Contribution intentionally submitted for inclusion in the Work\\n      by You to the Licensor shall be under the terms and conditions of\\n      this License, without any additional terms or conditions.\\n      Notwithstanding the above, nothing herein shall supersede or modify\\n      the terms of any separate license agreement you may have executed\\n      with Licensor regarding such Contributions.\\n\\n   6. Trademarks. This License does not grant permission to use the trade\\n      names, trademarks, service marks, or product names of the Licensor,\\n      except as required for reasonable and customary use in describing the\\n      origin of the Work and reproducing the content of the NOTICE file.\\n\\n   7. Disclaimer of Warranty. Unless required by applicable law or\\n      agreed to in writing, Licensor provides the Work (and each\\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\\n      implied, including, without limitation, any warranties or conditions\\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\\n      PARTICULAR PURPOSE. You are solely responsible for determining the\\n      appropriateness of using or redistributing the Work and assume any\\n      risks associated with Your exercise of permissions under this License.\\n\\n   8. Limitation of Liability. In no event and under no legal theory,\\n      whether in tort (including negligence), contract, or otherwise,\\n      unless required by applicable law (such as deliberate and grossly\\n      negligent acts) or agreed to in writing, shall any Contributor be\\n      liable to You for damages, including any direct, indirect, special,\\n      incidental, or consequential damages of any character arising as a\\n      result of this License or out of the use or inability to use the\\n      Work (including but not limited to damages for loss of goodwill,\\n      work stoppage, computer failure or malfunction, or any and all\\n      other commercial damages or losses), even if such Contributor\\n      has been advised of the possibility of such damages.\\n\\n   9. Accepting Warranty or Additional Liability. While redistributing\\n      the Work or Derivative Works thereof, You may choose to offer,\\n      and charge a fee for, acceptance of support, warranty, indemnity,\\n      or other liability obligations and/or rights consistent with this\\n      License. However, in accepting such obligations, You may act only\\n      on Your own behalf and on Your sole responsibility, not on behalf\\n      of any other Contributor, and only if You agree to indemnify,\\n      defend, and hold each Contributor harmless for any liability\\n      incurred by, or claims asserted against, such Contributor by reason\\n      of your accepting any such warranty or additional liability.\\n\\n   END OF TERMS AND CONDITIONS\\n\\n   APPENDIX: How to apply the Apache License to your work.\\n\\n      To apply the Apache License to your work, attach the following\\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\\n      replaced with your own identifying information. (Don\\'t include\\n      the brackets!)  The text should be enclosed in the appropriate\\n      comment syntax for the file format. We also recommend that a\\n      file or class name and description of purpose be included on the\\n      same \"printed page\" as the copyright notice for easier\\n      identification within third-party archives.\\n\\n   Copyright [yyyy] [name of copyright owner]\\n\\n   Licensed under the Apache License, Version 2.0 (the \"License\");\\n   you may not use this file except in compliance with the License.\\n   You may obtain a copy of the License at\\n\\n       http://www.apache.org/licenses/LICENSE-2.0\\n\\n   Unless required by applicable law or agreed to in writing, software\\n   distributed under the License is distributed on an \"AS IS\" BASIS,\\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\\n   See the License for the specific language governing permissions and\\n   limitations under the License.\\n'",
    "technique": "File Exploration"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "slang--light-weight-tools-to-build-signal-languages)",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "slang",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "otosense",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "Organization",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/otosense/slang/blob/master/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 4,
      "date": "Mon, 27 Dec 2021 05:00:05 GMT"
    },
    "technique": "GitHub API"
  }
}