{
  "citation": [
    {
      "confidence": [
        1
      ],
      "excerpt": "Radiologist want patients to have results faster:\nhttps://www.reuters.com/article/us-radiology-results-timeliness/radiologists-want-patients-to-get-test-results-faster-idUSKBN1DH2R6\n\nTransfer learning with chest X-rays:\nhttps://www.nature.com/articles/s41598-020-78060-4\n\nCheXnet: 121-layer Convolutional neural network for identifying pneumonia:\nhttps://arxiv.org/pdf/1711.05225.pdf\n\nLocalization using bounding box: \nhttps://ml4health.github.io/2019/pdf/73_ml4h_preprint.pdf\n\n\n\n\n\n\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        0.8656070203791273
      ],
      "excerpt": "<img src = \"https://github.com/trangiabach/Lung-Iris/blob/main/viral-pneumonai%20(1).jpg?raw=true\"> \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/trangiabach/Lung-Iris",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-05-29T20:00:01Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-08-28T18:01:36Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        1
      ],
      "excerpt": "Lung Iris is a web application that can automatically detect pneumonia patients from their chest X-ray images. With more than 2 billions procedures for pneumonia diagnosis performed manually by radiologists worldwide, Lung Iris serves as the optimal solution for saving time and cost for the healthcare system. In addition, in view of the COVID-19 pandemic, Lung Iris can help identify critical COVID-19 patients who have developed pneumonia in their lungs, making the diagnosis time much faster for them so that they can receive prompt care. This is particularly effective in situations where the healcare system is overloaded and there is a lack of personnel.\n\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        0.831587547249181
      ],
      "excerpt": "Blue: region of lower interest in classifying pneumonia \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9790144647346418,
        0.9960289529251806,
        0.9123852387201815,
        0.9341729624255084,
        0.9817728677831095,
        0.9924466954043881,
        0.9584531676312713,
        0.9933841597459583
      ],
      "excerpt": "This is an image of a pneumonia lungs with expert annotations (arrows) of the pneumonia regions. As can be seen, the AI have detected correctly the region of interest (red regions) that have been annotated by the expert. \nDiagnosis from medical imaging is very common and it is estimated that there are around 2 billion procedures performed worldwide. The case is even more evident when in Vietname, most of X-ray scans are for the lungs and heart. Therefore, automating this process will be of great significance. \nCOVID-19 is still continuing to spread around the world at alarming rates. What will happen if the healthcare system is overloaded? How will we be able to take off burden from already extremely tired medical staff? And especially, how can we help critical patients in whose situation time is extremely valuable? \nA survey by the University of Michigan shows that patients have an average wait time for chest X-ray results from 2-3 days. This number can also be as high as 11 days. However, with AI technology applied, this wait time can be reduced to less than one day. \nThe web application can detect whether a chest X-ray scan image is pneumonia-positive or normal. It also give percentages of the two labels and highlight regions of interest. \nThe dataset is synthesized from 3 Kaggle datasets comprising of pneumonia and normal chest X-ray images, consisting of more than 18000 training data points, 5000 validation data points and 614 testing data points. Types of pneumonia include viral, bacterial and COVID-19 pneumonia. The dataset was then preprocessed and augmented with random flips, zooms, sheers and rotations. An additional thresholding algorithm from OpenCV was also applied to hightlight important features in the chest X-rays. \nThe model is a convolutional neural network comprising of four convolutinal layers each with max-pooling and two fully-connected layers. An activation map was extracted from the last convolutional layer, allowing for the network to have great localization ability. The model achieved 96% accuracy on training and validation set and 91% accuracy on testing set. \nThe model is configured with a Flask backend, in which an API is installed to make predictions and draw out the activation map. The front-end is comprised of HTML, CSS and jQuery. The app is then deployed and hosted on Heroku server. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9942461129896824,
        0.9834586020671163,
        0.9943617379495756,
        0.9855349394766268
      ],
      "excerpt": "One of the biggest challenge was how to create a small model that can attain great accuracy. Transfer learning can be a great way to attain accuracy fast but due to the relative large size of the model (often more than ten million parameters and >200MB in size), it is very difficult to deploy on small servers. The most optimal model was achieved only after a great deal of time fine-tuning hyper parameters and datasets preprocessing. \nThe resulting model attained good accuracy and only have around two million paramter and <30MB in size, making it less prone to overfitting, scalable and fast to deploy on servers. The model also has great localization abilities (highlight regions of interest) through the use of activation maps extracted from the convolutional layers. \nA great deal was learnt about how to optimize model for best performance and how to configure AI in a production environment. This project can not be realized without the help of friends who acted as advisors and researchers, engineers who have kindly shared their knowledge to the world. \nCollaborate with researchers and radiologist to collect better data. \n",
      "technique": "Supervised classification"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/trangiabach/Lung-Iris/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 0,
      "date": "Wed, 29 Dec 2021 17:52:25 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/trangiabach/Lung-Iris/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "trangiabach/Lung-Iris",
    "technique": "GitHub API"
  },
  "invocation": [
    {
      "confidence": [
        0.8471602437658085
      ],
      "excerpt": "<img src = \"https://github.com/trangiabach/Lung-Iris/blob/main/viral-pneumonai%20(1).jpg?raw=true\"> \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/trangiabach/Lung-Iris/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "HTML",
      "Python"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Lung-Iris",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "Lung-Iris",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "trangiabach",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/trangiabach/Lung-Iris/blob/main/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 1,
      "date": "Wed, 29 Dec 2021 17:52:25 GMT"
    },
    "technique": "GitHub API"
  },
  "usage": [
    {
      "confidence": [
        1
      ],
      "excerpt": "Link: https://lung-iris.herokuapp.com/\n\nNote: Due to the spontaneous nature of Heroku web hosting, there could be delays and slow load time. Please reload if necessary.\n\n",
      "technique": "Header extraction"
    }
  ]
}