{
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/drobilla/serd",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2016-08-27T13:22:40Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-11-26T10:21:04Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9842969027332356,
        0.9405518461202913,
        0.8800542841723162
      ],
      "excerpt": "Serd is a lightweight C library for RDF syntax which supports reading and \nwriting [Turtle][], [TriG][], [NTriples][], and [NQuads][].  Serd is suitable \nfor performance-critical or resource-limited applications, such as serialising \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8887710075339879
      ],
      "excerpt": "Free: Serd is [Free Software][] released under the extremely liberal \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.956171898381005
      ],
      "excerpt": "   than the C standard library.  It is known to compile with GCC, Clang, and \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9411793253613324,
        0.9332920328320308
      ],
      "excerpt": "Small: Serd is implemented in a few thousand lines of C.  It typically \n   compiles to about 100 KiB, or about 50 KiB stripped with size optimizations. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8609704188165355,
        0.8696961302362776
      ],
      "excerpt": "   useful for writing very large data sets, since it can do so using only a \n   small amount of memory.  Serd is, to the author's knowledge, the fastest \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8370931723764733
      ],
      "excerpt": "Conformant and Well-Tested: Serd passes all tests in the Turtle and TriG \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8215968482687066
      ],
      "excerpt": "   specification, and includes many additional tests which were written \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "A lightweight C library for RDF syntax",
      "technique": "GitHub API"
    }
  ],
  "documentation": [
    {
      "confidence": [
        1
      ],
      "excerpt": " * [API reference (single page)](https://drobilla.gitlab.io/serd/c/singlehtml)\n * [API reference (paginated)](https://drobilla.gitlab.io/serd/c/html)\n * [`serdi` man page](https://drobilla.gitlab.io/serd/man/serdi.html)\n\n -- David Robillard <d@drobilla.net>\n\n[Turtle]: https://www.w3.org/TR/turtle/\n[TriG]: https://www.w3.org/TR/trig/\n[NTriples]: https://www.w3.org/TR/n-triples/\n[NQuads]: https://www.w3.org/TR/n-quads/\n[Free Software]: http://www.gnu.org/philosophy/free-sw.html\n[ISC license]: http://opensource.org/licenses/isc\n[rapper]: http://librdf.org/raptor/\n[riot]: https://jena.apache.org/\n[sp2b]: http://www2.informatik.uni-freiburg.de/~mschmidt/docs/sp2b.pdf\n",
      "technique": "Header extraction"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/drobilla/serd/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 11,
      "date": "Mon, 20 Dec 2021 16:36:00 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/drobilla/serd/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "drobilla/serd",
    "technique": "GitHub API"
  },
  "installation": [
    {
      "confidence": [
        0.8596032097405178
      ],
      "excerpt": "   MSVC (as C++), and is tested on GNU/Linux, MacOS, and Windows. \n",
      "technique": "Supervised classification"
    }
  ],
  "invocation": [
    {
      "confidence": [
        0.8622922765736735
      ],
      "excerpt": "   test suites, correctly handles all \"normal\" examples in the URI \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8352868877745334
      ],
      "excerpt": "   manually or discovered with fuzz testing.  The test suite is run \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/drobilla/serd/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "C",
      "Python"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "name": "ISC License",
      "url": "https://api.github.com/licenses/isc"
    },
    "technique": "GitHub API"
  },
  "licenseText": {
    "confidence": [
      1.0
    ],
    "excerpt": "b'Summary\\n=======\\n\\nDistributed under both the W3C Test Suite License[1] and the W3C 3-clause BSD License[2]. To contribute to a W3C Test Suite, see the policies and contribution forms [3]\\n\\n1. http://www.w3.org/Consortium/Legal/2008/04-testsuite-license\\n2. http://www.w3.org/Consortium/Legal/2008/03-bsd-license\\n3. http://www.w3.org/2004/10/27-testcases\\n\\nDISCLAIMER\\n\\nUNDER BOTH MUTUALLY EXCLUSIVE LICENSES, THIS DOCUMENT AND ALL DOCUMENTS, TESTS AND SOFTWARE THAT LINK THIS STATEMENT ARE PROVIDED \"AS IS,\" AND COPYRIGHT HOLDERS MAKE NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, OR TITLE; THAT THE CONTENTS OF THE DOCUMENT ARE SUITABLE FOR ANY PURPOSE; NOR THAT THE IMPLEMENTATION OF SUCH CONTENTS WILL NOT INFRINGE ANY THIRD PARTY PATENTS, COPYRIGHTS, TRADEMARKS OR OTHER RIGHTS.\\nCOPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THE DOCUMENT OR THE PERFORMANCE OR IMPLEMENTATION OF THE CONTENTS THEREOF.\\n\\n\\nW3C Test Suite License\\n======================\\n\\nThis document, Test Suites and other documents that link to this statement are provided by the copyright holders under the following license: By using and/or copying this document, or the W3C document from which this statement is linked, you (the licensee) agree that you have read, understood, and will comply with the following terms and conditions:\\n\\nPermission to copy, and distribute the contents of this document, or the W3C document from which this statement is linked, in any medium for any purpose and without fee or royalty is hereby granted, provided that you include the following on ALL copies of the document, or portions thereof, that you use:\\n\\nA link or URL to the original W3C document.\\nThe pre-existing copyright notice of the original author, or if it doesn\\'t exist, a notice (hypertext is preferred, but a textual representation is permitted) of the form: \"Copyright \\xc2\\xa9 [$date-of-document] World Wide Web Consortium, (Massachusetts Institute of Technology, European Research Consortium for Informatics and Mathematics, Keio University) and others. All Rights Reserved. http://www.w3.org/Consortium/Legal/2008/04-testsuite-copyright.html\"\\nIf it exists, the STATUS of the W3C document.\\nWhen space permits, inclusion of the full text of this NOTICE should be provided. We request that authorship attribution be provided in any software, documents, or other items or products that you create pursuant to the implementation of the contents of this document, or any portion thereof.\\n\\nNo right to create modifications or derivatives of W3C documents is granted pursuant to this license. However, if additional requirements (documented in the Copyright FAQ) are satisfied, the right to create modifications or derivatives is sometimes granted by the W3C to individuals complying with those requirements.\\n\\nIf a Test Suite distinguishes the test harness (or, framework for navigation) and the actual tests, permission is given to remove or alter the harness or navigation if the Test Suite in question allows to do so. The tests themselves shall NOT be changed in any way.\\n\\nThe name and trademarks of W3C and other copyright holders may NOT be used in advertising or publicity pertaining to this document or other documents that link to this statement without specific, written prior permission. Title to copyright in this document will at all times remain with copyright holders. Permission is given to use the trademarked string W3C within claims of performance concerning W3C Specifications or features described therein, and there only, if the test suite so authorizes.\\n\\nTHIS WORK IS PROVIDED BY W3C, MIT, ERCIM, KEIO UNIVERSITY, THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL W3C, MIT, ERCIM, KEIO UNIVERSITY, THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\\n\\n\\nW3C 3-clause BSD License\\n========================\\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\\n\\n\\tRedistributions of works must retain the original copyright notice, this list of conditions and the following disclaimer.\\n\\n\\tRedistributions in binary form must reproduce the original copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\\n\\n\\tNeither the name of the W3C nor the names of its contributors may be used to endorse or promote products derived from this work without specific prior written permission.\\n\\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\\n\\n'",
    "technique": "File Exploration"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Serd",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "serd",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "drobilla",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/drobilla/serd/blob/master/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 49,
      "date": "Mon, 20 Dec 2021 16:36:00 GMT"
    },
    "technique": "GitHub API"
  },
  "topics": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "rdf",
      "turtle",
      "ntriples",
      "nquads",
      "semantic-web",
      "parser",
      "serializer"
    ],
    "technique": "GitHub API"
  }
}