{
  "arxivLinks": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://arxiv.org/abs/0911.2899"
    ],
    "technique": "Regular expression"
  },
  "citation": [
    {
      "confidence": [
        0.8130883436525747
      ],
      "excerpt": "A curated list of open-source Prolog frameworks, libraries and resources. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9507374082549614
      ],
      "excerpt": "Artificial Intelligence \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9195926162616405
      ],
      "excerpt": "Machine Learning \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.880436689248845
      ],
      "excerpt": "VSC-Prolog - Prolog extension for Visual Studio Code. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8099084746018815
      ],
      "excerpt": "cplint_datasets - Dataset for machine learning. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8714162992508173
      ],
      "excerpt": "turing - Turing Machine simulator. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9379669528132836
      ],
      "excerpt": "Prolog for Software Engineering - Software engineering fundamentals using Prolog. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9979588569470099
      ],
      "excerpt": "Artificial Intelligence through Prolog - In-depth coverage of key concepts on artificial intelligence. \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/klaussinani/awesome-prolog",
    "technique": "GitHub API"
  },
  "contributingGuidelines": {
    "confidence": [
      1.0
    ],
    "excerpt": "Contribution Guidelines\nPlease note that this project is released with a Contributor Code of Conduct. By participating in this project you agree to abide by its terms.\nEnsure your pull request adheres to the following guidelines:\n\nSearch previous suggestions before making a new one, as yours may be a duplicate\nSuggested packages should be tested and documented\nMake an individual pull request for each suggestion\nUse the following format: [package](link) - Description.\nAdditions should be added to the bottom of the relevant category\nKeep descriptions short and simple, but descriptive\nStart the description with a capital and end with a full stop/period\nDon't start the description with A or An\nCheck your spelling and grammar\nMake sure your text editor is set to remove trailing whitespace\nThe pull request should have a useful title and include a link to the package\nNew categories or improvements to the existing categorization are welcome, but should be done in a separate pull request\n\nThank you for your suggestion!\nSubmitting a Pull Request\n\nNon-trivial changes are often best discussed in an issue first, to prevent you from doing unnecessary work\nUse a descriptive title for the pull request and commits\nYou might be asked to do changes to your pull request, you can do that by just updating the existing one\n\n\nContributing.md based on the one of https://github.com/sindresorhus/awesome-nodejs",
    "technique": "File Exploration"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2017-11-05T21:47:41Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-12-17T07:03:10Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.8156550032350735
      ],
      "excerpt": "TerminuDB - for knowledge graph representation \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8088486002084182
      ],
      "excerpt": "prolog.js - Interpreter in JavaScript. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.841647261619511
      ],
      "excerpt": "scryer prolog - ISO-compatible interpreter in Rust. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.908925214220865
      ],
      "excerpt": "atom_feed - Atom and RSS feeds parser. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9394449182630016,
        0.9430137786144771
      ],
      "excerpt": "  for Sublime Text. \nrepl.vim - VIM REPL with support for SWIProlog. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8135667853692389
      ],
      "excerpt": "Learn Prolog Now! - Thorough introductory course to programming in Prolog. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9697768289813913
      ],
      "excerpt": "The Power of Prolog - Introduction to modern Prolog. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9051104452526891
      ],
      "excerpt": "Prolog for Software Engineering - Software engineering fundamentals using Prolog. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8986309051242487,
        0.8146782073192674
      ],
      "excerpt": "Web Applications in SWI-Prolog - Building web application with SWI-Prolog. \nConstraint Logic Programming over Finite Domains - Fundamentals of Constraint Systems on Finite Domains. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9590440360520799
      ],
      "excerpt": "Introduction to Prolog - Hour-long introduction to Prolog. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.895559192996437,
        0.8372402522887612,
        0.935824168143048,
        0.807192064442006,
        0.9163482537417915
      ],
      "excerpt": "Prolog in Artificial Intelligence - Tutorials Point's series on Prolog with lectures relating Prolog to AI. \nAdventure in Prolog - Pragmatic approach to Prolog. \nProlog Programming in Depth - Full coverage of the Prolog programming language. \nLogic, Programming and Prolog - Foundations of Logic programming and programming techniques in Prolog. \nNatural Language Processing for Prolog Programmers - Turning theories into practical techniques. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8310986725170307,
        0.904137499216981,
        0.8666950926727194
      ],
      "excerpt": "Coding Guidelines for Prolog - Coding standards and good practices for Prolog. \nThe Art of Prolog - Advanced programming techniques for Prolog. \nProlog FAQ - Frequently Asked Questions list of the SWI-Prolog newsgroup. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8304039106129992,
        0.9392723264403483
      ],
      "excerpt": "SWI-Prolog Freenode - IRC channel of the SWI-Prolog community. \nSWI-Prolog Google Group - SWI-Prolog user \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "Curated list of Prolog packages and resources",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/klaussinani/awesome-prolog/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 34,
      "date": "Mon, 20 Dec 2021 21:37:24 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/klaussinani/awesome-prolog/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "klaussinani/awesome-prolog",
    "technique": "GitHub API"
  },
  "installation": [
    {
      "confidence": [
        0.8609411029776485
      ],
      "excerpt": "Build Systems \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8374346525521538
      ],
      "excerpt": "Prolog Modules - Fundamentals in SWI-Prolog Modules. \n",
      "technique": "Supervised classification"
    }
  ],
  "invocation": [
    {
      "confidence": [
        0.8359299706379749
      ],
      "excerpt": "tokenize - Straightforward text tokenizing. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9272201186841638
      ],
      "excerpt": "PlUnit - Prolog unit tests. \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/klaussinani/awesome-prolog/issues{/number}",
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "name": "Creative Commons Zero v1.0 Universal",
      "url": "https://api.github.com/licenses/cc0-1.0"
    },
    "technique": "GitHub API"
  },
  "licenseText": {
    "confidence": [
      1.0
    ],
    "excerpt": "b'CC0 1.0 Universal\\n\\nStatement of Purpose\\n\\nThe laws of most jurisdictions throughout the world automatically confer\\nexclusive Copyright and Related Rights (defined below) upon the creator and\\nsubsequent owner(s) (each and all, an \"owner\") of an original work of\\nauthorship and/or a database (each, a \"Work\").\\n\\nCertain owners wish to permanently relinquish those rights to a Work for the\\npurpose of contributing to a commons of creative, cultural and scientific\\nworks (\"Commons\") that the public can reliably and without fear of later\\nclaims of infringement build upon, modify, incorporate in other works, reuse\\nand redistribute as freely as possible in any form whatsoever and for any\\npurposes, including without limitation commercial purposes. These owners may\\ncontribute to the Commons to promote the ideal of a free culture and the\\nfurther production of creative, cultural and scientific works, or to gain\\nreputation or greater distribution for their Work in part through the use and\\nefforts of others.\\n\\nFor these and/or other purposes and motivations, and without any expectation\\nof additional consideration or compensation, the person associating CC0 with a\\nWork (the \"Affirmer\"), to the extent that he or she is an owner of Copyright\\nand Related Rights in the Work, voluntarily elects to apply CC0 to the Work\\nand publicly distribute the Work under its terms, with knowledge of his or her\\nCopyright and Related Rights in the Work and the meaning and intended legal\\neffect of CC0 on those rights.\\n\\n1. Copyright and Related Rights. A Work made available under CC0 may be\\nprotected by copyright and related or neighboring rights (\"Copyright and\\nRelated Rights\"). Copyright and Related Rights include, but are not limited\\nto, the following:\\n\\n  i. the right to reproduce, adapt, distribute, perform, display, communicate,\\n  and translate a Work;\\n\\n  ii. moral rights retained by the original author(s) and/or performer(s);\\n\\n  iii. publicity and privacy rights pertaining to a person\\'s image or likeness\\n  depicted in a Work;\\n\\n  iv. rights protecting against unfair competition in regards to a Work,\\n  subject to the limitations in paragraph 4(a), below;\\n\\n  v. rights protecting the extraction, dissemination, use and reuse of data in\\n  a Work;\\n\\n  vi. database rights (such as those arising under Directive 96/9/EC of the\\n  European Parliament and of the Council of 11 March 1996 on the legal\\n  protection of databases, and under any national implementation thereof,\\n  including any amended or successor version of such directive); and\\n\\n  vii. other similar, equivalent or corresponding rights throughout the world\\n  based on applicable law or treaty, and any national implementations thereof.\\n\\n2. Waiver. To the greatest extent permitted by, but not in contravention of,\\napplicable law, Affirmer hereby overtly, fully, permanently, irrevocably and\\nunconditionally waives, abandons, and surrenders all of Affirmer\\'s Copyright\\nand Related Rights and associated claims and causes of action, whether now\\nknown or unknown (including existing as well as future claims and causes of\\naction), in the Work (i) in all territories worldwide, (ii) for the maximum\\nduration provided by applicable law or treaty (including future time\\nextensions), (iii) in any current or future medium and for any number of\\ncopies, and (iv) for any purpose whatsoever, including without limitation\\ncommercial, advertising or promotional purposes (the \"Waiver\"). Affirmer makes\\nthe Waiver for the benefit of each member of the public at large and to the\\ndetriment of Affirmer\\'s heirs and successors, fully intending that such Waiver\\nshall not be subject to revocation, rescission, cancellation, termination, or\\nany other legal or equitable action to disrupt the quiet enjoyment of the Work\\nby the public as contemplated by Affirmer\\'s express Statement of Purpose.\\n\\n3. Public License Fallback. Should any part of the Waiver for any reason be\\njudged legally invalid or ineffective under applicable law, then the Waiver\\nshall be preserved to the maximum extent permitted taking into account\\nAffirmer\\'s express Statement of Purpose. In addition, to the extent the Waiver\\nis so judged Affirmer hereby grants to each affected person a royalty-free,\\nnon transferable, non sublicensable, non exclusive, irrevocable and\\nunconditional license to exercise Affirmer\\'s Copyright and Related Rights in\\nthe Work (i) in all territories worldwide, (ii) for the maximum duration\\nprovided by applicable law or treaty (including future time extensions), (iii)\\nin any current or future medium and for any number of copies, and (iv) for any\\npurpose whatsoever, including without limitation commercial, advertising or\\npromotional purposes (the \"License\"). The License shall be deemed effective as\\nof the date CC0 was applied by Affirmer to the Work. Should any part of the\\nLicense for any reason be judged legally invalid or ineffective under\\napplicable law, such partial invalidity or ineffectiveness shall not\\ninvalidate the remainder of the License, and in such case Affirmer hereby\\naffirms that he or she will not (i) exercise any of his or her remaining\\nCopyright and Related Rights in the Work or (ii) assert any associated claims\\nand causes of action with respect to the Work, in either case contrary to\\nAffirmer\\'s express Statement of Purpose.\\n\\n4. Limitations and Disclaimers.\\n\\n  a. No trademark or patent rights held by Affirmer are waived, abandoned,\\n  surrendered, licensed or otherwise affected by this document.\\n\\n  b. Affirmer offers the Work as-is and makes no representations or warranties\\n  of any kind concerning the Work, express, implied, statutory or otherwise,\\n  including without limitation warranties of title, merchantability, fitness\\n  for a particular purpose, non infringement, or the absence of latent or\\n  other defects, accuracy, or the present or absence of errors, whether or not\\n  discoverable, all to the greatest extent permissible under applicable law.\\n\\n  c. Affirmer disclaims responsibility for clearing rights of other persons\\n  that may apply to the Work or any use thereof, including without limitation\\n  any person\\'s Copyright and Related Rights in the Work. Further, Affirmer\\n  disclaims responsibility for obtaining any necessary consents, permissions\\n  or other rights required for any use of the Work.\\n\\n  d. Affirmer understands and acknowledges that Creative Commons is not a\\n  party to this document and has no duty or obligation with respect to this\\n  CC0 or use of the Work.\\n\\nFor more information, please see\\nhttp://creativecommons.org/publicdomain/zero/1.0/\\n'",
    "technique": "File Exploration"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Awesome Prolog",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "awesome-prolog",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "klaussinani",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/klaussinani/awesome-prolog/blob/master/readme.md",
    "technique": "GitHub API"
  },
  "releases": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      {
        "authorType": "User",
        "author_name": "klaussinani",
        "body": "- Initial stable release\r\n\r\n[klauscfhq/awesome-prolog@`v1.0.0`](https://github.com/klauscfhq/awesome-prolog/compare/master@%7B4day%7D...master)",
        "dateCreated": "2017-12-09T20:36:05Z",
        "datePublished": "2017-12-09T20:45:41Z",
        "html_url": "https://github.com/klaussinani/awesome-prolog/releases/tag/v1.0.0",
        "name": "1.0.0",
        "tag_name": "v1.0.0",
        "tarball_url": "https://api.github.com/repos/klaussinani/awesome-prolog/tarball/v1.0.0",
        "url": "https://api.github.com/repos/klaussinani/awesome-prolog/releases/8840857",
        "zipball_url": "https://api.github.com/repos/klaussinani/awesome-prolog/zipball/v1.0.0"
      }
    ],
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 384,
      "date": "Mon, 20 Dec 2021 21:37:24 GMT"
    },
    "technique": "GitHub API"
  },
  "topics": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "awesome",
      "prolog",
      "list",
      "logic",
      "programming"
    ],
    "technique": "GitHub API"
  }
}