{
  "acknowledgement": [
    {
      "confidence": [
        1
      ],
      "excerpt": "The development of this project was partly sponsored by [NetzeBW](https://www.netze-bw.de/) for [NETZlive](https://www.netze-bw.de/unsernetz/netzinnovationen/digitalisierung/netzlive).\n\n[JetBrains](https://www.jetbrains.com/?from=RDF.ex) supports the project with complimentary access to its development environments.\n\n\n",
      "technique": "Header extraction"
    }
  ],
  "codeOfConduct": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://raw.githubusercontent.com/marcelotto/rdf-ex/master/CODE_OF_CONDUCT.md",
    "technique": "File Exploration"
  },
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/rdf-elixir/rdf-ex",
    "technique": "GitHub API"
  },
  "contributingGuidelines": {
    "confidence": [
      1.0
    ],
    "excerpt": "Fork it ( https://github.com/rdf-elixir/rdf-ex/fork )\nCreate your feature branch (git checkout -b my-new-feature)\nMake your changes, with new passing tests. Follow this style guide.\nExecute all tests.\nCommit your changes (git commit -am 'Add some feature')\nPush to the branch (git push origin my-new-feature)\nCreate a new Pull Request",
    "technique": "File Exploration"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2017-06-24T22:50:10Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-12-20T14:06:29Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9957660770306503,
        0.9021719810262289
      ],
      "excerpt": "An implementation of the RDF data model in Elixir. \nThe API documentation can be found here. For a guide and more information about RDF.ex and it's related projects, go to https://rdf-elixir.dev. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8819352492058719,
        0.8194083768694364,
        0.8954684512576901,
        0.8442427310030557,
        0.9339819825890577,
        0.9469017850921877,
        0.9415321288107539,
        0.9543621739802849,
        0.8452706521824411
      ],
      "excerpt": "fully compatible with the RDF 1.1 specification \nsupport for the [RDF-star] extension \nin-memory data structures for RDF descriptions, RDF graphs and RDF datasets \nbasic graph pattern matching against the in-memory data structures with streaming-support \nexecute [SPARQL] queries against the in-memory data structures with the [SPARQL.ex] package or against any SPARQL endpoint with the [SPARQL.Client] package \nRDF vocabularies as Elixir modules for safe, i.e. compile-time checked and concise usage of IRIs \nmost of the important XML schema datatypes for RDF literals \nsupport for custom datatypes for RDF literals, incl. as derivations of XSD datatypes via facets  \nsigils for the most common types of nodes, i.e. IRIs, literals, blank nodes and lists \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9558923815455773,
        0.9827449759673382,
        0.9901074423799542,
        0.9560496989352494
      ],
      "excerpt": "implementations for the [N-Triples], [N-Quads] and [Turtle] serialization formats (including the respective RDF-star extensions); [JSON-LD] and [RDF-XML] are available with the separate [JSON-LD.ex] and [RDF-XML.ex] packages \nvalidation of RDF data against [ShEx] schemas with the [ShEx.ex] package \nmapping of the RDF data structures to Elixir structs and back with [Grax] \nThere's still much to do for a complete RDF ecosystem for Elixir, which means there are plenty of opportunities to contribute. Here are some suggestions: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8886034359529978
      ],
      "excerpt": "more XSD datatypes \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.940502563669477
      ],
      "excerpt": "See CONTRIBUTING for details. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "An implementation of RDF for Elixir",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/marcelotto/rdf-ex/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 5,
      "date": "Mon, 20 Dec 2021 16:39:03 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/rdf-elixir/rdf-ex/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "rdf-elixir/rdf-ex",
    "technique": "GitHub API"
  },
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/rdf-elixir/rdf-ex/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Elixir",
      "Erlang"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "name": "MIT License",
      "url": "https://api.github.com/licenses/mit"
    },
    "technique": "GitHub API"
  },
  "licenseText": {
    "confidence": [
      1.0
    ],
    "excerpt": "b'Summary\\n=======\\n\\nDistributed under both the W3C Test Suite License[1] and the W3C 3-clause BSD\\nLicense[2]. To contribute to a W3C Test Suite, see the policies and contribution\\nforms [3]\\n\\n1. http://www.w3.org/Consortium/Legal/2008/04-testsuite-license\\n2. http://www.w3.org/Consortium/Legal/2008/03-bsd-license\\n3. http://www.w3.org/2004/10/27-testcases\\n\\nDISCLAIMER\\n\\nUNDER BOTH MUTUALLY EXCLUSIVE LICENSES, THIS DOCUMENT AND ALL DOCUMENTS, TESTS\\nAND SOFTWARE THAT LINK THIS STATEMENT ARE PROVIDED \"AS IS,\" AND COPYRIGHT\\nHOLDERS MAKE NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING,\\nBUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR\\nPURPOSE, NON-INFRINGEMENT, OR TITLE; THAT THE CONTENTS OF THE DOCUMENT ARE\\nSUITABLE FOR ANY PURPOSE; NOR THAT THE IMPLEMENTATION OF SUCH CONTENTS WILL NOT\\nINFRINGE ANY THIRD PARTY PATENTS, COPYRIGHTS, TRADEMARKS OR OTHER RIGHTS.\\nCOPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR\\nCONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THE DOCUMENT OR THE PERFORMANCE\\nOR IMPLEMENTATION OF THE CONTENTS THEREOF.\\n\\n\\nW3C Test Suite License\\n======================\\n\\nThis document, Test Suites and other documents that link to this statement are\\nprovided by the copyright holders under the following license: By using and/or\\ncopying this document, or the W3C document from which this statement is linked,\\nyou (the licensee) agree that you have read, understood, and will comply with\\nthe following terms and conditions:\\n\\nPermission to copy, and distribute the contents of this document, or the W3C\\ndocument from which this statement is linked, in any medium for any purpose and\\nwithout fee or royalty is hereby granted, provided that you include the\\nfollowing on ALL copies of the document, or portions thereof, that you use:\\n\\n1 A link or URL to the original W3C document.\\n\\n2 The pre-existing copyright notice of the original author, or if it doesn\\'t\\n  exist, a notice (hypertext is preferred, but a textual representation is\\n  permitted) of the form: \"Copyright \\xc2\\xa9 [$date-of-document] World Wide Web\\n  Consortium, (Massachusetts Institute of Technology, European Research\\n  Consortium for Informatics and Mathematics, Keio University) and others. All\\n  Rights\\n  Reserved. http://www.w3.org/Consortium/Legal/2008/04-testsuite-copyright.html\"\\n\\n3 If it exists, the STATUS of the W3C document.\\n\\n4 When space permits, inclusion of the full text of this NOTICE should be\\n  provided. We request that authorship attribution be provided in any software,\\n  documents, or other items or products that you create pursuant to the\\n  implementation of the contents of this document, or any portion thereof.\\n\\n\\nNo right to create modifications or derivatives of W3C documents is granted\\npursuant to this license. However, if additional requirements (documented in the\\nCopyright FAQ) are satisfied, the right to create modifications or derivatives\\nis sometimes granted by the W3C to individuals complying with those\\nrequirements.\\n\\nIf a Test Suite distinguishes the test harness (or, framework for navigation)\\nand the actual tests, permission is given to remove or alter the harness or\\nnavigation if the Test Suite in question allows to do so. The tests themselves\\nshall NOT be changed in any way.\\n\\nThe name and trademarks of W3C and other copyright holders may NOT be used in\\nadvertising or publicity pertaining to this document or other documents that\\nlink to this statement without specific, written prior permission. Title to\\ncopyright in this document will at all times remain with copyright\\nholders. Permission is given to use the trademarked string W3C within claims of\\nperformance concerning W3C Specifications or features described therein, and\\nthere only, if the test suite so authorizes.\\n\\nTHIS WORK IS PROVIDED BY W3C, MIT, ERCIM, KEIO UNIVERSITY, THE COPYRIGHT HOLDERS\\nAND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT\\nNOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A\\nPARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL W3C, MIT, ERCIM, KEIO\\nUNIVERSITY, THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,\\nINDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,\\nBUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE\\nOR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF\\nADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\\n\\n\\nW3C 3-clause BSD License\\n========================\\n\\nRedistribution and use in source and binary forms, with or without modification,\\nare permitted provided that the following conditions are met:\\n\\n1 Redistributions of works must retain the original copyright notice, this list\\n  of conditions and the following disclaimer.\\n\\n2 Redistributions in binary form must reproduce the original copyright notice,\\n  this list of conditions and the following disclaimer in the documentation\\n  and/or other materials provided with the distribution.\\n\\n3 Neither the name of the W3C nor the names of its contributors may be used to\\n  endorse or promote products derived from this work without specific prior\\n  written permission.\\n\\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR\\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\\n\\n'",
    "technique": "File Exploration"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "RDF.ex",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "rdf-ex",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "rdf-elixir",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "Organization",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/rdf-elixir/rdf-ex/blob/master/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 69,
      "date": "Mon, 20 Dec 2021 16:39:03 GMT"
    },
    "technique": "GitHub API"
  },
  "topics": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "rdf",
      "elixir",
      "linked-data",
      "semantic-web",
      "graph",
      "knowledge-graph"
    ],
    "technique": "GitHub API"
  }
}