{
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/MM2-0/rdf4a",
    "technique": "GitHub API"
  },
  "contributingGuidelines": {
    "confidence": [
      1.0
    ],
    "excerpt": "How to contribute\nSo you want to help out making RDF4J better. That's great! Here's some things you need\nto know and do before you dive in.\nTable of Contents  \n\nLegal stuff\nDeveloper Workflow: Which Branch?\nA note on the 1.0.x release branch and Java 7 compatibility\nCode formatting\nCreating your contribution\nSubmitting your changes\n\nLegal stuff\nRDF4J is a project governed by the Eclipse Foundation, which has strict policies and guidelines regarding contributions.\nIn order for any contributions to RDF4J to be accepted, you MUST do the following things:\n\n\nDigitally sign the Eclipse Foundation Contributor License Agreement.\nTo sign the Eclipse CLA you need to:\n\n\nObtain an Eclipse Foundation userid. If you already use Eclipse Bugzilla or Gerrit you already have one of those. If you don’t, you need to\nregister.\n\n\nLogin into the projects portal, select “My Account”, and then the “Contributor License Agreement” tab. Read through, then sign.\n\n\nAdd your github username in your Eclipse Foundation account settings. Log in it to Eclipse and go to account settings.\n\n\n\"Sign-off\" your commits\n\n\nEvery commit you make in your patch or pull request MUST be \"signed off\".\nYou do this by adding the -s flag when you make the commit(s).\nDeveloper Workflow: Which Branch?\nRDF4J feature development takes place against the master branch. In addition,\neach minor release has its own release branch (e.g. releases/1.0.x, and\nreleases/2.0.x), on which hotfixes/patches are done.\nEvery issue, no matter how small, gets its own branch. New features and enhancements are usually\ndeveloped on branches from the master branch. Patches or hotfixes for bugs in existing\nreleases are developed on a branch split off from the releveant release branch.\nIssue branch names are always prefixed with issues/, followed by the issue\nnumber in the GitHub issue tracker,\nfollowed by one or two dash-separated keywords for the issue. \nFor example (fictional): issues/#6-sparql-npe is the branch for a fix for\nGitHub issue #6, which has to do with SPARQL and a NullPointerException.\nIf you're unsure on which branch a contribution should be made, please ask!\nA note on the 1.0.x release branch and Java 7 compatibility\nRDF4J 1.0 is a backport of RDF4J 2.0, to be executable on a Java 7 Runtime Environment. This means that we do not accept any fixes or feature development directly against the releases/1.0.x branch, and we never merge this branch back into either master, or the releases/2.0.x branch. \nInstead, new features are developed against the master branch, and these are never merged into either release branch (they are instead scheduled for inclusion in the next minor or major release: 2.1, or 3.0). Bug fixes and minor improvements (which are sufficiently minor that they can be considered part of a patch release) are developed against the releases/2.0.x branch, which can then be merged back into releases/1.0.x branch. \nSince releases/1.0.x is to be kept compatible with Java 7, it is inevitable that it will occassionally become unstable when merging the releases/2.0.x branch into it: the build process verifies that the branch is Java 7-compatible, so it will fail with a compilation error when this happens. These compilation failures can be fixed by branching a hotfix branch directly directly off the releases/1.0.x branch.\nCode formatting\nRDF4J uses custom code formatting settings and a few code templates as well, and we expect every contributor to apply these settings before submitting a contribution.\nThe simplest way to do apply code formatting is as follows:\n\nIn Eclipse, open 'Preferences' -> 'Java' -> 'Code Style' -> 'Formatter' \nClick 'Import...' and find the file eclipse-settings/rdf4j-formatting.xml, located in the git repository root.\nThe active profile should now say 'RDF4J formatting'. Click ok.\nWhen making changes to Java code, hit Ctrl+Shift+F before saving to reformat the code. Alternatively, you can configure Eclipse to automatically apply formatting on save. This can be activated by going to 'Preferences' -> 'Java' -> 'Editor' -> 'Save Actions' and making sure the 'Format source code' option checkbox is ticked.\n\nSimilarly, to apply templates:\n\nIn Eclipse, open 'Preferences' -> 'Java' -> 'Code Style' -> 'Code Templates' \nClick 'Import...' and find the file eclipse-settings/codetemplates.xml, located in the git repository root.\nClick OK. The templates will be automatically applied when necessary. \n\nCreating your contribution\nOnce the legalities are out of the way and you're up-to-date on our workflow and code formatting, you can \nstart coding. Here's how:\n\nCreate an issue in the RDF4J GitHub issue tracker that describes your improvement, new feature, or bug fix. Alternatively, comment on an existing issue to indicate you're keen to help solve it.\nFork the repository on GitHub\nCreate a new branch for your changes (see the Developer Guidelines above for details - please make sure you pick the correct and up-to-date starting branch!)\nMake your changes\nMake sure you include tests\nMake sure the test suite passes after your changes\nCommit your changes into the branch. Please use descriptive and meaningful commit messages. Reference the issue number in the commit message (for example \" #6 added null check\")\nSign off every commit you do, as explained above.\nOptionally squash your commits (not necessary, but if you want to clean your commit history a bit, this is the point to do it).\nPush your changes to your branch in your forked repository\n\nSubmitting your changes\nOnce you are satisfied your changes are in good shape, you can use GitHub to\nsubmit a pull request (PR) for your contribution back to the central RDF4J\nrepository. Again, please make sure you submit your PR against the correct branch (the appropriate release branch if you fixed a bug, or the master branch if you developed a new feature). \nOnce you have submitted your PR, do not use your branch for any other\ndevelopment (unless asked to do so by the reviewers of your PR). If you do, any\nfurther changes that you make will be visible in the PR.",
    "technique": "File Exploration"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2017-04-02T14:36:44Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-03-26T17:53:43Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9914129854139269,
        0.989821121552191
      ],
      "excerpt": "This is a port of RDF4J to the Android platform. \nEclipse RDF4J (formerly known as Sesame) is a powerful Java framework for processing and handling RDF data. This includes creating, parsing, scalable storage, reasoning and querying with RDF and Linked Data. It offers an easy-to-use API that can be connected to all leading RDF database solutions. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "RDF4J for Android",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/MM2-0/rdf4a/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 0,
      "date": "Tue, 21 Dec 2021 01:18:31 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/MM2-0/rdf4a/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "MM2-0/rdf4a",
    "technique": "GitHub API"
  },
  "hasScriptFile": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://raw.githubusercontent.com/MM2-0/rdf4a/java7-backport/core/assembly/src/main/dist/bin/console.sh",
      "https://raw.githubusercontent.com/MM2-0/rdf4a/java7-backport/core/http/workbench/compileTypescript.sh"
    ],
    "technique": "File Exploration"
  },
  "installation": [
    {
      "confidence": [
        1
      ],
      "excerpt": "Install to local Maven repository\n```\nmvn package -DskipTests && mvn install -DskipTests\n```\n\nInclude in an Android project\n```\n//build.gradle\nrepositories {\n    mavenLocal()\n}\ndependencies {\n    compile 'de.mm20.rdf4a:rdf4j-model:1.1-SNAPSHOT'\n    [...]\n}\n```\n",
      "technique": "Header extraction"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/MM2-0/rdf4a/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Java",
      "JavaScript",
      "XSLT",
      "TypeScript",
      "HTML",
      "Ruby",
      "CSS",
      "Shell"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "licenseText": {
    "confidence": [
      1.0
    ],
    "excerpt": "b'Summary\\n=======\\n\\nDistributed under both the W3C Test Suite License[1] and the W3C 3-clause BSD\\nLicense[2]. To contribute to a W3C Test Suite, see the policies and contribution\\nforms [3]\\n\\n1. http://www.w3.org/Consortium/Legal/2008/04-testsuite-license\\n2. http://www.w3.org/Consortium/Legal/2008/03-bsd-license\\n3. http://www.w3.org/2004/10/27-testcases\\n\\nDISCLAIMER\\n\\nUNDER BOTH MUTUALLY EXCLUSIVE LICENSES, THIS DOCUMENT AND ALL DOCUMENTS, TESTS\\nAND SOFTWARE THAT LINK THIS STATEMENT ARE PROVIDED \"AS IS,\" AND COPYRIGHT\\nHOLDERS MAKE NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING,\\nBUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR\\nPURPOSE, NON-INFRINGEMENT, OR TITLE; THAT THE CONTENTS OF THE DOCUMENT ARE\\nSUITABLE FOR ANY PURPOSE; NOR THAT THE IMPLEMENTATION OF SUCH CONTENTS WILL NOT\\nINFRINGE ANY THIRD PARTY PATENTS, COPYRIGHTS, TRADEMARKS OR OTHER RIGHTS.\\nCOPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR\\nCONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THE DOCUMENT OR THE PERFORMANCE\\nOR IMPLEMENTATION OF THE CONTENTS THEREOF.\\n\\n\\nW3C Test Suite License\\n======================\\n\\nThis document, Test Suites and other documents that link to this statement are\\nprovided by the copyright holders under the following license: By using and/or\\ncopying this document, or the W3C document from which this statement is linked,\\nyou (the licensee) agree that you have read, understood, and will comply with\\nthe following terms and conditions:\\n\\nPermission to copy, and distribute the contents of this document, or the W3C\\ndocument from which this statement is linked, in any medium for any purpose and\\nwithout fee or royalty is hereby granted, provided that you include the\\nfollowing on ALL copies of the document, or portions thereof, that you use:\\n\\n1 A link or URL to the original W3C document.\\n\\n2 The pre-existing copyright notice of the original author, or if it doesn\\'t\\n  exist, a notice (hypertext is preferred, but a textual representation is\\n  permitted) of the form: \"Copyright \\xc2\\xa9 [$date-of-document] World Wide Web\\n  Consortium, (Massachusetts Institute of Technology, European Research\\n  Consortium for Informatics and Mathematics, Keio University) and others. All\\n  Rights\\n  Reserved. http://www.w3.org/Consortium/Legal/2008/04-testsuite-copyright.html\"\\n\\n3 If it exists, the STATUS of the W3C document.\\n\\n4 When space permits, inclusion of the full text of this NOTICE should be\\n  provided. We request that authorship attribution be provided in any software,\\n  documents, or other items or products that you create pursuant to the\\n  implementation of the contents of this document, or any portion thereof.\\n\\n\\nNo right to create modifications or derivatives of W3C documents is granted\\npursuant to this license. However, if additional requirements (documented in the\\nCopyright FAQ) are satisfied, the right to create modifications or derivatives\\nis sometimes granted by the W3C to individuals complying with those\\nrequirements.\\n\\nIf a Test Suite distinguishes the test harness (or, framework for navigation)\\nand the actual tests, permission is given to remove or alter the harness or\\nnavigation if the Test Suite in question allows to do so. The tests themselves\\nshall NOT be changed in any way.\\n\\nThe name and trademarks of W3C and other copyright holders may NOT be used in\\nadvertising or publicity pertaining to this document or other documents that\\nlink to this statement without specific, written prior permission. Title to\\ncopyright in this document will at all times remain with copyright\\nholders. Permission is given to use the trademarked string W3C within claims of\\nperformance concerning W3C Specifications or features described therein, and\\nthere only, if the test suite so authorizes.\\n\\nTHIS WORK IS PROVIDED BY W3C, MIT, ERCIM, KEIO UNIVERSITY, THE COPYRIGHT HOLDERS\\nAND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT\\nNOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A\\nPARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL W3C, MIT, ERCIM, KEIO\\nUNIVERSITY, THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,\\nINDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,\\nBUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE\\nOR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF\\nADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\\n\\n\\nW3C 3-clause BSD License\\n========================\\n\\nRedistribution and use in source and binary forms, with or without modification,\\nare permitted provided that the following conditions are met:\\n\\n1 Redistributions of works must retain the original copyright notice, this list\\n  of conditions and the following disclaimer.\\n\\n2 Redistributions in binary form must reproduce the original copyright notice,\\n  this list of conditions and the following disclaimer in the documentation\\n  and/or other materials provided with the distribution.\\n\\n3 Neither the name of the W3C nor the names of its contributors may be used to\\n  endorse or promote products derived from this work without specific prior\\n  written permission.\\n\\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR\\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\\n\\n'",
    "technique": "File Exploration"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "RDF4A - Porting RDF4J to Android",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "rdf4a",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "MM2-0",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/MM2-0/rdf4a/blob/java7-backport/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 2,
      "date": "Tue, 21 Dec 2021 01:18:31 GMT"
    },
    "technique": "GitHub API"
  }
}