{
  "citation": [
    {
      "confidence": [
        0.8906174419333412,
        0.8906174419333412
      ],
      "excerpt": "P4-LUCAT (https://www.tib.eu/de/forschung-entwicklung/projektuebersicht/projektsteckbrief/p4-lucat) \nImProVIT (https://www.tib.eu/de/forschung-entwicklung/projektuebersicht/projektsteckbrief/improvit) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8445620958764796
      ],
      "excerpt": "Open Cities (https://ciudades-abiertas.es/): national project on creating common and shared vocabularies for Spanish Cities \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9848074028076899
      ],
      "excerpt": "-  Virtual Platform for the H2020 European Joint Programme on Rare Disease (https://www.ejprarediseases.org) \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/SDM-TIB/SDM-RDFizer",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2018-05-03T09:14:46Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-12-18T06:28:43Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9962998490665169,
        0.9829822510230524,
        0.9820502489703894,
        0.8967591159116058
      ],
      "excerpt": "This project presents the SDM-RDFizer, an interpreter of mapping rules that allows the transformation of (un)structured data into RDF knowledge graphs. The current version of the SDM-RDFizer assumes mapping rules are defined in the RDF Mapping Language (RML) by Dimou et al. The SDM-RDFizer implements optimized data structures and relational algebra operators that enable an efficient execution of RML triple maps even in the presence of Big data. SDM-RDFizer is able to process data from heterogeneous data sources (CSV, JSON, RDB, XML) processing each set of RML rules (TriplesMap) in a multi-thread safe procedure. \nThe SDM-RDFizer is used in the creation of the knowledge graphs of EU H2020 projects and national projects where the Scientific Data Management group participates. These projects include: \niASiS (http://project-iasis.eu/): big data for precision medicine, based on patient data insights. The iASiS RDF knowledge graph comprises more than 1.2B RDF triples collected from more than 40 heterogeneous sources using over 1300 RML triple maps.  \nBigMedilytics (https://www.bigmedilytics.eu/): lung cancer pilot. 800 RML triple maps are used to create the lung cancer knowledge graph from around 25 data sources with 500M RDF triples. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9833468424180213,
        0.9859678187884516
      ],
      "excerpt": "EUvsVirus Hackathon (April 2020) (https://blogs.tib.eu/wp/tib/2020/05/06/how-do-knowledge-graphs-contribute-to-understanding-covid-19-related-treatments/). SDM-RDFizer created the Knowledge4COVID-19 knowledge graph during the participation of the team of the Scientific Data Management group. By June 7th, 2020, this KG is comprised of 28M RDF triples describing at a fine-grained level 63527 COVID-19 scientific publications and COVID-19 related concepts (e.g., 5802 substances, 1.2M drug-drug interactions, and 103 molecular disfunctions).  \nThe SDM-RDFizer is also used in EU H2020, EIT-Digital and Spanish national projects where the Ontology Engineering Group (Technical University of Madrid) participates. These projects, mainly focused on the transportation and smart cities domain, include: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9830095643559356,
        0.953317509629351,
        0.9522919160794098,
        0.8960224513934387
      ],
      "excerpt": "EIT-SNAP (https://www.snap-project.eu/): innovation project on the application of semantic technologies for national access points. \nOpen Cities (https://ciudades-abiertas.es/): national project on creating common and shared vocabularies for Spanish Cities \nDrugs4Covid (https://drugs4covid.oeg.fi.upm.es/): NLP annotations and metadata from more than 60,000 scientific papers about COVID viruses are integrated in a KG with almost 44M of facts (triples). SDM-RDFizer was used for creating this KG. \nOther projects were the SDM-RDFizer is also used: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.92042993827397
      ],
      "excerpt": "You can easily customize your own configurations from the set of features that SDM-RDFzier offers by changing the values of the parameters in the config file. The descriptions of each parameter and the possible values are provided here; \"ordered\" and \"large_file\" are the new features provided by SDM-RDFizer version4.0. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "An Efficient RML-Compliant Engine for Knowledge Graph Construction",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/SDM-TIB/SDM-RDFizer/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 15,
      "date": "Mon, 20 Dec 2021 14:15:26 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "SDM-TIB/SDM-RDFizer",
    "technique": "GitHub API"
  },
  "hasBuildFile": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://raw.githubusercontent.com/SDM-TIB/SDM-RDFizer/master/Dockerfile"
    ],
    "technique": "File Exploration"
  },
  "installation": [
    {
      "confidence": [
        1
      ],
      "excerpt": "From PyPI (https://pypi.org/project/rdfizer/):\n```\npython3 -m pip install rdfizer\npython3 -m rdfizer -c /path/to/config/file\n```\n\nFrom Github/Docker:\nVisit the [wiki](https://github.com/SDM-TIB/SDM-RDFizer/wiki) of the repository to learn how to install and run the SDM-RDFizer. You can also take a look to our demo at: https://www.youtube.com/watch?v=DpH_57M1uOE\n- Install and run the SDM-RDFizer: https://github.com/SDM-TIB/SDM-RDFizer/wiki/Install&Run\n- Parameters to configure SDM-RDFizer: https://github.com/SDM-TIB/SDM-RDFizer/wiki/The-Parameters-of-the-Configuration-file\n- FAQ: https://github.com/SDM-TIB/SDM-RDFizer/wiki/FAQ\n\n",
      "technique": "Header extraction"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Python",
      "Dockerfile"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "name": "Apache License 2.0",
      "url": "https://api.github.com/licenses/apache-2.0"
    },
    "technique": "GitHub API"
  },
  "licenseText": {
    "confidence": [
      1.0
    ],
    "excerpt": "b'                                 Apache License\\n                           Version 2.0, January 2004\\n                        http://www.apache.org/licenses/\\n\\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\\n\\n   1. Definitions.\\n\\n      \"License\" shall mean the terms and conditions for use, reproduction,\\n      and distribution as defined by Sections 1 through 9 of this document.\\n\\n      \"Licensor\" shall mean the copyright owner or entity authorized by\\n      the copyright owner that is granting the License.\\n\\n      \"Legal Entity\" shall mean the union of the acting entity and all\\n      other entities that control, are controlled by, or are under common\\n      control with that entity. For the purposes of this definition,\\n      \"control\" means (i) the power, direct or indirect, to cause the\\n      direction or management of such entity, whether by contract or\\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\\n      outstanding shares, or (iii) beneficial ownership of such entity.\\n\\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\\n      exercising permissions granted by this License.\\n\\n      \"Source\" form shall mean the preferred form for making modifications,\\n      including but not limited to software source code, documentation\\n      source, and configuration files.\\n\\n      \"Object\" form shall mean any form resulting from mechanical\\n      transformation or translation of a Source form, including but\\n      not limited to compiled object code, generated documentation,\\n      and conversions to other media types.\\n\\n      \"Work\" shall mean the work of authorship, whether in Source or\\n      Object form, made available under the License, as indicated by a\\n      copyright notice that is included in or attached to the work\\n      (an example is provided in the Appendix below).\\n\\n      \"Derivative Works\" shall mean any work, whether in Source or Object\\n      form, that is based on (or derived from) the Work and for which the\\n      editorial revisions, annotations, elaborations, or other modifications\\n      represent, as a whole, an original work of authorship. For the purposes\\n      of this License, Derivative Works shall not include works that remain\\n      separable from, or merely link (or bind by name) to the interfaces of,\\n      the Work and Derivative Works thereof.\\n\\n      \"Contribution\" shall mean any work of authorship, including\\n      the original version of the Work and any modifications or additions\\n      to that Work or Derivative Works thereof, that is intentionally\\n      submitted to Licensor for inclusion in the Work by the copyright owner\\n      or by an individual or Legal Entity authorized to submit on behalf of\\n      the copyright owner. For the purposes of this definition, \"submitted\"\\n      means any form of electronic, verbal, or written communication sent\\n      to the Licensor or its representatives, including but not limited to\\n      communication on electronic mailing lists, source code control systems,\\n      and issue tracking systems that are managed by, or on behalf of, the\\n      Licensor for the purpose of discussing and improving the Work, but\\n      excluding communication that is conspicuously marked or otherwise\\n      designated in writing by the copyright owner as \"Not a Contribution.\"\\n\\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\\n      on behalf of whom a Contribution has been received by Licensor and\\n      subsequently incorporated within the Work.\\n\\n   2. Grant of Copyright License. Subject to the terms and conditions of\\n      this License, each Contributor hereby grants to You a perpetual,\\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\\n      copyright license to reproduce, prepare Derivative Works of,\\n      publicly display, publicly perform, sublicense, and distribute the\\n      Work and such Derivative Works in Source or Object form.\\n\\n   3. Grant of Patent License. Subject to the terms and conditions of\\n      this License, each Contributor hereby grants to You a perpetual,\\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\\n      (except as stated in this section) patent license to make, have made,\\n      use, offer to sell, sell, import, and otherwise transfer the Work,\\n      where such license applies only to those patent claims licensable\\n      by such Contributor that are necessarily infringed by their\\n      Contribution(s) alone or by combination of their Contribution(s)\\n      with the Work to which such Contribution(s) was submitted. If You\\n      institute patent litigation against any entity (including a\\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\\n      or a Contribution incorporated within the Work constitutes direct\\n      or contributory patent infringement, then any patent licenses\\n      granted to You under this License for that Work shall terminate\\n      as of the date such litigation is filed.\\n\\n   4. Redistribution. You may reproduce and distribute copies of the\\n      Work or Derivative Works thereof in any medium, with or without\\n      modifications, and in Source or Object form, provided that You\\n      meet the following conditions:\\n\\n      (a) You must give any other recipients of the Work or\\n          Derivative Works a copy of this License; and\\n\\n      (b) You must cause any modified files to carry prominent notices\\n          stating that You changed the files; and\\n\\n      (c) You must retain, in the Source form of any Derivative Works\\n          that You distribute, all copyright, patent, trademark, and\\n          attribution notices from the Source form of the Work,\\n          excluding those notices that do not pertain to any part of\\n          the Derivative Works; and\\n\\n      (d) If the Work includes a \"NOTICE\" text file as part of its\\n          distribution, then any Derivative Works that You distribute must\\n          include a readable copy of the attribution notices contained\\n          within such NOTICE file, excluding those notices that do not\\n          pertain to any part of the Derivative Works, in at least one\\n          of the following places: within a NOTICE text file distributed\\n          as part of the Derivative Works; within the Source form or\\n          documentation, if provided along with the Derivative Works; or,\\n          within a display generated by the Derivative Works, if and\\n          wherever such third-party notices normally appear. The contents\\n          of the NOTICE file are for informational purposes only and\\n          do not modify the License. You may add Your own attribution\\n          notices within Derivative Works that You distribute, alongside\\n          or as an addendum to the NOTICE text from the Work, provided\\n          that such additional attribution notices cannot be construed\\n          as modifying the License.\\n\\n      You may add Your own copyright statement to Your modifications and\\n      may provide additional or different license terms and conditions\\n      for use, reproduction, or distribution of Your modifications, or\\n      for any such Derivative Works as a whole, provided Your use,\\n      reproduction, and distribution of the Work otherwise complies with\\n      the conditions stated in this License.\\n\\n   5. Submission of Contributions. Unless You explicitly state otherwise,\\n      any Contribution intentionally submitted for inclusion in the Work\\n      by You to the Licensor shall be under the terms and conditions of\\n      this License, without any additional terms or conditions.\\n      Notwithstanding the above, nothing herein shall supersede or modify\\n      the terms of any separate license agreement you may have executed\\n      with Licensor regarding such Contributions.\\n\\n   6. Trademarks. This License does not grant permission to use the trade\\n      names, trademarks, service marks, or product names of the Licensor,\\n      except as required for reasonable and customary use in describing the\\n      origin of the Work and reproducing the content of the NOTICE file.\\n\\n   7. Disclaimer of Warranty. Unless required by applicable law or\\n      agreed to in writing, Licensor provides the Work (and each\\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\\n      implied, including, without limitation, any warranties or conditions\\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\\n      PARTICULAR PURPOSE. You are solely responsible for determining the\\n      appropriateness of using or redistributing the Work and assume any\\n      risks associated with Your exercise of permissions under this License.\\n\\n   8. Limitation of Liability. In no event and under no legal theory,\\n      whether in tort (including negligence), contract, or otherwise,\\n      unless required by applicable law (such as deliberate and grossly\\n      negligent acts) or agreed to in writing, shall any Contributor be\\n      liable to You for damages, including any direct, indirect, special,\\n      incidental, or consequential damages of any character arising as a\\n      result of this License or out of the use or inability to use the\\n      Work (including but not limited to damages for loss of goodwill,\\n      work stoppage, computer failure or malfunction, or any and all\\n      other commercial damages or losses), even if such Contributor\\n      has been advised of the possibility of such damages.\\n\\n   9. Accepting Warranty or Additional Liability. While redistributing\\n      the Work or Derivative Works thereof, You may choose to offer,\\n      and charge a fee for, acceptance of support, warranty, indemnity,\\n      or other liability obligations and/or rights consistent with this\\n      License. However, in accepting such obligations, You may act only\\n      on Your own behalf and on Your sole responsibility, not on behalf\\n      of any other Contributor, and only if You agree to indemnify,\\n      defend, and hold each Contributor harmless for any liability\\n      incurred by, or claims asserted against, such Contributor by reason\\n      of your accepting any such warranty or additional liability.\\n\\n   END OF TERMS AND CONDITIONS\\n\\n   APPENDIX: How to apply the Apache License to your work.\\n\\n      To apply the Apache License to your work, attach the following\\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\\n      replaced with your own identifying information. (Don\\'t include\\n      the brackets!)  The text should be enclosed in the appropriate\\n      comment syntax for the file format. We also recommend that a\\n      file or class name and description of purpose be included on the\\n      same \"printed page\" as the copyright notice for easier\\n      identification within third-party archives.\\n\\n   Copyright [yyyy] [name of copyright owner]\\n\\n   Licensed under the Apache License, Version 2.0 (the \"License\");\\n   you may not use this file except in compliance with the License.\\n   You may obtain a copy of the License at\\n\\n       http://www.apache.org/licenses/LICENSE-2.0\\n\\n   Unless required by applicable law or agreed to in writing, software\\n   distributed under the License is distributed on an \"AS IS\" BASIS,\\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\\n   See the License for the specific language governing permissions and\\n   limitations under the License.\\n'",
    "technique": "File Exploration"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "SDM-RDFizer",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "SDM-RDFizer",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "SDM-TIB",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "Organization",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/SDM-TIB/SDM-RDFizer/blob/master/README.md",
    "technique": "GitHub API"
  },
  "releases": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      {
        "authorType": "User",
        "author_name": "eiglesias34",
        "body": "",
        "dateCreated": "2021-12-07T19:05:51Z",
        "datePublished": "2021-12-07T19:06:40Z",
        "html_url": "https://github.com/SDM-TIB/SDM-RDFizer/releases/tag/v4.0.1.3a",
        "name": "",
        "tag_name": "v4.0.1.3a",
        "tarball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/tarball/v4.0.1.3a",
        "url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/releases/54819498",
        "zipball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/zipball/v4.0.1.3a"
      },
      {
        "authorType": "User",
        "author_name": "eiglesias34",
        "body": "",
        "dateCreated": "2021-12-07T18:54:34Z",
        "datePublished": "2021-12-07T18:55:01Z",
        "html_url": "https://github.com/SDM-TIB/SDM-RDFizer/releases/tag/v4.0.1.2",
        "name": "",
        "tag_name": "v4.0.1.2",
        "tarball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/tarball/v4.0.1.2",
        "url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/releases/54818917",
        "zipball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/zipball/v4.0.1.2"
      },
      {
        "authorType": "User",
        "author_name": "eiglesias34",
        "body": "",
        "dateCreated": "2021-12-07T16:31:26Z",
        "datePublished": "2021-12-07T16:37:45Z",
        "html_url": "https://github.com/SDM-TIB/SDM-RDFizer/releases/tag/v4.0.1.1a",
        "name": "",
        "tag_name": "v4.0.1.1a",
        "tarball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/tarball/v4.0.1.1a",
        "url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/releases/54809952",
        "zipball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/zipball/v4.0.1.1a"
      },
      {
        "authorType": "User",
        "author_name": "eiglesias34",
        "body": "",
        "dateCreated": "2021-12-07T15:42:48Z",
        "datePublished": "2021-12-07T16:18:36Z",
        "html_url": "https://github.com/SDM-TIB/SDM-RDFizer/releases/tag/v4.0.1",
        "name": "",
        "tag_name": "v4.0.1",
        "tarball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/tarball/v4.0.1",
        "url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/releases/54808449",
        "zipball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/zipball/v4.0.1"
      },
      {
        "authorType": "User",
        "author_name": "eiglesias34",
        "body": "Updating memory management",
        "dateCreated": "2021-10-05T15:37:08Z",
        "datePublished": "2021-10-05T15:43:00Z",
        "html_url": "https://github.com/SDM-TIB/SDM-RDFizer/releases/tag/v4.0",
        "name": "4.0",
        "tag_name": "v4.0",
        "tarball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/tarball/v4.0",
        "url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/releases/50825716",
        "zipball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/zipball/v4.0"
      },
      {
        "authorType": "User",
        "author_name": "eiglesias34",
        "body": "",
        "dateCreated": "2021-05-31T12:59:04Z",
        "datePublished": "2021-05-31T13:26:12Z",
        "html_url": "https://github.com/SDM-TIB/SDM-RDFizer/releases/tag/3.6",
        "name": "",
        "tag_name": "3.6",
        "tarball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/tarball/3.6",
        "url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/releases/43855297",
        "zipball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/zipball/3.6"
      },
      {
        "authorType": "User",
        "author_name": "eiglesias34",
        "body": "",
        "dateCreated": "2021-05-04T15:37:30Z",
        "datePublished": "2021-05-05T12:21:58Z",
        "html_url": "https://github.com/SDM-TIB/SDM-RDFizer/releases/tag/v3.5.2",
        "name": "",
        "tag_name": "v3.5.2",
        "tarball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/tarball/v3.5.2",
        "url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/releases/42472350",
        "zipball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/zipball/v3.5.2"
      },
      {
        "authorType": "User",
        "author_name": "eiglesias34",
        "body": "",
        "dateCreated": "2021-05-04T11:22:39Z",
        "datePublished": "2021-05-04T11:29:59Z",
        "html_url": "https://github.com/SDM-TIB/SDM-RDFizer/releases/tag/3.5.1",
        "name": "",
        "tag_name": "3.5.1",
        "tarball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/tarball/3.5.1",
        "url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/releases/42409026",
        "zipball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/zipball/3.5.1"
      },
      {
        "authorType": "User",
        "author_name": "dachafra",
        "body": "Solving a bottleneck in self-join execution",
        "dateCreated": "2021-04-28T15:39:12Z",
        "datePublished": "2021-04-29T14:11:45Z",
        "html_url": "https://github.com/SDM-TIB/SDM-RDFizer/releases/tag/v3.5",
        "name": "v3.5",
        "tag_name": "v3.5",
        "tarball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/tarball/v3.5",
        "url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/releases/42206185",
        "zipball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/zipball/v3.5"
      },
      {
        "authorType": "User",
        "author_name": "dachafra",
        "body": "Solving issues from #32 to #49 ",
        "dateCreated": "2021-02-01T19:13:39Z",
        "datePublished": "2021-02-08T16:15:20Z",
        "html_url": "https://github.com/SDM-TIB/SDM-RDFizer/releases/tag/v3.4",
        "name": "v3.4",
        "tag_name": "v3.4",
        "tarball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/tarball/v3.4",
        "url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/releases/37749522",
        "zipball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/zipball/v3.4"
      },
      {
        "authorType": "User",
        "author_name": "dachafra",
        "body": "Resolving issue problems with graph property generation\r\nCreating the output folder although it does not exist before running the process",
        "dateCreated": "2020-10-20T19:07:11Z",
        "datePublished": "2020-10-20T19:08:28Z",
        "html_url": "https://github.com/SDM-TIB/SDM-RDFizer/releases/tag/v3.3.2",
        "name": "v3.3.2",
        "tag_name": "v3.3.2",
        "tarball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/tarball/v3.3.2",
        "url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/releases/32829024",
        "zipball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/zipball/v3.3.2"
      },
      {
        "authorType": "User",
        "author_name": "dachafra",
        "body": "Issues #35 #34 #33 #32 are solved:\r\n1) Correct encoding for URIs in the generation process\r\n2) Correct generation when there are JSON and XML sources files or a mix of them",
        "dateCreated": "2020-10-03T08:15:42Z",
        "datePublished": "2020-10-03T08:18:41Z",
        "html_url": "https://github.com/SDM-TIB/SDM-RDFizer/releases/tag/v3.3.1",
        "name": "v3.3.1",
        "tag_name": "v3.3.1",
        "tarball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/tarball/v3.3.1",
        "url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/releases/32120654",
        "zipball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/zipball/v3.3.1"
      },
      {
        "authorType": "User",
        "author_name": "dachafra",
        "body": "Including solved issues in the materialization of RDB databases\r\nAutomatically deployment of the library through PyPI",
        "dateCreated": "2020-09-08T11:48:15Z",
        "datePublished": "2020-09-08T11:49:21Z",
        "html_url": "https://github.com/SDM-TIB/SDM-RDFizer/releases/tag/v3.3",
        "name": "v3.3",
        "tag_name": "v3.3",
        "tarball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/tarball/v3.3",
        "url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/releases/30904947",
        "zipball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/zipball/v3.3"
      },
      {
        "authorType": "User",
        "author_name": "dachafra",
        "body": "",
        "dateCreated": "2020-06-01T14:50:26Z",
        "datePublished": "2020-06-01T19:46:12Z",
        "html_url": "https://github.com/SDM-TIB/SDM-RDFizer/releases/tag/v3.2",
        "name": "v3.2",
        "tag_name": "v3.2",
        "tarball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/tarball/v3.2",
        "url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/releases/27109357",
        "zipball_url": "https://api.github.com/repos/SDM-TIB/SDM-RDFizer/zipball/v3.2"
      }
    ],
    "technique": "GitHub API"
  },
  "run": [
    {
      "confidence": [
        1
      ],
      "excerpt": "From PyPI (https://pypi.org/project/rdfizer/):\n```\npython3 -m pip install rdfizer\npython3 -m rdfizer -c /path/to/config/file\n```\n\nFrom Github/Docker:\nVisit the [wiki](https://github.com/SDM-TIB/SDM-RDFizer/wiki) of the repository to learn how to install and run the SDM-RDFizer. You can also take a look to our demo at: https://www.youtube.com/watch?v=DpH_57M1uOE\n- Install and run the SDM-RDFizer: https://github.com/SDM-TIB/SDM-RDFizer/wiki/Install&Run\n- Parameters to configure SDM-RDFizer: https://github.com/SDM-TIB/SDM-RDFizer/wiki/The-Parameters-of-the-Configuration-file\n- FAQ: https://github.com/SDM-TIB/SDM-RDFizer/wiki/FAQ\n\n",
      "technique": "Header extraction"
    }
  ],
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 57,
      "date": "Mon, 20 Dec 2021 14:15:26 GMT"
    },
    "technique": "GitHub API"
  },
  "topics": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "knowledge-graph",
      "rml",
      "data-integration"
    ],
    "technique": "GitHub API"
  },
  "usage": [
    {
      "confidence": [
        1
      ],
      "excerpt": "In version 4.0 of SDM-RDFizer, we have addressed the problem of efficiency in KG creation in terms of memory storage. SDM-RDFizer version4.0 includes a new module called \"TriplesMap Planning\" a.k.a. TMP which defines an optimized evaluation plan for the execution of triples maps. Additionally, version4.0 extends the previously included module (i.e. TriplesMap Execution a.k.a. TME) by introducing a new operator for compressing data stored in the data structures. These new features can be configured using two new parameters added to the configuration file, named \"large_file\" and \"ordered\". \n\nWe have performed extensive empirical evaluation on SDM-RDFizer version4.0 in terms of execution time and memory usage. The experiments are set up to empirically compare the impact of data duplicate rates, data size, and the complexity and the execution order of the triples maps on two versions of SDM-RDFizer (i.e. version4.0 and version3.6) and other exisiting engines icluding [RMLMapper v4.7](https://github.com/RMLio/rmlmapper-java) and [RocketRML](https://github.com/semantifyit/RocketRML) ), in terms of execution time and memory usage. The experiments are performed on two different benchmarks: \n- From [SDM-Genomic-datasets](https://figshare.com/articles/dataset/SDM-Genomic-Datasets/14838342/1), datasets including 10k, 100k, and 1M records with 25% and 75% duplicates rates, over six mapping rules with different complexities (1/4 simple object map, 2/5 object reference maps, 2/5 object join maps)\n- From [GTFS-Madrid](https://github.com/oeg-upm/gtfs-bench), datasets with scale values of 1-csv, 5-csv, 10-csv, and 50-csv, over two different mapping rules (72 simple object maps and 11 object join maps). \n\nThe results of explained experiments can be summarized as the following:\n![Overview of Results (Execution Time Comparison)](https://raw.githubusercontent.com/SDM-TIB/SDM-RDFizer/beta/images/time.png \"Execution Time Comparison\")\nAs observed in the figures above, both versions of SDM-RDFizer completed all the testbeds successfully while the other two engines have cases of timeout. SDM-RDFizer version3.6 and RocketRML version 1.7.0 are competitve in simple testbeds, however, SDM-RDFizer version4.0 shows the best performance in all the testbeds. \n![Overview of Results (Memory Consumption Comparison)](https://raw.githubusercontent.com/SDM-TIB/SDM-RDFizer/beta/images/memory.png \"Memory Consumption Comparison\")\nAs illustrated in the figures above, SDM-RDFizer version4.0 has the smallest peak in memory usage compared to the previous version of SDM-RDFizer.  \n\n\nThe results of the execution of SDM-RDFizer has been described in the following research reports:\n\n- Enrique Iglesias, Samaneh Jozashoori, David Chaves-Fraga, Diego Collarana, and Maria-Esther Vidal. 2020. SDM-RDFizer: An RML Interpreter for the Efficient Creation of RDF Knowledge Graphs. The 29th ACM International Conference on Information and Knowledge Management (CIKM ’20).\n\n- Samaneh Jozashoori, David Chaves-Fraga, Enrique Iglesias, Oscar Corcho, and Maria-Esther Vidal. 2020. FunMap: Efficient Execution of Functional Mappings for Knowledge Graph Creation. The 19th International Semantic Web Conference - Research Track (ISWC 2020).\n\n- Samaneh Jozashoori and Maria-Esther Vidal. MapSDI: A Scaled-up Semantic Data Integrationframework for Knowledge Graph Creation. The 27th International Conference on Cooperative Information Systems (CoopIS 2019). \n\n- David Chaves-Fraga, Kemele M. Endris, Enrique Iglesias, Oscar Corcho, and Maria-Esther Vidal. What are the Parameters that Affect the Construction of a Knowledge Graph?. The 18th International Conference on Ontologies, DataBases, and Applications of Semantics (ODBASE 2019).\n\n- David Chaves-Fraga, Antón Adolfo, Jhon Toledo, and Oscar Corcho. ONETT: Systematic Knowledge Graph Generation for National Access Points. The 1st International Workshop on Semantics for Transport co-located with SEMANTiCS 2019.\n\n- David Chaves-Fraga, Freddy Priyatna, Andrea Cimmino, Jhon Toledo, Edna Ruckhaus, and Oscar Corcho. GTFS-Madrid-Bench: A benchmark for virtual knowledge graph access in the transport domain. Journal of Web Semantics, 2020.\n\nAdditional References:\n\n- Dimou et al. 2014. Dimou, A., Sande, M.V., Colpaert, P., Verborgh, R., Mannens, E., de Walle, R.V.:RML: A generic language for integrated RDF mappings of heterogeneous data. In:Proceedings of the Workshop on Linked Data on the Web co-located with the 23rdInternational World Wide Web Conference (WWW 2014) \n\n",
      "technique": "Header extraction"
    }
  ]
}