{
  "acknowledgement": [
    {
      "confidence": [
        1
      ],
      "excerpt": "The development of table2qb was funded by Swirrl, by the UK Office for National Statistics and by the European Union’s Horizon 2020 research and innovation programme under grant agreement No 693849 (the [OpenGovIntelligence](http://opengovintelligence.eu) project).\n",
      "technique": "Header extraction"
    }
  ],
  "citation": [
    {
      "confidence": [
        0.9015781078351486,
        0.8460639637017997,
        0.9156566588472104
      ],
      "excerpt": "        org.apache.logging.log4j/log4j-api {:mvn/version \"2.11.0\"} \n        org.apache.logging.log4j/log4j-core {:mvn/version \"2.11.0\"} \n        org.apache.logging.log4j/log4j-slf4j-impl {:mvn/version \"2.11.0\"}} \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/Swirrl/table2qb",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2017-03-09T14:50:36Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-12-15T12:19:28Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.8955578187878495
      ],
      "excerpt": "Create statistical linked-data by deriving CSV-on-the-Web annotations for your data tables using the RDF Data Cube Vocabulary. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.861274470266678
      ],
      "excerpt": "Once you're happy with the results you can adjust the configuration to tailor the URI patterns to your heart's content. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9841928607522057,
        0.8828424936650523,
        0.9176831337714032,
        0.8778385805233596,
        0.8085298482164964,
        0.9316201397874616
      ],
      "excerpt": "codelists: a further set of tables that enumerate and describe the values used in cells of the observation table (what the standard calls codes, grouped into codelists) \nFor example, the ONS says that: \nIn mid-2019, the population of the UK reached an estimated 66.8 million \nThis is a single observation value (66.8 million) with two dimensions (date and place) which respectively have two code values (mid-2019 and UK), a single measure (population estimate), and implicitly an attribute for the unit (people). \nThe regional-trade example goes into more depth. The colour-coded spreadsheet should help illustrate how the three types of table come together to describe a cube. \nEach of these inputs is processed by it's own pipeline which will output CSVW - i.e. a processed version of the CSV table along with a JSON metadata annotation which describes the translation into RDF. Optionally you can also ask table2qb to perform the translation outputting RDF directly that can be loaded into a graph database and queried with SPARQL. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9580682598064175,
        0.8435830250618843
      ],
      "excerpt": "This configuration is designed to be used for multiple data cubes across a data collection (so that you can re-use e.g. a \"Year\" column without having to configure anew it each time) to encourage harmonisation and alignment of identifiers. \nUltimately table2qb provides a foundation to help you build a collection of interoperable statistical linked open data. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8466789378815763
      ],
      "excerpt": "Currently the latest is 0.3.0. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8781537312268528,
        0.9419481735248223
      ],
      "excerpt": "To get help on the available commands, type table2qb help. \nTo see the available pipelines (described in more detail below), type table2qb list. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9742650101469549,
        0.9112849282443505
      ],
      "excerpt": "More details about the clojure CLI and the format of the deps.edn file can be found on the Clojure website \nTable2qb is written in Clojure and can be built using Leiningen. It is recommended you use Java 8 or later. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "A generic pipeline for converting tabular data into rdf data cubes ",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/swirrl/table2qb/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 3,
      "date": "Mon, 20 Dec 2021 16:38:56 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/Swirrl/table2qb/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "Swirrl/table2qb",
    "technique": "GitHub API"
  },
  "hasScriptFile": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://raw.githubusercontent.com/swirrl/table2qb/master/demo.sh",
      "https://raw.githubusercontent.com/swirrl/table2qb/master/examples/customising-uris/generate_example.sh",
      "https://raw.githubusercontent.com/swirrl/table2qb/master/travis/configure_private_maven.sh",
      "https://raw.githubusercontent.com/swirrl/table2qb/master/travis/table2qb.sh",
      "https://raw.githubusercontent.com/swirrl/table2qb/master/travis/install_clojure.sh"
    ],
    "technique": "File Exploration"
  },
  "installation": [
    {
      "confidence": [
        0.9505548883608725
      ],
      "excerpt": "Download the release from https://github.com/Swirrl/table2qb/releases.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9570730918632907
      ],
      "excerpt": "Once downloaded, unzip.  The main 'table2qb' executable is in the directory ./target/table2qb-0.3.0 You can add this directory to your PATH environment variable, or just run it with the full file path on your system. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8994079601525311
      ],
      "excerpt": "{:deps {swirrl/table2qb {:git/url \"https://github.com/Swirrl/table2qb.git\" \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8037943696156415
      ],
      "excerpt": "        org.apache.logging.log4j/log4j-core {:mvn/version \"2.11.0\"} \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9532088804346436
      ],
      "excerpt": "You can then run table2qb using \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8513350103951788
      ],
      "excerpt": "table2qb can be run through leiningen with lein run e.g. \n",
      "technique": "Supervised classification"
    }
  ],
  "invocation": [
    {
      "confidence": [
        0.8149594712578615
      ],
      "excerpt": "Clojure now distributes clojure and cli command-line programs for running clojure programs. To run table2qb through the clojure command, first \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8028599182150346
      ],
      "excerpt": "  {:main-opts [\"-m\" \"table2qb.main\"]}}} \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/Swirrl/table2qb/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Clojure",
      "Shell"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "name": "Eclipse Public License 1.0",
      "url": "https://api.github.com/licenses/epl-1.0"
    },
    "technique": "GitHub API"
  },
  "licenseText": {
    "confidence": [
      1.0
    ],
    "excerpt": "b'THE ACCOMPANYING PROGRAM IS PROVIDED UNDER THE TERMS OF THIS ECLIPSE PUBLIC\\nLICENSE (\"AGREEMENT\"). ANY USE, REPRODUCTION OR DISTRIBUTION OF THE PROGRAM\\nCONSTITUTES RECIPIENT\\'S ACCEPTANCE OF THIS AGREEMENT.\\n\\n1. DEFINITIONS\\n\\n\"Contribution\" means:\\n\\na) in the case of the initial Contributor, the initial code and\\ndocumentation distributed under this Agreement, and\\n\\nb) in the case of each subsequent Contributor:\\n\\ni) changes to the Program, and\\n\\nii) additions to the Program;\\n\\nwhere such changes and/or additions to the Program originate from and are\\ndistributed by that particular Contributor. A Contribution \\'originates\\' from\\na Contributor if it was added to the Program by such Contributor itself or\\nanyone acting on such Contributor\\'s behalf. Contributions do not include\\nadditions to the Program which: (i) are separate modules of software\\ndistributed in conjunction with the Program under their own license\\nagreement, and (ii) are not derivative works of the Program.\\n\\n\"Contributor\" means any person or entity that distributes the Program.\\n\\n\"Licensed Patents\" mean patent claims licensable by a Contributor which are\\nnecessarily infringed by the use or sale of its Contribution alone or when\\ncombined with the Program.\\n\\n\"Program\" means the Contributions distributed in accordance with this\\nAgreement.\\n\\n\"Recipient\" means anyone who receives the Program under this Agreement,\\nincluding all Contributors.\\n\\n2. GRANT OF RIGHTS\\n\\na) Subject to the terms of this Agreement, each Contributor hereby grants\\nRecipient a non-exclusive, worldwide, royalty-free copyright license to\\nreproduce, prepare derivative works of, publicly display, publicly perform,\\ndistribute and sublicense the Contribution of such Contributor, if any, and\\nsuch derivative works, in source code and object code form.\\n\\nb) Subject to the terms of this Agreement, each Contributor hereby grants\\nRecipient a non-exclusive, worldwide, royalty-free patent license under\\nLicensed Patents to make, use, sell, offer to sell, import and otherwise\\ntransfer the Contribution of such Contributor, if any, in source code and\\nobject code form.  This patent license shall apply to the combination of the\\nContribution and the Program if, at the time the Contribution is added by the\\nContributor, such addition of the Contribution causes such combination to be\\ncovered by the Licensed Patents. The patent license shall not apply to any\\nother combinations which include the Contribution. No hardware per se is\\nlicensed hereunder.\\n\\nc) Recipient understands that although each Contributor grants the licenses\\nto its Contributions set forth herein, no assurances are provided by any\\nContributor that the Program does not infringe the patent or other\\nintellectual property rights of any other entity. Each Contributor disclaims\\nany liability to Recipient for claims brought by any other entity based on\\ninfringement of intellectual property rights or otherwise. As a condition to\\nexercising the rights and licenses granted hereunder, each Recipient hereby\\nassumes sole responsibility to secure any other intellectual property rights\\nneeded, if any. For example, if a third party patent license is required to\\nallow Recipient to distribute the Program, it is Recipient\\'s responsibility\\nto acquire that license before distributing the Program.\\n\\nd) Each Contributor represents that to its knowledge it has sufficient\\ncopyright rights in its Contribution, if any, to grant the copyright license\\nset forth in this Agreement.\\n\\n3. REQUIREMENTS\\n\\nA Contributor may choose to distribute the Program in object code form under\\nits own license agreement, provided that:\\n\\na) it complies with the terms and conditions of this Agreement; and\\n\\nb) its license agreement:\\n\\ni) effectively disclaims on behalf of all Contributors all warranties and\\nconditions, express and implied, including warranties or conditions of title\\nand non-infringement, and implied warranties or conditions of merchantability\\nand fitness for a particular purpose;\\n\\nii) effectively excludes on behalf of all Contributors all liability for\\ndamages, including direct, indirect, special, incidental and consequential\\ndamages, such as lost profits;\\n\\niii) states that any provisions which differ from this Agreement are offered\\nby that Contributor alone and not by any other party; and\\n\\niv) states that source code for the Program is available from such\\nContributor, and informs licensees how to obtain it in a reasonable manner on\\nor through a medium customarily used for software exchange.\\n\\nWhen the Program is made available in source code form:\\n\\na) it must be made available under this Agreement; and\\n\\nb) a copy of this Agreement must be included with each copy of the Program.\\n\\nContributors may not remove or alter any copyright notices contained within\\nthe Program.\\n\\nEach Contributor must identify itself as the originator of its Contribution,\\nif any, in a manner that reasonably allows subsequent Recipients to identify\\nthe originator of the Contribution.\\n\\n4. COMMERCIAL DISTRIBUTION\\n\\nCommercial distributors of software may accept certain responsibilities with\\nrespect to end users, business partners and the like. While this license is\\nintended to facilitate the commercial use of the Program, the Contributor who\\nincludes the Program in a commercial product offering should do so in a\\nmanner which does not create potential liability for other Contributors.\\nTherefore, if a Contributor includes the Program in a commercial product\\noffering, such Contributor (\"Commercial Contributor\") hereby agrees to defend\\nand indemnify every other Contributor (\"Indemnified Contributor\") against any\\nlosses, damages and costs (collectively \"Losses\") arising from claims,\\nlawsuits and other legal actions brought by a third party against the\\nIndemnified Contributor to the extent caused by the acts or omissions of such\\nCommercial Contributor in connection with its distribution of the Program in\\na commercial product offering.  The obligations in this section do not apply\\nto any claims or Losses relating to any actual or alleged intellectual\\nproperty infringement. In order to qualify, an Indemnified Contributor must:\\na) promptly notify the Commercial Contributor in writing of such claim, and\\nb) allow the Commercial Contributor to control, and cooperate with the\\nCommercial Contributor in, the defense and any related settlement\\nnegotiations. The Indemnified Contributor may participate in any such claim\\nat its own expense.\\n\\nFor example, a Contributor might include the Program in a commercial product\\noffering, Product X. That Contributor is then a Commercial Contributor. If\\nthat Commercial Contributor then makes performance claims, or offers\\nwarranties related to Product X, those performance claims and warranties are\\nsuch Commercial Contributor\\'s responsibility alone. Under this section, the\\nCommercial Contributor would have to defend claims against the other\\nContributors related to those performance claims and warranties, and if a\\ncourt requires any other Contributor to pay any damages as a result, the\\nCommercial Contributor must pay those damages.\\n\\n5. NO WARRANTY\\n\\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, THE PROGRAM IS PROVIDED ON\\nAN \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER\\nEXPRESS OR IMPLIED INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OR\\nCONDITIONS OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY OR FITNESS FOR A\\nPARTICULAR PURPOSE. Each Recipient is solely responsible for determining the\\nappropriateness of using and distributing the Program and assumes all risks\\nassociated with its exercise of rights under this Agreement , including but\\nnot limited to the risks and costs of program errors, compliance with\\napplicable laws, damage to or loss of data, programs or equipment, and\\nunavailability or interruption of operations.\\n\\n6. DISCLAIMER OF LIABILITY\\n\\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, NEITHER RECIPIENT NOR ANY\\nCONTRIBUTORS SHALL HAVE ANY LIABILITY FOR ANY DIRECT, INDIRECT, INCIDENTAL,\\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING WITHOUT LIMITATION\\nLOST PROFITS), HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\\nCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\\nARISING IN ANY WAY OUT OF THE USE OR DISTRIBUTION OF THE PROGRAM OR THE\\nEXERCISE OF ANY RIGHTS GRANTED HEREUNDER, EVEN IF ADVISED OF THE POSSIBILITY\\nOF SUCH DAMAGES.\\n\\n7. GENERAL\\n\\nIf any provision of this Agreement is invalid or unenforceable under\\napplicable law, it shall not affect the validity or enforceability of the\\nremainder of the terms of this Agreement, and without further action by the\\nparties hereto, such provision shall be reformed to the minimum extent\\nnecessary to make such provision valid and enforceable.\\n\\nIf Recipient institutes patent litigation against any entity (including a\\ncross-claim or counterclaim in a lawsuit) alleging that the Program itself\\n(excluding combinations of the Program with other software or hardware)\\ninfringes such Recipient\\'s patent(s), then such Recipient\\'s rights granted\\nunder Section 2(b) shall terminate as of the date such litigation is filed.\\n\\nAll Recipient\\'s rights under this Agreement shall terminate if it fails to\\ncomply with any of the material terms or conditions of this Agreement and\\ndoes not cure such failure in a reasonable period of time after becoming\\naware of such noncompliance. If all Recipient\\'s rights under this Agreement\\nterminate, Recipient agrees to cease use and distribution of the Program as\\nsoon as reasonably practicable. However, Recipient\\'s obligations under this\\nAgreement and any licenses granted by Recipient relating to the Program shall\\ncontinue and survive.\\n\\nEveryone is permitted to copy and distribute copies of this Agreement, but in\\norder to avoid inconsistency the Agreement is copyrighted and may only be\\nmodified in the following manner. The Agreement Steward reserves the right to\\npublish new versions (including revisions) of this Agreement from time to\\ntime. No one other than the Agreement Steward has the right to modify this\\nAgreement. The Eclipse Foundation is the initial Agreement Steward. The\\nEclipse Foundation may assign the responsibility to serve as the Agreement\\nSteward to a suitable separate entity. Each new version of the Agreement will\\nbe given a distinguishing version number. The Program (including\\nContributions) may always be distributed subject to the version of the\\nAgreement under which it was received. In addition, after a new version of\\nthe Agreement is published, Contributor may elect to distribute the Program\\n(including its Contributions) under the new version. Except as expressly\\nstated in Sections 2(a) and 2(b) above, Recipient receives no rights or\\nlicenses to the intellectual property of any Contributor under this\\nAgreement, whether expressly, by implication, estoppel or otherwise. All\\nrights in the Program not expressly granted under this Agreement are\\nreserved.\\n\\nThis Agreement is governed by the laws of the State of New York and the\\nintellectual property laws of the United States of America. No party to this\\nAgreement will bring a legal action under this Agreement more than one year\\nafter the cause of action arose. Each party waives its rights to a jury trial\\nin any resulting litigation.\\n'",
    "technique": "File Exploration"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "table2qb <img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Tesseract-1K.gif/240px-Tesseract-1K.gif\" align=\"right\" height=\"139\" alt=\"tesseract animation\"/>",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "table2qb",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "Swirrl",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "Organization",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/Swirrl/table2qb/blob/master/README.md",
    "technique": "GitHub API"
  },
  "releases": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      {
        "authorType": "User",
        "author_name": "travis-swirrl",
        "dateCreated": "2020-05-11T09:22:46Z",
        "datePublished": "2020-05-11T10:14:01Z",
        "html_url": "https://github.com/Swirrl/table2qb/releases/tag/0.3.3",
        "tag_name": "0.3.3",
        "tarball_url": "https://api.github.com/repos/Swirrl/table2qb/tarball/0.3.3",
        "url": "https://api.github.com/repos/Swirrl/table2qb/releases/26373235",
        "zipball_url": "https://api.github.com/repos/Swirrl/table2qb/zipball/0.3.3"
      },
      {
        "authorType": "User",
        "author_name": "travis-swirrl",
        "dateCreated": "2019-01-28T17:02:45Z",
        "datePublished": "2019-01-28T17:10:44Z",
        "html_url": "https://github.com/Swirrl/table2qb/releases/tag/0.3.2",
        "tag_name": "0.3.2",
        "tarball_url": "https://api.github.com/repos/Swirrl/table2qb/tarball/0.3.2",
        "url": "https://api.github.com/repos/Swirrl/table2qb/releases/15220988",
        "zipball_url": "https://api.github.com/repos/Swirrl/table2qb/zipball/0.3.2"
      },
      {
        "authorType": "User",
        "author_name": "travis-swirrl",
        "dateCreated": "2019-01-16T14:30:56Z",
        "datePublished": "2019-01-16T14:36:29Z",
        "html_url": "https://github.com/Swirrl/table2qb/releases/tag/0.3.1",
        "tag_name": "0.3.1",
        "tarball_url": "https://api.github.com/repos/Swirrl/table2qb/tarball/0.3.1",
        "url": "https://api.github.com/repos/Swirrl/table2qb/releases/15008323",
        "zipball_url": "https://api.github.com/repos/Swirrl/table2qb/zipball/0.3.1"
      },
      {
        "authorType": "User",
        "author_name": "travis-swirrl",
        "dateCreated": "2018-07-12T13:09:57Z",
        "datePublished": "2018-07-12T13:14:56Z",
        "html_url": "https://github.com/Swirrl/table2qb/releases/tag/0.3.0",
        "tag_name": "0.3.0",
        "tarball_url": "https://api.github.com/repos/Swirrl/table2qb/tarball/0.3.0",
        "url": "https://api.github.com/repos/Swirrl/table2qb/releases/11895823",
        "zipball_url": "https://api.github.com/repos/Swirrl/table2qb/zipball/0.3.0"
      }
    ],
    "technique": "GitHub API"
  },
  "run": [
    {
      "confidence": [
        1
      ],
      "excerpt": "See [using table2qb](doc/usage.md) for documentation on how to generate RDF data cubes using `table2qb`.\n\n",
      "technique": "Header extraction"
    }
  ],
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 8,
      "date": "Mon, 20 Dec 2021 16:38:56 GMT"
    },
    "technique": "GitHub API"
  },
  "topics": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "qb",
      "datacube",
      "rdf",
      "linked-data",
      "etl",
      "clojure",
      "csv",
      "csvw"
    ],
    "technique": "GitHub API"
  },
  "usage": [
    {
      "confidence": [
        1
      ],
      "excerpt": "The [./examples/employment](./examples/employment) directory provides an example of creating a data cube from scratch with `table2qb`.\n\n",
      "technique": "Header extraction"
    }
  ]
}