{
  "citation": [
    {
      "confidence": [
        1
      ],
      "excerpt": "SEPA stands for *SPARQL Event Processing Architecture*. SEPA is promoted and maintained by the [**Dynamic linked data and Web of Things Research Group**](https://site.unibo.it/wot/en) @ [**ARCES**](http://www.arces.unibo.it), the *Advanced Research Center on Electronic Systems \"Ercole De Castro\"* of the [**University of Bologna**](http://www.unibo.it).\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        0.9278824608274014,
        0.8028046190715653
      ],
      "excerpt": "<a href=\"https://asciinema.org/a/251211\"> \n  <img width=\"300px\" src=\"https://asciinema.org/a/251211.svg\"> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8840467439138965
      ],
      "excerpt": "Open Eclipse \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/arces-wot/SEPA",
    "technique": "GitHub API"
  },
  "contributingGuidelines": {
    "confidence": [
      1.0
    ],
    "excerpt": "How to contribute\nFirst of all thank you for contributing to SEPA, we really needs brave volunteers as you.🌟👍\nIf you haven't already, come find us on gitter (#sepa_dev/Lobby# on freenode). We want you working on things you're excited about.\nHere are some important resources:\n\nResearch Group tells you who we are and what we are doing\nHere you can read a more detailed description of Sparql Event Processing archietecture if you want to contribute to the platform you are invated to read it,\nProtocol specification is our vision on how to deliver SPARQL query events\nBugs? Github Issues is where to report them\nIf you want contact us feel free to send an email to @lroffia and @relu91\n\nTesting\nWe have developed a set of unit tests for basic functionalities of the engine. Before submit your contribution verify that they are \nsuccesful in your development enviroment. Use the following command:\nbash\nmaven test\nMoreover the complex interactions with the underlaying SPARQL endpoint are tested with a set of integration tests. To run them first\nyou need to have a running blazegraph instance in your localmachine and then use this following command inside the main folder of the project repository:\nbash\nmaven verify\nSubmitting changes\nPlease send a GitHub Pull Request to arces-wot/SEPA following the template and with a clear list of what you've done (read more about pull requests). \nWhen you send a pull request, we will love you forever if you also add tests that check your changes. \nWe can always use more test coverage. \nPlease make sure all commits are atomic (one feature per commit).\nAlways write a clear log message for your commits. One-line messages are fine for small changes, but bigger changes should look like this:\n$ git commit -m \"A brief summary of the commit\n&gt; \n&gt; A paragraph describing what changed and its impact.\"\n\nFuthermore, use the following commit convention:\n * Start the commit with Add if you added a feature\n * Start with Modify if you changed some behaviour of previous features\n * Start with Fix if your commit contain a fix of a bug\n * Follow the good practise guide for commit\nWe use as the base branch the dev, branch from there and add your changes. PR against master branch will be rejected, master branch is only used for releases.\nThanks,\nLuca and Cristiano 🙌",
    "technique": "File Exploration"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2017-05-31T10:36:01Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-12-10T12:23:12Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        1
      ],
      "excerpt": "SEPA (**S**PARQL **E**vent **P**rocessing **A**rchitecture) is a publish-subscribe architecture designed to support information level interoperability. The architecture is built on top of generic SPARQL endpoints (conformant with [SPARQL 1.1 protocol](https://www.w3.org/TR/sparql11-protocol/)) where publishers and subscribers use standard **SPARQL 1.1** [Updates](https://www.w3.org/TR/sparql11-update/) and [Queries](https://www.w3.org/TR/sparql11-query/). Notifications about events (i.e., changes in the **RDF** knowledge base) are expressed in terms of added and removed SPARQL binding results since the previous notification. To know more about SEPA architecture and vision please refer to this [paper](https://www.mdpi.com/1999-5903/10/4/36/htm). SEPA proposal has been formalized in the following *unofficial dratfs*:\n- [SPARQL Event Processing Architecture (SEPA)](http://mml.arces.unibo.it/TR/sepa.html) contribute [here](https://github.com/arces-wot/SEPADocs/blob/master/sepa.html)\n- [SPARQL 1.1 Secure Event Protocol](http://mml.arces.unibo.it/TR/sparql11-se-protocol.html) contribute [here](https://github.com/arces-wot/SEPADocs/blob/master/sparql11-se-protocol.html)\n- [SPARQL 1.1 Subscribe Language](http://mml.arces.unibo.it/TR/sparql11-subscribe.html) contribute [here](https://github.com/arces-wot/SEPADocs/blob/master/sparql11-subscribe.html)\n- [JSON SPARQL Application Profile (JSAP)](http://mml.arces.unibo.it/TR/jsap.html) contribute [here](https://github.com/arces-wot/SEPADocs/blob/master/jsap.html)\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        0.805465621743333
      ],
      "excerpt": "The default version of endpoint.jpar configures the engine to use use a local running instance of Blazegraph as SPARQL 1.1 Protocol Service. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8915199944549884
      ],
      "excerpt": "The default version of  engine.jpar configures the engine to listen for incoming SPARQL 1.1 SE Protocol requests at the following URLs: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9362255908189684
      ],
      "excerpt": "SEPA uses log4j2 by Apache. A default configuration is stored in the file log4j2.xml provided with the distribution. If the file resides in the engine folder, but it is not used, add the following JVM directive to force using it: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9188011721958642,
        0.8112116170505266
      ],
      "excerpt": "By default, the engine implements a simple in-memory OAuth 2.0 client-credential flow. It uses a JKS for storing the keys and certificates for SSL and JWT signing/verification. A default sepa.jks is provided including a single X.509 certificate (the password for both the store and the key is: sepa2017). If you face problems using the provided JKS, please delete the sepa.jks file and create a new one as follows: keytool -genkey -keyalg RSA -alias sepakey -keystore sepa.jks -storepass sepa2017 -validity 360 -keysize 2048 \nRun java -jar engine-x.y.z.jar -help for a list of options. The Java Keytool can be used to create, access and modify a JKS.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9409845069400835
      ],
      "excerpt": "- KEYCLOAK: authentication based on OpenID Connect in managed by Keycloak \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9250882100440692,
        0.9546595552710916,
        0.8776076383056337,
        0.8341942984516025
      ],
      "excerpt": "- tls is used when type=ldap to enable or not LDAP StartTLS \nThe SEPA engine is also distributed with a default JMX configuration jmx.properties (including the jmxremote.password and jmxremote.access files for password and user grants). Remember to change password file permissions using: chmod 600 jmxremote.password. To enable remote JMX, the engine must be run as follows: java -Dcom.sun.management.config.file=jmx.properties -jar engine-x.y.z.jar. Using jconsole is possible to monitor and control the most important engine parameters. By default, the port is 5555 and the root:root credentials grant full control (read/write). \nYou are very welcome to be part of SEPA community. If you find any bug feel free to open an issue here on GitHub, but also feel free to \nask any question. For more details check Contributing guidelines. Besides, if you want to help the SEPA development follow this simple steps: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8596689860365214
      ],
      "excerpt": "Push to the branch: git push origin my-new-feature \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8957077997240739,
        0.9323452094849559,
        0.8868217198914845
      ],
      "excerpt": "Pull request with unit tests have an higher likelihood to be accepted, but we are not to restrictive. So do not be afraid to send your contribution! \nThere is no particular restriction in your IDE choice. Here we provide a short guide to import the GitHub cloned project inside Eclipse. Any  \nother IDEs work fine.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9756583993745531,
        0.9248168246162135
      ],
      "excerpt": "The project is cloned. Enjoy! \nSEPA engine is a Maven project composed by two sub-projects: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8907162135135943
      ],
      "excerpt": "That create an executable inside the target directory. To know more about Maven please refer to the official documentation. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9762276857956423
      ],
      "excerpt": "The main differences beetween SEPA and Smart-M3 are the protocol (now compliant with the SPARQL 1.1 Protocol) and the introduction of a security layer (based on TLS and JSON Web Token for client authentication).  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "Get notifications about changes in your SPARQL endpoint. ",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/arces-wot/SEPA/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 10,
      "date": "Mon, 20 Dec 2021 11:38:26 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/arces-wot/SEPA/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "arces-wot/SEPA",
    "technique": "GitHub API"
  },
  "hasBuildFile": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://raw.githubusercontent.com/arces-wot/SEPA/master/Dockerfile"
    ],
    "technique": "File Exploration"
  },
  "installation": [
    {
      "confidence": [
        0.8057675898656085
      ],
      "excerpt": "    \"path\":\"/blazegraph/namespace/kb/sparql\", \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8057675898656085
      ],
      "excerpt": "    \"path\":\"/blazegraph/namespace/kb/sparql\", \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8626798667210626
      ],
      "excerpt": "    \"https\":8443, \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8306631968243474
      ],
      "excerpt": "- LDAP: it extends the default one by storing clients's information into an LDAP server (tested with Apache Directory) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8053056576774305
      ],
      "excerpt": "Do your stuff \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.803002524747455
      ],
      "excerpt": "Commit your changes: git commit -am 'Add some feature' \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.999833231880651
      ],
      "excerpt": "mvn install -DskipTests \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9205640437169769,
        0.999833231880651
      ],
      "excerpt": "Then you can build the engine with this command: \nmvn install \n",
      "technique": "Supervised classification"
    }
  ],
  "invocation": [
    {
      "confidence": [
        0.8606280910157142
      ],
      "excerpt": "Quick start \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8522611228488406
      ],
      "excerpt": "    \"format\":\"JSON\"}, \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8522611228488406
      ],
      "excerpt": "    \"format\":\"JSON\"}}} \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8594142235991984
      ],
      "excerpt": "   \"reliableUpdate\":true}, \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9458867842170642
      ],
      "excerpt": "File > Import > Maven \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/arces-wot/SEPA/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Java",
      "Dockerfile"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "licenseText": {
    "confidence": [
      1.0
    ],
    "excerpt": "b'                   GNU LESSER GENERAL PUBLIC LICENSE\\n                       Version 3, 29 June 2007\\n\\n Copyright (C) 2007 Free Software Foundation, Inc. http://fsf.org/\\n Everyone is permitted to copy and distribute verbatim copies\\n of this license document, but changing it is not allowed.\\n\\n\\n  This version of the GNU Lesser General Public License incorporates\\nthe terms and conditions of version 3 of the GNU General Public\\nLicense, supplemented by the additional permissions listed below.\\n\\n  0. Additional Definitions.\\n\\n  As used herein, \"this License\" refers to version 3 of the GNU Lesser\\nGeneral Public License, and the \"GNU GPL\" refers to version 3 of the GNU\\nGeneral Public License.\\n\\n  \"The Library\" refers to a covered work governed by this License,\\nother than an Application or a Combined Work as defined below.\\n\\n  An \"Application\" is any work that makes use of an interface provided\\nby the Library, but which is not otherwise based on the Library.\\nDefining a subclass of a class defined by the Library is deemed a mode\\nof using an interface provided by the Library.\\n\\n  A \"Combined Work\" is a work produced by combining or linking an\\nApplication with the Library.  The particular version of the Library\\nwith which the Combined Work was made is also called the \"Linked\\nVersion\".\\n\\n  The \"Minimal Corresponding Source\" for a Combined Work means the\\nCorresponding Source for the Combined Work, excluding any source code\\nfor portions of the Combined Work that, considered in isolation, are\\nbased on the Application, and not on the Linked Version.\\n\\n  The \"Corresponding Application Code\" for a Combined Work means the\\nobject code and/or source code for the Application, including any data\\nand utility programs needed for reproducing the Combined Work from the\\nApplication, but excluding the System Libraries of the Combined Work.\\n\\n  1. Exception to Section 3 of the GNU GPL.\\n\\n  You may convey a covered work under sections 3 and 4 of this License\\nwithout being bound by section 3 of the GNU GPL.\\n\\n  2. Conveying Modified Versions.\\n\\n  If you modify a copy of the Library, and, in your modifications, a\\nfacility refers to a function or data to be supplied by an Application\\nthat uses the facility (other than as an argument passed when the\\nfacility is invoked), then you may convey a copy of the modified\\nversion:\\n\\n   a) under this License, provided that you make a good faith effort to\\n   ensure that, in the event an Application does not supply the\\n   function or data, the facility still operates, and performs\\n   whatever part of its purpose remains meaningful, or\\n\\n   b) under the GNU GPL, with none of the additional permissions of\\n   this License applicable to that copy.\\n\\n  3. Object Code Incorporating Material from Library Header Files.\\n\\n  The object code form of an Application may incorporate material from\\na header file that is part of the Library.  You may convey such object\\ncode under terms of your choice, provided that, if the incorporated\\nmaterial is not limited to numerical parameters, data structure\\nlayouts and accessors, or small macros, inline functions and templates\\n(ten or fewer lines in length), you do both of the following:\\n\\n   a) Give prominent notice with each copy of the object code that the\\n   Library is used in it and that the Library and its use are\\n   covered by this License.\\n\\n   b) Accompany the object code with a copy of the GNU GPL and this license\\n   document.\\n\\n  4. Combined Works.\\n\\n  You may convey a Combined Work under terms of your choice that,\\ntaken together, effectively do not restrict modification of the\\nportions of the Library contained in the Combined Work and reverse\\nengineering for debugging such modifications, if you also do each of\\nthe following:\\n\\n   a) Give prominent notice with each copy of the Combined Work that\\n   the Library is used in it and that the Library and its use are\\n   covered by this License.\\n\\n   b) Accompany the Combined Work with a copy of the GNU GPL and this license\\n   document.\\n\\n   c) For a Combined Work that displays copyright notices during\\n   execution, include the copyright notice for the Library among\\n   these notices, as well as a reference directing the user to the\\n   copies of the GNU GPL and this license document.\\n\\n   d) Do one of the following:\\n\\n       0) Convey the Minimal Corresponding Source under the terms of this\\n       License, and the Corresponding Application Code in a form\\n       suitable for, and under terms that permit, the user to\\n       recombine or relink the Application with a modified version of\\n       the Linked Version to produce a modified Combined Work, in the\\n       manner specified by section 6 of the GNU GPL for conveying\\n       Corresponding Source.\\n\\n       1) Use a suitable shared library mechanism for linking with the\\n       Library.  A suitable mechanism is one that (a) uses at run time\\n       a copy of the Library already present on the user\\'s computer\\n       system, and (b) will operate properly with a modified version\\n       of the Library that is interface-compatible with the Linked\\n       Version.\\n\\n   e) Provide Installation Information, but only if you would otherwise\\n   be required to provide such information under section 6 of the\\n   GNU GPL, and only to the extent that such information is\\n   necessary to install and execute a modified version of the\\n   Combined Work produced by recombining or relinking the\\n   Application with a modified version of the Linked Version. (If\\n   you use option 4d0, the Installation Information must accompany\\n   the Minimal Corresponding Source and Corresponding Application\\n   Code. If you use option 4d1, you must provide the Installation\\n   Information in the manner specified by section 6 of the GNU GPL\\n   for conveying Corresponding Source.)\\n\\n  5. Combined Libraries.\\n\\n  You may place library facilities that are a work based on the\\nLibrary side by side in a single library together with other library\\nfacilities that are not Applications and are not covered by this\\nLicense, and convey such a combined library under terms of your\\nchoice, if you do both of the following:\\n\\n   a) Accompany the combined library with a copy of the same work based\\n   on the Library, uncombined with any other library facilities,\\n   conveyed under the terms of this License.\\n\\n   b) Give prominent notice with the combined library that part of it\\n   is a work based on the Library, and explaining where to find the\\n   accompanying uncombined form of the same work.\\n\\n  6. Revised Versions of the GNU Lesser General Public License.\\n\\n  The Free Software Foundation may publish revised and/or new versions\\nof the GNU Lesser General Public License from time to time. Such new\\nversions will be similar in spirit to the present version, but may\\ndiffer in detail to address new problems or concerns.\\n\\n  Each version is given a distinguishing version number. If the\\nLibrary as you received it specifies that a certain numbered version\\nof the GNU Lesser General Public License \"or any later version\"\\napplies to it, you have the option of following the terms and\\nconditions either of that published version or of any later version\\npublished by the Free Software Foundation. If the Library as you\\nreceived it does not specify a version number of the GNU Lesser\\nGeneral Public License, you may choose any version of the GNU Lesser\\nGeneral Public License ever published by the Free Software Foundation.\\n\\n  If the Library as you received it specifies that a proxy can decide\\nwhether future versions of the GNU Lesser General Public License shall\\napply, that proxy\\'s public statement of acceptance of any version is\\npermanent authorization for you to choose that version for the\\nLibrary.\\n'",
    "technique": "File Exploration"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "\">",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "SEPA",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "arces-wot",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "Organization",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/arces-wot/SEPA/blob/master/README.md",
    "technique": "GitHub API"
  },
  "releases": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      {
        "authorType": "User",
        "author_name": "relu91",
        "body": "",
        "dateCreated": "2020-07-13T16:43:35Z",
        "datePublished": "2020-07-13T16:49:34Z",
        "html_url": "https://github.com/arces-wot/SEPA/releases/tag/v0.9.12",
        "name": "e-Radicate",
        "tag_name": "v0.9.12",
        "tarball_url": "https://api.github.com/repos/arces-wot/SEPA/tarball/v0.9.12",
        "url": "https://api.github.com/repos/arces-wot/SEPA/releases/28510741",
        "zipball_url": "https://api.github.com/repos/arces-wot/SEPA/zipball/v0.9.12"
      },
      {
        "authorType": "User",
        "author_name": "lroffia",
        "body": "Fixed alias in error message on subscriptions",
        "dateCreated": "2019-01-10T14:17:37Z",
        "datePublished": "2019-01-10T14:24:56Z",
        "html_url": "https://github.com/arces-wot/SEPA/releases/tag/0.9.7",
        "name": "0.9.7: Snow ball",
        "tag_name": "0.9.7",
        "tarball_url": "https://api.github.com/repos/arces-wot/SEPA/tarball/0.9.7",
        "url": "https://api.github.com/repos/arces-wot/SEPA/releases/14904991",
        "zipball_url": "https://api.github.com/repos/arces-wot/SEPA/zipball/0.9.7"
      },
      {
        "authorType": "User",
        "author_name": "relu91",
        "dateCreated": "2018-10-15T08:34:00Z",
        "datePublished": "2018-10-15T08:47:57Z",
        "html_url": "https://github.com/arces-wot/SEPA/releases/tag/0.9.6",
        "tag_name": "0.9.6",
        "tarball_url": "https://api.github.com/repos/arces-wot/SEPA/tarball/0.9.6",
        "url": "https://api.github.com/repos/arces-wot/SEPA/releases/13421692",
        "zipball_url": "https://api.github.com/repos/arces-wot/SEPA/zipball/0.9.6"
      },
      {
        "authorType": "User",
        "author_name": "relu91",
        "dateCreated": "2018-09-29T10:08:18Z",
        "datePublished": "2018-09-29T10:23:27Z",
        "html_url": "https://github.com/arces-wot/SEPA/releases/tag/v0.9.5",
        "tag_name": "v0.9.5",
        "tarball_url": "https://api.github.com/repos/arces-wot/SEPA/tarball/v0.9.5",
        "url": "https://api.github.com/repos/arces-wot/SEPA/releases/13163073",
        "zipball_url": "https://api.github.com/repos/arces-wot/SEPA/zipball/v0.9.5"
      },
      {
        "authorType": "User",
        "author_name": "relu91",
        "dateCreated": "2018-05-03T11:25:51Z",
        "datePublished": "2018-05-03T11:33:13Z",
        "html_url": "https://github.com/arces-wot/SEPA/releases/tag/v0.9.1",
        "tag_name": "v0.9.1",
        "tarball_url": "https://api.github.com/repos/arces-wot/SEPA/tarball/v0.9.1",
        "url": "https://api.github.com/repos/arces-wot/SEPA/releases/10831119",
        "zipball_url": "https://api.github.com/repos/arces-wot/SEPA/zipball/v0.9.1"
      },
      {
        "authorType": "User",
        "author_name": "relu91",
        "dateCreated": "2018-04-26T09:03:54Z",
        "datePublished": "2018-04-26T09:11:51Z",
        "html_url": "https://github.com/arces-wot/SEPA/releases/tag/v0.9.0",
        "tag_name": "v0.9.0",
        "tarball_url": "https://api.github.com/repos/arces-wot/SEPA/tarball/v0.9.0",
        "url": "https://api.github.com/repos/arces-wot/SEPA/releases/10730731",
        "zipball_url": "https://api.github.com/repos/arces-wot/SEPA/zipball/v0.9.0"
      },
      {
        "authorType": "User",
        "author_name": "relu91",
        "dateCreated": "2018-04-10T16:27:17Z",
        "datePublished": "2018-04-10T16:36:14Z",
        "html_url": "https://github.com/arces-wot/SEPA/releases/tag/0.8.4",
        "tag_name": "0.8.4",
        "tarball_url": "https://api.github.com/repos/arces-wot/SEPA/tarball/0.8.4",
        "url": "https://api.github.com/repos/arces-wot/SEPA/releases/10479868",
        "zipball_url": "https://api.github.com/repos/arces-wot/SEPA/zipball/0.8.4"
      },
      {
        "authorType": "User",
        "author_name": "relu91",
        "dateCreated": "2018-04-10T10:21:25Z",
        "datePublished": "2018-04-10T10:28:25Z",
        "html_url": "https://github.com/arces-wot/SEPA/releases/tag/v0.8.3",
        "tag_name": "v0.8.3",
        "tarball_url": "https://api.github.com/repos/arces-wot/SEPA/tarball/v0.8.3",
        "url": "https://api.github.com/repos/arces-wot/SEPA/releases/10472782",
        "zipball_url": "https://api.github.com/repos/arces-wot/SEPA/zipball/v0.8.3"
      },
      {
        "authorType": "User",
        "author_name": "relu91",
        "body": "First public release of SEPA.",
        "dateCreated": "2017-06-20T18:35:54Z",
        "datePublished": "2017-06-07T14:43:49Z",
        "html_url": "https://github.com/arces-wot/SEPA/releases/tag/0.7.5",
        "name": "SEPA",
        "tag_name": "0.7.5",
        "tarball_url": "https://api.github.com/repos/arces-wot/SEPA/tarball/0.7.5",
        "url": "https://api.github.com/repos/arces-wot/SEPA/releases/6633958",
        "zipball_url": "https://api.github.com/repos/arces-wot/SEPA/zipball/0.7.5"
      }
    ],
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 21,
      "date": "Mon, 20 Dec 2021 11:38:26 GMT"
    },
    "technique": "GitHub API"
  },
  "topics": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "java",
      "semantic-web",
      "sparql",
      "sparql-endpoints",
      "sparql-query",
      "rdf",
      "rdf-store",
      "rdf-triples",
      "internet-of-things",
      "web-of-things",
      "interoperability",
      "publish-subscribe",
      "events",
      "push-notifications"
    ],
    "technique": "GitHub API"
  },
  "usage": [
    {
      "confidence": [
        1
      ],
      "excerpt": "![Demo showing subscription and notifications](./doc/SEPADemo.gif)\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        1
      ],
      "excerpt": "- Download the [SEPA Engine](https://github.com/arces-wot/SEPA/releases/latest) and run it: `java -jar engine-x.y.z.jar`\n\n- Download [Blazegraph](https://sourceforge.net/projects/bigdata/files/latest/download) (or use any other SPARQL 1.1 Protocol compliant service) and run it as shown [here](https://wiki.blazegraph.com/wiki/index.php/Quick_Start) \n\n- Use the [SEPA Playground](http://mml.arces.unibo.it/apps/dashboard?mode=local) to check basic functionalities of the engine.\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        1
      ],
      "excerpt": "The SEPA engine can be configured from the command line. Run `java -jar engine-x.y.z.jar -help` for the list of available settings.\n\n`java [JMX] [JVM] [LOG4J] -jar SEPAEngine_X.Y.Z.jar [-help] [-secure=true] [-engine=engine.jpar] [-endpoint=endpoint.jpar] [JKS OPTIONS] [LDAP OPTIONS] [ISQL OPTIONS]`\n\n- `secure` : overwrite the current secure option of engine.jpar\n- `engine` : can be used to specify the JSON configuration parameters for the engine (default: engine.jpar)\n- `endpoint` : can be used to specify the JSON configuration parameters for the endpoint (default: endpoint.jpar)\n- `help` : to print this help\n\n[JMX]\n- `Dcom.sun.management.config.file=jmx.properties` : to enable JMX remote managment\n\n[JVM]\n- `XX:+UseG1GC`\n\n[LOG4J]\n- `Dlog4j.configurationFile=path/to/log4j2.xml`\n\n[JKS OPTIONS]\n- `sslstore` <jks> : JKS for SSL CA      \t\t\t(default: ssl.jks)\n- `sslpass` <pwd> : password of the JKS        \t(default: sepastore)\n- `jwtstore` <jks> : JKS for the JWT key       \t(default: jwt.jks)\n- `jwtalias` <alias> : alias for the JWT key   \t(default: jwt)\n- `jwtstorepass` <pwd> : password for the JKS  \t(default: sepakey)\n- `jwtaliaspass` <pwd> : password for the JWT key  (default: sepakey)\n\t\t\n[LDAP OPTIONS]\n- `ldaphost` <name> : host     \t\t         (default: localhost)\n- `ldapport` <port> : port                      (default: 10389)\n- `ldapdn` <dn> : domain                        (default: dc=sepatest,dc=com)\n- `ldapusersdn` <dn> : domain                   (default: null)\n- `ldapuser` <usr> : username                   (default: null)\n- `ldappwd` <pwd> : password                    (default: null)\n\t\t\n[ISQL OPTIONS]\n- `isqlpath` <path> : location of isql     \t\t (default: /usr/local/virtuoso-opensource/bin/)\n- `isqlhost` <host> : host of Virtuoso     \t\t (default: localhost)\n- `isqluser` <user> : user of Virtuoso     \t\t (default: dba)\n- `isqlpass` <pass> : password of Virtuoso     \t (default: dba)\n\n",
      "technique": "Header extraction"
    }
  ]
}