{
  "citation": [
    {
      "confidence": [
        0.8955886365383559
      ],
      "excerpt": "Knowledge Engineering \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9913915028633412
      ],
      "excerpt": "AceMap - Academic search engine based on knowledge graph which includes entities like paper, author, institution and etc.  \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/totogo/awesome-knowledge-graph",
    "technique": "GitHub API"
  },
  "contributingGuidelines": {
    "confidence": [
      1.0
    ],
    "excerpt": "Contribution Guidelines\nPlease note that this project is released with a\nContributor Code of Conduct. By participating in this\nproject you agree to abide by its terms.\n\nEnsure your pull request adheres to the following guidelines:\n\nMake sure you take care of this\nAnd this as well\nAnd don't forget to check this\n\nThank you for your suggestions!\nUpdating your PR\nA lot of times, making a PR adhere to the standards above can be difficult.\nIf the maintainers notice anything that we'd like changed, we'll ask you to\nedit your PR before we merge it. There's no need to open a new PR, just edit\nthe existing one. If you're not sure how to do that,\nhere is a guide\non the different ways you can update your PR so that we can merge it.",
    "technique": "File Exploration"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2019-02-03T09:25:08Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-12-17T11:00:41Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9874839473590004
      ],
      "excerpt": "A curated list of Knowledge Graph related learning materials, databases, tools and other resources \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8174702397147521
      ],
      "excerpt": "Graph Visualization \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9708446042310134
      ],
      "excerpt": "AgensGraph - multi-model graph database with SQL and Cypher support based on PostgreSQL \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9326048678617566
      ],
      "excerpt": "Atomic-Server - open-source type-safe graph database server with GUI, written in rust. Supports Atomic Data, JSON & RDF. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9467533422995333
      ],
      "excerpt": "CosmosDB - cloud-based multi-model database with support for TinkerPop3 \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.900264481364309
      ],
      "excerpt": "DSE Graph - Graph layer on top of DataStax Enterprise (Cassandra, SolR, Spark) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9592335660606802,
        0.8843907300449109,
        0.8245255721309228
      ],
      "excerpt": "Graphd - the Metaweb/Freebase Graph Repository \nJanusGraph - an open-source, distributed graph database with pluggable storage and indexing backends \nMemgraph - High Performance, In-Memory, Transactional Graph Database \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.989689421430576,
        0.9420862155249544,
        0.8587009595127033,
        0.9095588445150289,
        0.8991131306480804,
        0.9803891580789815,
        0.9823344392080223,
        0.9767914284113651,
        0.8704954706617103,
        0.996649685825873
      ],
      "excerpt": "Sparksee - makes space and performance compatible with a small footprint and a fast analysis of large networks \nStardog - RDF graph database with OLTP and OLAP support \nOrientDB - Distributed Multi-Model NoSQL Database with a Graph Database Engine \nTigerGraph - a complete, distributed, parallel graph computing platform for enterprise, supporting web-scale data analytics in real-time.  \nNebula Graph - A truly distributed, linear scalable, lightning-fast graph database, using SQL-like query language.  \nHugeGraph - An open source TinkerPop 3 compliant OLTP Graph Database with pluggable storage bakcend which is similar to JanusGraph. It also supports OLAP through Spark GraphX.  \nDiffbot - One of three Western entities to crawl a majority of the web. Largest commercially available knowledge graph. \nAllegroGraph - high-performance, persistent graph database that scales to billions of quads \nApache Jena - open source Java framework for building Semantic Web and Linked Data applications \nEclipse RDF4J - (formerly known as Sesame) is an open source Java framework for processing RDF data. This includes parsing, storing, inferencing and querying of/over such data. It offers an easy-to-use API that can be connected to all leading RDF storage solutions. It allows you to connect with SPARQL endpoints and create applications that leverage the power of linked data and Semantic Web. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.899863109940905,
        0.906416196073456,
        0.9878568746839005,
        0.9058041619314767
      ],
      "excerpt": "Virtuoso - a \"Data Junction Box\" that drives enterprise and individual agility by deriving a Semantic Web of Linked Data from existing data silos \nHoply - explore bigger than RAM relational data in the comfort of Python. \nApache Marmotta - (retired Apache project) an open platform for linked data. \nApache Giraph - an iterative graph processing system built for high scalability \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8422276540979308,
        0.9267616849757824,
        0.8986762602379095,
        0.8501228419647535,
        0.9719191378009678,
        0.8404177411124033,
        0.9313763545655369
      ],
      "excerpt": "Tencent Plato - a fast distributed graph computation and machine learning framework used by WeChat. \nAntV G6 - Simple, easy and complete high performance graph visualization engine written in JavaScript, from Ant Financial \nGephi - Graph visualization platform software runs on Windows, Mac and Linux. \nKeyLines & ReGraph - Graph visualization tookits for JavaScript and React developer from Cambridge Intelligence. \nLinkurious - Linkurious is an enterprise ready on-premises graph visualization and analysis platform. \nCytoscape - Open source graph visualization platform software runs on Windows, Mac and Linux. \nCytoscape.js - Graph visualization tookit for JavaScript. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9981275065171834,
        0.957589118119725
      ],
      "excerpt": "GraphQL+- - The query language of Dgraph, which is based on Facebook's GraphQL \nGQL - An initiative to create a standard query language for property graph database, just like SQL for relational database. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8744693578753943,
        0.8895669072141269
      ],
      "excerpt": "JanusGraph @ Google Cloud Platform - JanusGraph on Google Kubernetes Engine backed by Google Cloud Bigtable \nJanusGraph @ Amazon Web Services Labs - The Amazon DynamoDB Storage Backend for JanusGraph \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9820247532270946,
        0.9076634918149233,
        0.8726205036248561,
        0.9548426847134697,
        0.9060874373811895,
        0.9288733614575118
      ],
      "excerpt": "Neo4j @ Graph Story - End-to-end Graph Database hosting for Community and Enterprise Neo4j with expert help for development \nNeptune @ Amazon Web Services - a fast, reliable, fully-managed graph database service that makes it easy to build and run applications that work with highly connected datasets \nGraph Engine Service @ Huawei Cloud - Fully-managed, distributed, at-scale graph query and analysis service that provides a visualized interactive analytics platform. \nGraph Database (beta) @ Aliyun (Alibaba Cloud) - highly reliable and available property graph database that supports ACID and TinkerPop Gremlin query language.  \nTencent Knowledge Graph @ Tencent Cloud - One stop platform for Graph database, computing and visualization. Currently available in beta test and only in Chinese.  \nWoordLift - Easy-to-use SEO-focused Graph Database hosting for web and e-commerce websites running on Apache Marmotta.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8308951787352227,
        0.9612500932274917,
        0.8318035210073479,
        0.9874040021116901,
        0.9952185025664267,
        0.9416290396167435
      ],
      "excerpt": "YAGA-NAGA - Harvesting, Searching, and Ranking Knowledge from the Web \nDedupe - dedupe is a python library that uses machine learning to perform fuzzy matching, deduplication and entity resolution quickly on structured data. \nLIMES - Link Discovery Framework for Metric Spaces. \nBabelNet - Both a multilingual encyclopedic dictionary, with lexicographic and encyclopedic coverage of terms, and a semantic network which connects concepts and named entities in a very large network of semantic relations, made up of about 16 million entries, called Babel synsets. Each Babel synset represents a given meaning and contains all the synonyms which express that meaning in a range of different languages. \nWikidata - Wikidata is a free, collaborative, multilingual, secondary database, collecting structured data to provide support for Wikipedia, Wikimedia Commons, the other wikis of the Wikimedia movement, and to anyone in the world. \nGoogle Knowledge Graph - Google’s Knowledge Graph has millions of entries that describe real-world entities like people, places, and things. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8624277503744678,
        0.9808546456254361,
        0.9815382491172597,
        0.8962300766843009,
        0.9379641618235594
      ],
      "excerpt": "XLore - A large-scale English-Chinese bilingual knowledge graph by structuring and integrating Chinese Wikipedia, English Wikipedia, French Wikipedia, and Baidu Baike.  \nThe GDELT Project - The GDELT Project monitors the world's broadcast, print, and web news from nearly every corner of every country in over 100 languages and identifies the people, locations, organizations, themes, sources, emotions, counts, quotes, images and events driving our global society  every second of every day, creating a free open platform for computing on the entire world. \nYAGO - A huge semantic knowledge base, derived from Wikipedia,  WordNet and GeoNames. Currently, YAGO has knowledge of more than 10 million entities (like persons, organizations, cities, etc.) and contains more than 120 million facts about these entities. The source code of YAGO is in this Github repo.  \nZhishi.me - Knowledge Graph data extracted from the largest Chinese encyclopedias,  Baidu Baike, Hudong Baike and Chinese Wikipedia. \nConceptNet - ConceptNet is a freely-available semantic network, designed to help computers understand the meanings of words that people use. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8985437870449773,
        0.8873698947099933,
        0.8979159493340015,
        0.835252720689482
      ],
      "excerpt": "OpenHowNet - An Open Sememe-based Lexical Knowledge Base in Chinese. \nWordNet - A free large lexical database of English from Princeton University. \nAMiner - Aminer aims to provide comprehensive search and mining services for researcher social networks. \nMicrosoft Academic - Microsoft Academic (MA) employs advances in machine learning, semantic inference and knowledge discovery to help you explore scholarly information in more powerful ways than ever before. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9051938893302267,
        0.987184910203558,
        0.8193772180380872
      ],
      "excerpt": "Semantic Scholar - A free, AI-powered research tool for scientific literature. Collaborating with academic publishers to build a trustworthy and authoritative scientific knowledge graph. \nLynx - an ecosystem of smart cloud services to better manage compliance, based on a Legal Knowledge Graph (LKG) which integrates and links heterogeneous compliance data sources including legislation, case law, standards and other private contracts. \nGraph Book - TinkerPop3 centric book written by Kelvin R. Lawrence \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8217332654017729,
        0.8120382291657343
      ],
      "excerpt": "The Gremlin Compendium - minimum survival kit for any Gremlin user, 10 blog post series by Doan DuyHai \nGraph Connect - powered by Neo4j \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8295396932870923
      ],
      "excerpt": "Connected Data London - Connected Data London brings together 160+ Artificial Intelligence, Semantic Technology, Linked Data and Graph Database innovators, thought leaders and practitioners annually in one great conference. The conference has expanded its themes and tracks, from its roots as the primary conference for Knowledge Graphs, Linked Data and Semantics to include related Graph Database and AI / Machine Learning technologies and practical use cases. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "A curated list of Knowledge Graph related learning materials, databases, tools and other resources",
      "technique": "GitHub API"
    }
  ],
  "documentation": [
    {
      "confidence": [
        1
      ],
      "excerpt": "* [Cypher](https://neo4j.com/developer/cypher-query-language/) - reference documentation\n* [Gremlin](http://tinkerpop.apache.org/docs/current/reference/#traversal) - reference documentation\n\n",
      "technique": "Header extraction"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/totogo/awesome-knowledge-graph/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 72,
      "date": "Mon, 20 Dec 2021 21:37:44 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/totogo/awesome-knowledge-graph/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "totogo/awesome-knowledge-graph",
    "technique": "GitHub API"
  },
  "installation": [
    {
      "confidence": [
        0.8801427778012364
      ],
      "excerpt": "Blazegraph - GPU accelerated graph database \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/totogo/awesome-knowledge-graph/issues{/number}",
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Awesome Knowledge Graph",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "awesome-knowledge-graph",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "totogo",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/totogo/awesome-knowledge-graph/blob/master/readme.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 590,
      "date": "Mon, 20 Dec 2021 21:37:44 GMT"
    },
    "technique": "GitHub API"
  },
  "topics": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "awesome-list",
      "knowledge-graph",
      "graph",
      "nlp",
      "graph-database"
    ],
    "technique": "GitHub API"
  }
}