{
  "arxivLinks": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://arxiv.org/abs/1607.01759\">Bag of Tricks for Efficient Text Classification</a>\n\nafter embed each word in the sentence, this word representations are then averaged into a text representation, which is in turn fed to a linear classifier.it use softmax function to compute the probability distribution over the predefined classes. then cross entropy is used to compute loss. bag of word representation does not consider word order. in order to take account of word order, n-gram features is used to capture some partial information about the local word order; when the number of classes is large, computing the linear classifier is computational expensive. so it usehierarchical softmax to speed training process.\n1",
      "https://arxiv.org/abs/1510.03820\">A Sensitivity Analysis of (and Practitioners' Guide to",
      "https://arxiv.org/abs/1810.04805'>BERT:Pre-training of Deep Bidirectional Transformers for Language Understanding</a>\n\n13.<a href='https://github.com/google-research/bert'>google-research/bert</a>\n\n-------------------------------------------------------------------------\n\nto be continued. for any problem, concat brightmart@hotmail.com"
    ],
    "technique": "Regular expression"
  },
  "citation": [
    {
      "confidence": [
        1
      ],
      "excerpt": "       \n       competition, and apply it with what you've learned. \n       \nUse Your Own Data:\n-------------------------------------------------------------------------------------------------------\nreplace data in 'data/sample_multiple_label.txt', and make sure format as below:\n\n'word1 word2 word3 __label__l1 __label__l2 __label__l3'\n \nwhere part1: 'word1 word2 word3' is input(X), part2: '__label__l1 __label__l2 __label__l3' \n\nrepresenting there are three labels: [l1,l2,l3]. between part1 and part2 there should be a empty string: ' '.\n\nfor example: each line (multiple labels) like: \n\n'w5466 w138990 w1638 w4301 w6 w470 w202 c1834 c1400 c134 c57 c73 c699 c317 c184 __label__5626661657638885119 __label__4921793805334628695 __label__8904735555009151318'\n\nwhere '5626661657638885119','4921793805334628695'，‘8904735555009151318’ are three labels associate with this input string 'w5466 w138990...c699 c317 c184'\n\nNotice:\n\n\nSome util function is in data_util.py;  check load_data_multilabel() of data_util for how process input and labels from raw data.\n\nthere is a function to load and assign pretrained word embedding to the model,where word embedding is pretrained in word2vec or fastText. \n\nPretrain Work Embedding:\n-------------------------------------------------------------------------------------------------------\nif word2vec.load not works, you may load pretrained word embedding, especially for chinese word embedding use following lines:\n\nimport gensim\n\nfrom gensim.models import KeyedVectors\n\nword2vec_model = KeyedVectors.load_word2vec_format(word2vec_model_path, binary=True, unicode_errors='ignore')  #\n\nor you can turn off use pretrain word embedding flag to false to disable loading word embedding.\n\n\nModels Detail:\n-------------------------------------------------------------------------\n\n1.fastText:  \n-------------\nimplmentation of <a href=\"https://arxiv.org/abs/1607.01759\">Bag of Tricks for Efficient Text Classification</a>\n\nafter embed each word in the sentence, this word representations are then averaged into a text representation, which is in turn fed to a linear classifier.it use softmax function to compute the probability distribution over the predefined classes. then cross entropy is used to compute loss. bag of word representation does not consider word order. in order to take account of word order, n-gram features is used to capture some partial information about the local word order; when the number of classes is large, computing the linear classifier is computational expensive. so it usehierarchical softmax to speed training process.\n1) use bi-gram and/or tri-gram\n2) use NCE loss to speed us softmax computation(not use hierarchy softmax as original paper)\n\nresult: performance is as good as paper, speed also very fast.\n\ncheck: p5_fastTextB_model.py\n\n![alt text](https://github.com/brightmart/text_classification/blob/master/images/fastText.JPG)\n-------------------------------------------------------------------------\n\n2.TextCNN:\n-------------\nImplementation of <a href=\"http://www.aclweb.org/anthology/D14-1181\"> Convolutional Neural Networks for Sentence Classification </a>\n\nStructure:embedding--->conv--->max pooling--->fully connected layer-------->softmax\n\nCheck: p7_TextCNN_model.py\n\nIn order to get very good result with TextCNN, you also need to read carefully about this paper <a href=\"https://arxiv.org/abs/1510.03820\">A Sensitivity Analysis of (and Practitioners' Guide to) Convolutional Neural Networks for Sentence Classification</a>: it give you some insights of things that can affect performance. although you need to  change some settings according to your specific task.\n\nConvolutional Neural Network is main building box for solve problems of computer vision. Now we will show how CNN can be used for NLP, in in particular, text classification. Sentence length will be different from one to another. So we will use pad to get fixed length, n. For each token in the sentence, we will use word embedding to get a fixed dimension vector, d. So our input is a 2-dimension matrix:(n,d). This is similar with image for CNN. \n\nFirstly, we will do convolutional operation to our input. It is a element-wise multiply between filter and part of input. We use k number of filters, each filter size is a 2-dimension matrix (f,d). Now the output will be k number of lists. Each list has a length of n-f+1. each element is a scalar. Notice that the second dimension will be always the dimension of word embedding. We are using different size of filters to get rich features from text inputs. And this is something similar with n-gram features. \n\nSecondly, we will do max pooling for the output of convolutional operation. For k number of lists, we will get k number of scalars. \n\nThirdly, we will concatenate scalars to form final features. It is a fixed-size vector. And it is independent from the size of filters we use.\n\nFinally, we will use linear layer to project these features to per-defined labels.\n\n![alt text](https://github.com/brightmart/text_classification/blob/master/images/TextCNN.JPG)\n\n-------------------------------------------------------------------------\n\n\n3.BERT: \n-------------------------------------------------------------------------\n",
      "technique": "Header extraction"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/brightmart/text_classification",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2017-05-30T14:25:42Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-12-23T06:10:07Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        1
      ],
      "excerpt": "it has all kinds of baseline models for text classification.\n\nit also support for multi-label classification where multi labels associate with an sentence or document.\n\nalthough many of these models are simple, and may not get you to top level of the task. but some of these models are very \n\nclassic, so they may be good to serve as baseline models. each model has a test function under model class. you can run \n\nit to performance toy task first. the model is independent from data set.\n\n<a href='https://github.com/brightmart/text_classification/blob/master/multi-label-classification.pdf'>check here for formal report of large scale multi-label text classification with deep learning</a>\n\nseveral models here can also be used for modelling question answering (with or without context), or to do sequences generating. \n\nwe explore two seq2seq model(seq2seq with attention,transformer-attention is all you need) to do text classification. \n\nand these two models can also be used for sequences generating and other tasks. if your task is a multi-label classification, \n\nyou can cast the problem to sequences generating.\n\nwe implement two memory network. one is dynamic memory network. previously it reached state of art in question \n\nanswering, sentiment analysis and sequence generating tasks. it is so called one model to do several different tasks, \n\nand reach high performance. it has four modules. the key component is episodic memory module. it use gate mechanism to \n\nperformance attention, and use gated-gru to update episode memory, then it has another gru( in a vertical direction) to \n\nperformance hidden state update. it has ability to do transitive inference.\n\nthe second memory network we implemented is recurrent entity network: tracking state of the world. it has blocks of \n\nkey-value pairs as memory, run in parallel, which achieve new state of art. it can be used for modelling question \n\nanswering with contexts(or history). for example, you can let the model to read some sentences(as context), and ask a \n\nquestion(as query), then ask the model to predict an answer; if you feed story same as query, then it can do \n\nclassification task. \n\nTo discuss ML/DL/NLP problems and get tech support from each other, you can join QQ group: 836811304\n\nModels:\n-------------------------------------------------------------------------\n\n1) fastText\n2) TextCNN \n3) Bert:Pre-training of Deep Bidirectional Transformers for Language Understanding  \n4) TextRNN    \n5) RCNN     \n6) Hierarchical Attention Network    \n7) seq2seq with attention   \n8) Transformer(\"Attend Is All You Need\")\n9) Dynamic Memory Network\n10) EntityNetwork:tracking state of the world\n11) Ensemble models\n12) Boosting: \n\n    for a single model, stack identical models together. each layer is a model. the result will be based on logits added together. the only connection between layers are label's weights. the front layer's prediction error rate of each label will become weight for the next layers. those labels with high error rate will have big weight. so later layer's will pay more attention to those mis-predicted labels, and try to fix previous mistake of former layer. as a result, we will get a much strong model.\n    check a00_boosting/boosting.py\n\nand other models:\n\n1) BiLstmTextRelation;\n\n2) twoCNNTextRelation;\n\n3) BiLstmTextRelationTwoRNN\n\nPerformance\n-------------------------------------------------------------------------\n\n(mulit-label label prediction task,ask to prediction top5, 3 million training data,full score:0.5)\n\nModel   | fastText|TextCNN|TextRNN| RCNN | HierAtteNet|Seq2seqAttn|EntityNet|DynamicMemory|Transformer\n---     | ---     | ---   | ---   |---   |---         |---        |---      |---          |----\nScore   | 0.362   |  0.405| 0.358 | 0.395| 0.398      |0.322      |0.400    |0.392        |0.322\nTraining| 10m     |  2h   |10h    | 2h   | 2h         |3h         |3h       |5h           |7h\n--------------------------------------------------------------------------------------------------\n \n Bert model achieves 0.368 after first 9 epoch from validation set.\n \n Ensemble of TextCNN,EntityNet,DynamicMemory: 0.411\n \n Ensemble EntityNet,DynamicMemory: 0.403\n \n\n \n --------------------------------------------------------------------------------------------------\n \n Notice: \n \n `m` stand for **minutes**; `h` stand for **hours**;\n \n`HierAtteNet` means Hierarchical Attention Networkk;\n\n`Seq2seqAttn` means Seq2seq with attention;\n\n`DynamicMemory` means DynamicMemoryNetwork;\n\n`Transformer` stand for model from 'Attention Is All You Need'.\n\nUsage:\n-------------------------------------------------------------------------------------------------------\n1) model is in `xxx_model.py`\n2) run python `xxx_train.py` to train the model\n3) run python `xxx_predict.py` to do inference(test).\n\nEach model has a test method under the model class. you can run the test method first to check whether the model can work properly.\n\n-------------------------------------------------------------------------\n\nEnvironment:\n-------------------------------------------------------------------------------------------------------\npython 2.7+ tensorflow 1.8 \n\n(tensorflow 1.1 to 1.13 should also works; most of models should also work fine in other tensorflow version, since we \n\nuse very few features bond to certain version.\n\nif you use python3, it will be fine as long as you change print/try catch function in case you meet any error.\n\nTextCNN model is already transfomed to python 3.6\n\n\nSample data: <a href='https://pan.baidu.com/s/1yWZf2eAPxq15-r2hHk2M-Q'>cached file of baidu</a> or <a href=\"https://drive.google.com/drive/folders/0AKEuT4gza2AlUk9PVA\">Google Drive:</a>send me an email\n-------------------------------------------------------------------------------------------------------\nto help you run this repository, currently we re-generate training/validation/test data and vocabulary/labels, and saved \n\nthem as cache file using h5py. we suggest you to download it from above link.\n\nit contain everything you need to run this repository: data is pre-processed, you can start to train the model in a minute.\n  \nit's a zip file about 1.8G, contains 3 million training data. although after unzip it's quite big, but with the help of \n\nhdf5, it only need a normal size of memory of computer(e.g.8 G or less) during training.\n\nwe use jupyter notebook: <a href='https://github.com/brightmart/text_classification/blob/master/pre-processing.ipynb'>pre-processing.ipynb</a> to pre-process data. you can have a better understanding of this task and \n\ndata by taking a look of it. you can also generate data by yourself in the way your want, just change few lines of code \n\nusing this jupyter notebook.\n\nIf you want to try a model now, you can dowload cached file from above, then go to folder 'a02_TextCNN', run \n        \n     python  p7_TextCNN_train.py \n   \nit will use data from cached files to train the model, and print loss and F1 score periodically.\n\nold sample data source:\nif you need some sample data and word embedding per-trained on word2vec, you can find it in closed issues, such as: <a href=\"https://github.com/brightmart/text_classification/issues/3\">issue 3</a>. \n\nyou can also find some sample data at folder \"data\". it contains two files:'sample_single_label.txt', contains 50k data \n\nwith single label; 'sample_multiple_label.txt', contains 20k data with multiple labels. input and label of is separate by \"   __label__\".\n\nif you want to know more detail about data set of text classification or task these models can be used, one of choose is below:\n\nhttps://biendata.com/competition/zhihu/\n\nRoad Map\n-------------------------------------------------------------------------------------------------------\nOne way you can use this repository:\n \nstep 1: you can read through this article. you will get a general idea of various classic models used to do text classification.\n\nstep 2: pre-process data and/or download cached file.\n\n      a. take a look a look of jupyter notebook('pre-processing.ipynb'), where you can familiar with this text \n\n           classification task and data set. you will also know how we pre-process data and generate training/validation/test \n           \n           set. there are a list of things you can try at the end of this jupyter.\n\n       b. download zip file that contains cached files, so you will have all necessary data, and can start to train models.\n\nstep 3: run some of models list here, and change some codes and configurations as you want, to get a good performance.\n\n      record performances, and things you done that works, and things that are not.\n\n      for example, you can take this sequence to explore: \n      \n      1) fasttext---> 2)TextCNN---> 3)Transformer---> 4)BERT\n\nadditionally, write your article about this topic, you can follow paper's style to write. you may need to read some papers\n       \n       on the way, many of these papers list in the ",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        0.9610739597591095
      ],
      "excerpt": "Releasing Pre-trained Model of <a href=\"https://github.com/brightmart/albert_zh\">ALBERT_Chinese</a> Training with 30G+ Raw Chinese Corpus, xxlarge, xlarge and more, Target to match State of the Art performance in Chinese, 2019-Oct-7, During the National Day of China! \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8606536140187139
      ],
      "excerpt": "Google's BERT achieved new state of art result on more than 10 tasks in NLP using pre-train in language model then  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9831890797277831,
        0.910070558974593,
        0.9539270261081094
      ],
      "excerpt": "BERT currently achieve state of art results on more than 10 NLP tasks. the key ideas behind this model is that we can  \npre-train the model by using one kind of language model with huge amount of raw data, where you can find it easily. \nas most of parameters of the model is pre-trained, only last layer for classifier need to be need for different tasks. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8993857583556382,
        0.9203347633581138
      ],
      "excerpt": "a short period of time. \nhowever, this model is quite big. with sequence length 128, you may only able to train with a batch size of 32; for long \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9513779505267257,
        0.8468715774419332
      ],
      "excerpt": "for this model. \nSpecially, the backbone model is Transformer, where you can find it in Attention Is All You Need. it use two kind of  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.904343647137917
      ],
      "excerpt": "based on this masked sentence. masked words are chosed randomly. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9525963348321064,
        0.9596212402175397,
        0.9249263124476456,
        0.9802045122744809
      ],
      "excerpt": "between sentence. however, language model is only able to understand without a sentence. next sentence \nprediction is a sample task to help model understand better in these kinds of task. \n50% of chance the second sentence is tbe next sentence of the first one, 50% of not the next one. \ngiven two sentence, the model is asked to predict whether the second sentence is real next sentence of  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.924807497248963
      ],
      "excerpt": "Input : [CLS] the man went to the store [SEP] he bought a gallon of milk [SEP] \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "all kinds of text classification models and more with deep learning",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/brightmart/text_classification/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 2556,
      "date": "Thu, 23 Dec 2021 07:30:11 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/brightmart/text_classification/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "brightmart/text_classification",
    "technique": "GitHub API"
  },
  "hasExecutableNotebook": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://raw.githubusercontent.com/brightmart/text_classification/master/pre-processing.ipynb"
    ],
    "technique": "File Exploration"
  },
  "invocation": [
    {
      "confidence": [
        0.827498580955782
      ],
      "excerpt": "the first one. \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/brightmart/text_classification/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Python",
      "Jupyter Notebook"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "name": "MIT License",
      "url": "https://api.github.com/licenses/mit"
    },
    "technique": "GitHub API"
  },
  "licenseText": {
    "confidence": [
      1.0
    ],
    "excerpt": "b'MIT License\\n\\nCopyright (c) [year] [fullname]\\n\\nPermission is hereby granted, free of charge, to any person obtaining a copy\\nof this software and associated documentation files (the \"Software\"), to deal\\nin the Software without restriction, including without limitation the rights\\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\\ncopies of the Software, and to permit persons to whom the Software is\\nfurnished to do so, subject to the following conditions:\\n\\nThe above copyright notice and this permission notice shall be included in all\\ncopies or substantial portions of the Software.\\n\\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\\nSOFTWARE.\\n'",
    "technique": "File Exploration"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "### Update:",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "text_classification",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "brightmart",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/brightmart/text_classification/blob/master/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 7181,
      "date": "Thu, 23 Dec 2021 07:30:11 GMT"
    },
    "technique": "GitHub API"
  },
  "topics": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "classification",
      "nlp",
      "fasttext",
      "textcnn",
      "textrnn",
      "tensorflow",
      "multi-label",
      "multi-class",
      "attention-mechanism",
      "text-classification",
      "convolutional-neural-networks",
      "sentence-classification",
      "memory-networks"
    ],
    "technique": "GitHub API"
  },
  "usage": [
    {
      "confidence": [
        1
      ],
      "excerpt": "basically, you can download pre-trained model, can just fine-tuning on your task with your own data.\n\nfor classification task, you can add processor to define the format you want to let input and labels from source data.\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        1
      ],
      "excerpt": "run the following command under folder a00_Bert:\n \n      python  train_bert_multi-label.py\n   \nIt achieve 0.368 after 9 epoch.\nor you can run multi-label classification with downloadable data using BERT from \n\n<a href='https://github.com/brightmart/sentiment_analysis_fine_grain'>sentiment_analysis_fine_grain with BERT</a>\n \n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        1
      ],
      "excerpt": "you can use session and feed style to restore model and feed data, then get logits to make a online prediction.\n\n<a href='https://github.com/brightmart/sentiment_analysis_fine_grain'>online prediction with BERT</a>\n\noriginally, it train or evaluate model based on file, not for online.\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        1
      ],
      "excerpt": "firstly, you can use pre-trained model download from google. run a few epoch on you dataset, and find a suitable \n\nsequence length.\n\nsecondly, you can pre-train the base model in your own data as long as  you can find a dataset that is related to \n\nyour task, then fine-tuning on your specific task.\n\nthirdly, you can change loss function and last layer to better suit for your task.\n\nadditionally, you can add define some pre-trained tasks that will help the model understand your task much better.\n\nas experienced we got from experiments, pre-trained task is independent from model and pre-train is not limit to \n\nthe tasks above.\n\n-------------------------------------------------------------------------\n\n\n4.TextRNN\n-------------\nStructure v1:embedding--->bi-directional lstm--->concat output--->average----->softmax layer\n\ncheck: p8_TextRNN_model.py\n\n![alt text](https://github.com/brightmart/text_classification/blob/master/images/bi-directionalRNN.JPG)\n\nStructure v2:embedding-->bi-directional lstm---->dropout-->concat ouput--->lstm--->droput-->FC layer-->softmax layer\n\ncheck: p8_TextRNN_model_multilayer.py\n\n![alt text](https://github.com/brightmart/text_classification/blob/master/images/emojifier-v2.png)\n\n\n-------------------------------------------------------------------------\n\n\n5.BiLstmTextRelation\n-------------\nStructure same as TextRNN. but input is special designed. e.g.input:\"how much is the computer? EOS price of laptop\". where 'EOS' is a special\ntoken spilted question1 and question2.\n\ncheck:p9_BiLstmTextRelation_model.py\n\n\n-------------------------------------------------------------------------\n\n\n6.twoCNNTextRelation\n-------------\nStructure: first use two different convolutional to extract feature of two sentences. then concat two features. use linear\ntransform layer to out projection to target label, then softmax.\n\ncheck: p9_twoCNNTextRelation_model.py\n\n\n-------------------------------------------------------------------------\n\n\n7.BiLstmTextRelationTwoRNN\n-------------\nStructure: one bi-directional lstm for one sentence(get output1), another bi-directional lstm for another sentence(get output2). then:\nsoftmax(output1*M*output2)\n\ncheck:p9_BiLstmTextRelationTwoRNN_model.py\n\nfor more detail you can go to: <a herf=\"http://www.wildml.com/2016/07/deep-learning-for-chatbots-2-retrieval-based-model-tensorflow\">Deep Learning for Chatbots, Part 2 – Implementing a Retrieval-Based Model in Tensorflow<a>\n\n\n-------------------------------------------------------------------------\n\n\n8.RCNN:\n-------------\nRecurrent convolutional neural network for text classification\n\nimplementation of <a href=\"https://scholar.google.com.hk/scholar?q=Recurrent+Convolutional+Neural+Networks+for+Text+Classification&hl=zh-CN&as_sdt=0&as_vis=1&oi=scholart&sa=X&ved=0ahUKEwjpx82cvqTUAhWHspQKHUbDBDYQgQMIITAA\"> Recurrent Convolutional Neural Network for Text Classification </a>\n \nstructure:1)recurrent structure (convolutional layer) 2)max pooling 3) fully connected layer+softmax\n\nit learn represenation of each word in the sentence or document with left side context and right side context:\n\nrepresentation current word=[left_side_context_vector,current_word_embedding,right_side_context_vecotor].\n\nfor left side context, it use a recurrent structure, a no-linearity transfrom of previous word and left side previous context; similarly to right side context.\n\ncheck: p71_TextRCNN_model.py\n\n![alt text](https://github.com/brightmart/text_classification/blob/master/images/RCNN.JPG)\n\n-------------------------------------------------------------------------\n\n9.Hierarchical Attention Network:\n-------------\nImplementation of <a href=\"https://www.cs.cmu.edu/~diyiy/docs/naacl16.pdf\">Hierarchical Attention Networks for Document Classification</a>\n\nStructure:\n\n1) embedding \n\n2) Word Encoder: word level bi-directional GRU to get rich representation of words\n\n3) Word Attention:word level attention to get important information in a sentence\n\n4) Sentence Encoder: sentence level bi-directional GRU to get rich representation of sentences\n\n5) Sentence Attetion: sentence level attention to get important sentence among sentences\n\n5) FC+Softmax\n\n![alt text](https://github.com/brightmart/text_classification/blob/master/images/HAN.JPG)\n\nIn NLP, text classification can be done for single sentence, but it can also be used for multiple sentences. we may call it document classification. Words are form to sentence. And sentence are form to document. In this circumstance, there may exists a intrinsic structure. So how can we model this kinds of task? Does all parts of document are equally relevant? And how we determine which part are more important than another?\n\nIt has two unique features: \n\n1)it has a hierarchical structure that reflect the hierarchical structure of documents; \n\n2)it has two levels of attention mechanisms used at the word and sentence-level. it enable the model to capture important information in different levels.\n\nWord Encoder:\nFor each words in a sentence, it is embedded into word vector in distribution vector space. It use a bidirectional GRU to encode the sentence. By concatenate vector from two direction, it now can form a representation of the sentence, which also capture contextual information.\n\nWord Attention:\nSame words are more important than another for the sentence. So attention mechanism is used. It first use one layer MLP to get uit hidden representation of the sentence, then measure the importance of the word as the similarity of uit with a word level context vector uw and get a normalized importance through a softmax function. \n\nSentence Encoder: \nfor sentence vectors, bidirectional GRU is used to encode it. Similarly to word encoder.\n\nSentence Attention: \nsentence level vector is used to measure importance among sentences. Similarly to word attention.\n\nInput of data: \n\nGenerally speaking, input of this model should have serveral sentences instead of sinle sentence. shape is:[None,sentence_lenght]. where None means the batch_size.\n\nIn my training data, for each example, i have four parts. each part has same length. i concat four parts to form one single sentence. the model will split the sentence into four parts, to form a tensor with shape:[None,num_sentence,sentence_length]. where num_sentence is number of sentences(equal to 4, in my setting).\n\ncheck:p1_HierarchicalAttention_model.py\n\nfor attentive attention you can check <a href='https://github.com/brightmart/text_classification/issues/55'>attentive attention</a>\n\n-------------------------------------------------------------------------\n\n10.Seq2seq with attention\n-------------\nImplementation seq2seq with attention derived from <a href=\"https://arxiv.org/pdf/1409.0473.pdf\">NEURAL MACHINE TRANSLATION BY JOINTLY LEARNING TO ALIGN AND TRANSLATE</a>\n\nI.Structure:\n\n1)embedding 2)bi-GRU too get rich representation from source sentences(forward & backward). 3)decoder with attention.\n\n![alt text](https://github.com/brightmart/text_classification/blob/master/images/seq2seqAttention.JPG)\n\nII.Input of data:\n\nthere are two kinds of three kinds of inputs:1)encoder inputs, which is a sentence; 2)decoder inputs, it is labels list with fixed length;3)target labels, it is also a list of labels.\n\nfor example, labels is:\"L1 L2 L3 L4\", then decoder inputs will be:[_GO,L1,L2,L2,L3,_PAD]; target label will be:[L1,L2,L3,L3,_END,_PAD]. length is fixed to 6, any exceed labels will be trancated, will pad if label is not enough to fill.\n\nIII.Attention Mechanism:\n\n1) transfer encoder input list and hidden state of decoder\n\n2) calculate similarity of hidden state with each encoder input, to get possibility distribution for each encoder input.\n\n3) weighted sum of encoder input based on possibility distribution.\n\n   go though RNN Cell using this weight sum together with decoder input to get new hidden state\n\nIV.How Vanilla Encoder Decoder Works:\n\nthe source sentence will be encoded using RNN as fixed size vector (\"thought vector\"). then during decoder:\n\n1) when it is training, another RNN will be used to try to get a word by using this \"thought vector\"  as init state, and take input from decoder input at each timestamp. decoder start from special token \"_GO\". \nafter one step is performanced, new hidden state will be get and together with new input, we can continue this process until we reach to a special token \"_END\". \nwe can calculate loss by compute cross entropy loss of logits and target label. logits is get through a projection layer for the hidden state(for output of decoder step(in GRU we can just use hidden states from decoder as output).\n\n2) when it is testing, there is no label. so we should feed the output we get from previous timestamp, and continue the process util we reached \"_END\" TOKEN.\n\nV.Notices:\n\n1) here i use two kinds of vocabularies. one is from words,used by encoder; another is for labels,used by decoder\n\n2) for vocabulary of lables, i insert three special token:\"_GO\",\"_END\",\"_PAD\"; \"_UNK\" is not used, since all labels is pre-defined.\n\n-------------------------------------------------------------------------\n\n11.Transformer(\"Attention Is All You Need\")\n-------------\nStatus: it was able to do task classification. and able to generate reverse order of its sequences in toy task. you can check it by running test function in the model. check: a2_train_classification.py(train) or a2_transformer_classification.py(model)\n\nwe do it in parallell style.layer normalization,residual connection, and mask are also used in the model. \n\nFor every building blocks, we include a test function in the each file below, and we've test each small piece successfully.\n\nSequence to sequence with attention is a typical model to solve sequence generation problem, such as translate, dialogue system. most of time, it use RNN as buidling block to do these tasks. util recently, people also apply convolutional Neural Network for sequence to sequence problem. Transformer, however, it perform these tasks solely on attention mechansim. it is fast and achieve new state-of-art result.\n\n![alt text](https://github.com/brightmart/text_classification/blob/master/images/attention_is_all_you_need.JPG)\n\nIt also has two main parts: encoder and decoder. below is desc from paper:\n\nEncoder:\n\n6 layers.each layers has two sub-layers.\nthe first is multi-head self-attention mechanism;\nthe second is position-wise fully connected feed-forward network.\nfor each sublayer. use LayerNorm(x+Sublayer(x)). all dimension=512.\n\nDecoder:\n\n1. The decoder is composed of a stack of N= 6 identical layers.\n2. In addition to the two sub-layers in each encoder layer, the decoder inserts a third sub-layer, which performs multi-head\nattention over the output of the encoder stack.\n3. Similar to the encoder, we employ residual connections\naround each of the sub-layers, followed by layer normalization. We also modify the self-attention\nsub-layer in the decoder stack to prevent positions from attending to subsequent positions.  This\nmasking, combined with fact that the output embeddings are offset by one position, ensures that the\npredictions for position i can depend only on the known outputs at positions less than i.\n\nMain Take away from this model:\n\n1) multi-head self attention: use self attention, linear transform multi-times to get projection of key-values, then do ordinary attention; 2) some tricks to improve performance(residual connection,position encoding, poistion feed forward, label smooth, mask to ignore things we want to ignore).\n\nUse this model to do task classification:\n\nHere we only use encode part for task classification, removed resdiual connection, used only 1 layer.no need to use mask. we use multi-head attention and postionwise feed forward to extract features of input sentence, then use linear layer to project it to get logits.\n\nfor detail of the model, please check: a2_transformer_classification.py\n\n-------------------------------------------------------------------------\n\n12.Recurrent Entity Network\n-------------------------------------------------------------------------\nInput:1. story: it is multi-sentences, as context. 2.query: a sentence, which is a question, 3. ansewr: a single label.\n\nModel Structure:\n\n1) Input encoding: use bag of word to encode story(context) and query(question); take account of position by using position mask\n\n   by using bi-directional rnn to encode story and query, performance boost from 0.392 to 0.398, increase 1.5%.\n\n2) Dynamic memory: \n\na. compute gate by using 'similarity' of keys,values with input of story. \n\nb. get candidate hidden state by transform each key,value and input.\n\nc. combine gate and candidate hidden state to update current hidden state.\n\n3) Output moudle( use attention mechanism):\na. to get possibility distribution by computing 'similarity' of query and hidden state\n\nb. get weighted sum of hidden state using possibility distribution.\n\nc. non-linearity transform of query and hidden state to get predict label.\n\n![alt text](https://github.com/brightmart/text_classification/blob/master/images/EntityNet.JPG)\n\nMain take away from this model:\n\n1) use blocks of keys and values, which is independent from each other. so it can be run in parallel.\n\n2) modelling context and question together. use memory to track state of world; and use non-linearity transform of hidden state and question(query) to make a prediction.\n\n3) simple model can also achieve very good performance. simple encode as use bag of word.\n\nfor detail of the model, please check: a3_entity_network.py\n\nunder this model, it has a test function, which ask this model to count numbers both for story(context) and query(question). but weights of story is smaller than query.\n\n-------------------------------------------------------------------------\n\n13.Dynamic Memory Network\n-------------------------------------------------------------------------\nOutlook of Model:\n\n1.Input Module: encode raw texts into vector representation\n\n2.Question Module: encode question into vector representation\n\n3.Episodic Memory Module: with inputs,it chooses which parts of inputs to focus on through the attention mechanism, taking into account of question and previous memory====>it poduce a 'memory' vecotr.\n\n4.Answer Module:generate an answer from the final memory vector.\n\n![alt text](https://github.com/brightmart/text_classification/blob/master/images/DMN.JPG)\n\nDetail:\n\n1.Input Module:\n\n  a.single sentence: use gru to get hidden state\n  b.list of sentences: use gru to get the hidden states for each sentence. e.g. [hidden states 1,hidden states 2, hidden states...,hidden state n]\n  \n2.Question Module:\n  use gru to get hidden state\n  \n3.Episodic Memory Module:\n\n  use an attention mechanism and recurrent network to updates its memory. \n     \n  a. gate as attention mechanism:\n  \n     two-layer feed forward nueral network.input is candidate fact c,previous memory m and question q. features get by take: element-wise,matmul and absolute distance of q with c, and q with m.\n     \n  b.memory update mechanism: take candidate sentence, gate and previous hidden state, it use gated-gru to update hidden state. like: h=f(c,h_previous,g). the final hidden state is the input for answer module.\n  \n  c.need for multiple episodes===>transitive inference. \n  \n  e.g. ask where is the football? it will attend to sentence of \"john put down the football\"), then in second pass, it need to attend location of john.\n\n4.Answer Module:\ntake the final epsoidic memory, question, it update hidden state of answer module.\n\n\nTODO \n-------------------------------------------------------------------------------------------------------\n1.Character-level Convolutional Networks for Text Classification\n\n2.Convolutional Neural Networks for Text Categorization:Shallow Word-level vs. Deep Character-level\n\n3.Very Deep Convolutional Networks for Text Classification\n\n4.Adversarial Training Methods For Semi-supervised Text Classification\n\n5.Ensemble Models\n\n\nConclusion:\n-------------------------------------------------------------------------\nDuring the process of doing large scale of multi-label classification, serveral lessons has been learned, and some list as below:\n\n1) What is most important thing to reach a high accuracy? \nIt depend the task you are doing. From the task we conducted here, we believe that ensemble models based on models trained from multiple features including word, character for title and description can help to reach very high accuarcy; However, in some cases,as just alphaGo Zero demonstrated, algorithm is more important then data or computational power, in fact alphaGo Zero did not use any humam data. \n\n2) Is there a ceiling for any specific model or algorithm?\nThe answer is yes. lots of different models were used here, we found many models have similar performances, even though there are quite different in structure. In some extent, the difference of performance is not so big.\n\n3) Is case study of error useful?\nI think it is quite useful especially when you have done many different things, but reached a limit. For example, by doing case study, you can find labels that models can make correct prediction, and where they make mistakes. And to imporove performance by  increasing weights of these wrong predicted labels or finding potential errors from data.\n\n4) How can we become expert in a specific of Machine Learning?\nIn my opinion,join a machine learning competation or begin a task with lots of data, then read papers and implement some, is a good starting point. So we will have some really experience and ideas of handling specific task, and know the challenges of it.\nBut what's more important is that we should not only follow ideas from papers, but to explore some new ideas we think may help to slove the problem. For example, by changing structures of classic models or even invent some new structures, we may able to tackle the problem in a much better way as it may more suitable for task we are doing.\n\nReference:\n-------------------------------------------------------------------------------------------------------\n1.Bag of Tricks for Efficient Text Classification\n\n2.Convolutional Neural Networks for Sentence Classification\n\n3.A Sensitivity Analysis of (and Practitioners' Guide to) Convolutional Neural Networks for Sentence Classification\n\n4.Deep Learning for Chatbots, Part 2 – Implementing a Retrieval-Based Model in Tensorflow, from www.wildml.com\n\n5.Recurrent Convolutional Neural Network for Text Classification\n\n6.Hierarchical Attention Networks for Document Classification\n\n7.Neural Machine Translation by Jointly Learning to Align and Translate\n\n8.Attention Is All You Need\n\n9.Ask Me Anything:Dynamic Memory Networks for Natural Language Processing\n\n10.Tracking the state of world with recurrent entity networks\n\n11.Ensemble Selection from Libraries of Models\n\n12.<a href='https://arxiv.org/abs/1810.04805'>BERT:Pre-training of Deep Bidirectional Transformers for Language Understanding</a>\n\n13.<a href='https://github.com/google-research/bert'>google-research/bert</a>\n\n-------------------------------------------------------------------------\n\nto be continued. for any problem, concat brightmart@hotmail.com\n",
      "technique": "Header extraction"
    }
  ]
}