{
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/gerardoglz/GANs",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2019-01-24T12:41:22Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2019-01-29T12:20:10Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9632359006901654,
        0.9927709302024949,
        0.985766396583568,
        0.9914926550715487,
        0.9480962882156724
      ],
      "excerpt": "Segmentation of brain MR images into tissue components such as Grey matter (GM), White matter (WM) and CSF (cerebrospinal fluid) allows quantifying the brain regions so as to undertake processes involving diagnosis and prognosis of diverse neurodegenerative conditions.  \nIn here, I experiment with GAN-related methodologies ([pix2pix] see: arxiv.org/abs/1611.07004) to undertake automated gray matter and white matter tissue segmentation of brain scans. Segmentation is a laborious problem in image analysis that usually requires hours of manual processing and labeling by an expert, especially in brain imaging. Some computer-based techniques do this process in a semi-automated manner but they typically require several minutes per scan (and sometimes up to hours) - which can still amount to a few days or weeks of processing for a few thousand images. Using novel techniques such as style transfer and image to image translation will help creating a model that learns the intricacies of brain patterns in MRI scans in order to automatically identify and extract the regions of the brain corresponding to grey and white matter in a matter of seconds. Subsequently, this gray/white matter tissue segmentation can be used for diagnosing certain illnesses (e.g. Alzheimer's, Parkinson's disease) in a patient. \nFor this work, brain T1 MR images were spatially normalised w.r.t. an MNI template in the first instance (standard neurological procedure), this could be done using SPM or other tools (e.g. FSL, freesurfer). Once normalised, the image is segmented as the grey/white matter and CSF are extracted (SPM allows segmenting the brain whilst performing the normalisation step) . We use the segmented grey matter for two purposes, 1) as a reference to train areas in the brain that correspond to the target structure (in the training subset), and 2) as a ground truth for evaluation purposes (in the testing subset). Eventually this code can be extended to use non-normalised brain scans. Image-to-Image Translation consists of a Conditional Generative Adversarial Network (GAN) with an underlying U-net architecture.  \nThe volumetric brain image data consisting of three axis planes (axial, coronal and sagittal) are used to visualise the 3D scan. In here, we focus on the axial plane (Z slice). Due to hardware limitations, this brain dataset can be trained on a random selection of 2D image slices along the Z plane and subsequently tested on the full series of Z slices. See an example of the results below (click on the image to expand), top row shows the original brain scan, middle row illustrates the ground truth grey matter segmentation and bottom row shows the resulting image-to-image segmentation. Dice coefficient between ground truth and segmentation results are > 0.80. \nThe brains dataset has been encoded as a matlab variable file (due to sensitivity of the data). Some code could be added to load a set of image scans (e.g. nifti) at run time located on the local machine, remote server or cloud. \n",
      "technique": "Supervised classification"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/gerardoglz/GANs/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 0,
      "date": "Sun, 26 Dec 2021 08:36:12 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/gerardoglz/GANs/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "gerardoglz/GANs",
    "technique": "GitHub API"
  },
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/gerardoglz/GANs/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Python"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "GANs",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "GANs",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "gerardoglz",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/gerardoglz/GANs/blob/master/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 0,
      "date": "Sun, 26 Dec 2021 08:36:12 GMT"
    },
    "technique": "GitHub API"
  }
}