{
  "citation": [
    {
      "confidence": [
        1
      ],
      "excerpt": "If you use DeepPoseKit for your research please cite [our open-access paper](http://paper.deepposekit.org):\n\n    @article{graving2019deepposekit,\n             title={DeepPoseKit, a software toolkit for fast and robust animal pose estimation using deep learning},\n             author={Graving, Jacob M and Chae, Daniel and Naik, Hemal and Li, Liang and Koger, Benjamin and Costelloe, Blair R and Couzin, Iain D},\n             journal={eLife},\n             volume={8},\n             pages={e47994},\n             year={2019},\n             publisher={eLife Sciences Publications Limited}\n             url={https://doi.org/10.7554/eLife.47994},\n             }\n\nYou can also read [our open-access preprint](http://preprint.deepposekit.org).\n\nIf you use the [imgaug package](https://github.com/aleju/imgaug) for data augmentation, please also consider [citing it](https://github.com/aleju/imgaug/blob/master/README.md#citation).\n\nIf you [use data](https://github.com/jgraving/DeepPoseKit#i-already-have-annotated-data) that was annotated with the DeepLabCut package (http://deeplabcut.org) for your research, be sure to [cite it](https://github.com/AlexEMG/DeepLabCut/blob/master/README.md#references).\n\nPlease also consider citing the relevant references for the pose estimation model(s) used in your research, which can be found in the documentation (i.e., [`StackedDenseNet`](http://jakegraving.com/DeepPoseKit/html/deepposekit/models/StackedDenseNet.html#references), [`StackedHourglass`](http://jakegraving.com/DeepPoseKit/html/deepposekit/models/StackedHourglass.html#references), [`DeepLabCut`](http://jakegraving.com/DeepPoseKit/html/deepposekit/models/DeepLabCut.html#references), [`LEAP`](http://jakegraving.com/DeepPoseKit/html/deepposekit/models/LEAP.html#references)).\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        0.9909064627499502
      ],
      "excerpt": "3. Select and train one our pose estimation models including StackedDenseNet, StackedHourglass, DeepLabCut, and LEAP. <a href=\"https://colab.research.google.com/github/jgraving/deepposekit/blob/master/examples/step3_train_model.ipynb\" target=\"_parent\"><img src=\"https://colab.research.google.com/assets/colab-badge.svg\" alt=\"Open In Colab\"/></a> \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9960887246253988,
        0.9222383658450612,
        0.854836641318266
      ],
      "excerpt": "October 2019: Our paper describing DeepPoseKit is published at eLife! (http://paper.deepposekit.org) \nSeptember 2019:  \nNature News covers DeepPoseKit: Deep learning powers a motion-tracking revolution \n",
      "technique": "Supervised classification"
    }
  ],
  "codeOfConduct": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://raw.githubusercontent.com/jgraving/DeepPoseKit/master/CODE_OF_CONDUCT.md",
    "technique": "File Exploration"
  },
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/jgraving/DeepPoseKit",
    "technique": "GitHub API"
  },
  "contributor": [
    {
      "confidence": [
        1
      ],
      "excerpt": "   \nDeepPoseKit was developed by [Jake Graving](https://github.com/jgraving) and [Daniel Chae](https://github.com/dchaebae), and is still being actively developed. .\n\nWe welcome community involvement and public contributions to the toolkit. If you wish to contribute, please [fork the repository](https://help.github.com/en/articles/fork-a-repo) to make your modifications and [submit a pull request](https://help.github.com/en/articles/creating-a-pull-request-from-a-fork).\n\nIf you'd like to get involved with developing DeepPoseKit, get in touch (jgraving@gmail.com) and check out [our development roadmap](https://github.com/jgraving/DeepPoseKit/blob/master/DEVELOPMENT.md) to see future plans for the package.  \n\n",
      "technique": "Header extraction"
    }
  ],
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2019-05-05T09:48:51Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-12-22T16:51:22Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9643615397100984,
        0.8423211642497223,
        0.8946132514407138
      ],
      "excerpt": "DeepPoseKit is a software toolkit with a high-level API for 2D pose estimation of user-defined keypoints using deep learning—written in Python and built using Tensorflow and Keras. Use DeepPoseKit if you need: \ntools for annotating images or video frames with user-defined keypoints \na straightforward but flexible data augmentation pipeline using the imgaug package \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9752146998892698,
        0.9309680610430752,
        0.8672543729025481,
        0.9713288647352682,
        0.8762948072186911
      ],
      "excerpt": "easy-to-use methods for saving and loading models and making predictions on new data \nDeepPoseKit is designed with a focus on usability and extensibility, as being able to go from idea to result with the least possible delay is key to doing good research. \nDeepPoseKit is currently limited to individual pose estimation. If individuals can be easily distinguished visually (i.e., they have differently colored bodies or are marked in some way), then multiple individuals can simply be labeled with separate keypoints (head1, tail1, head2, tail2, etc.). Otherwise DeepPoseKit can be extended to multiple individuals by first localizing, tracking, and cropping individuals with additional software such as idtracker.ai, pinpoint, or Tracktor. \nLocalization (without tracking) can also be achieved with deep learning software like keras-retinanet, the Tensorflow Object Detection API, or MatterPort's Mask R-CNN. \nCheck out our paper to find out more. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9686799050924337
      ],
      "excerpt": "2. Annotate your data with our built-in GUI (no Colab support) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9446335936405312
      ],
      "excerpt": "DeepPoseKit is designed to be extensible, so loading data in other formats is possible. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.93086733996825
      ],
      "excerpt": "v0.3.0 is released. See the release notes. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "a toolkit for pose estimation using deep learning",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/jgraving/DeepPoseKit/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 74,
      "date": "Sat, 25 Dec 2021 08:39:07 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/jgraving/DeepPoseKit/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "jgraving/DeepPoseKit",
    "technique": "GitHub API"
  },
  "hasExecutableNotebook": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://raw.githubusercontent.com/jgraving/DeepPoseKit/master/examples/deeplabcut_data_example.ipynb",
      "https://raw.githubusercontent.com/jgraving/DeepPoseKit/master/examples/step2_annotate_data.ipynb",
      "https://raw.githubusercontent.com/jgraving/DeepPoseKit/master/examples/step4a_initialize_annotations.ipynb",
      "https://raw.githubusercontent.com/jgraving/DeepPoseKit/master/examples/custom_data_generator.ipynb",
      "https://raw.githubusercontent.com/jgraving/DeepPoseKit/master/examples/step1_create_annotation_set.ipynb",
      "https://raw.githubusercontent.com/jgraving/DeepPoseKit/master/examples/step4b_predict_new_data.ipynb",
      "https://raw.githubusercontent.com/jgraving/DeepPoseKit/master/examples/step3_train_model.ipynb"
    ],
    "technique": "File Exploration"
  },
  "installation": [
    {
      "confidence": [
        1
      ],
      "excerpt": "To install DeepPoseKit on Windows, you must first manually install `Shapely`, one of the dependencies for the [imgaug package](https://github.com/aleju/imgaug):\n```bash\nconda install -c conda-forge shapely\n```\nWe also recommend installing DeepPoseKit from within Python rather than using the command line, either from within Jupyter or another IDE, to ensure it is installed in the correct working environment:\n```python\nimport sys\n!{sys.executable} -m pip install --update deepposekit\n```\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        1
      ],
      "excerpt": "DeepPoseKit requires [Tensorflow](https://github.com/tensorflow/tensorflow) for training and using pose estimation models. [Tensorflow](https://github.com/tensorflow/tensorflow) should be manually installed, along with dependencies such as CUDA and cuDNN, before installing DeepPoseKit:\n\n- [Tensorflow Installation Instructions](https://www.tensorflow.org/install)\n- Any Tensorflow version >=1.13.0 should be compatible (including 2.0).\n\nDeepPoseKit has only been tested on Ubuntu 18.04, which is the recommended system for using the toolkit. \n\nInstall the latest stable release with pip:\n```bash\npip install --update deepposekit\n```\n\nInstall the latest development version with pip:\n```bash\npip install --update git+https://www.github.com/jgraving/deepposekit.git\n```\n\nYou can download example datasets from our [DeepPoseKit Data](https://github.com/jgraving/deepposekit-data) repository:\n```bash\ngit clone https://www.github.com/jgraving/deepposekit-data\n```\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        0.9195706143282879
      ],
      "excerpt": "If you experience problems with Tensorflow, such as installing CUDA or cuDNN dependencies, then please direct issues to those development teams. \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/jgraving/DeepPoseKit/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Python"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "name": "Apache License 2.0",
      "url": "https://api.github.com/licenses/apache-2.0"
    },
    "technique": "GitHub API"
  },
  "licenseText": {
    "confidence": [
      1.0
    ],
    "excerpt": "b'                                 Apache License\\n                           Version 2.0, January 2004\\n                        http://www.apache.org/licenses/\\n\\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\\n\\n   1. Definitions.\\n\\n      \"License\" shall mean the terms and conditions for use, reproduction,\\n      and distribution as defined by Sections 1 through 9 of this document.\\n\\n      \"Licensor\" shall mean the copyright owner or entity authorized by\\n      the copyright owner that is granting the License.\\n\\n      \"Legal Entity\" shall mean the union of the acting entity and all\\n      other entities that control, are controlled by, or are under common\\n      control with that entity. For the purposes of this definition,\\n      \"control\" means (i) the power, direct or indirect, to cause the\\n      direction or management of such entity, whether by contract or\\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\\n      outstanding shares, or (iii) beneficial ownership of such entity.\\n\\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\\n      exercising permissions granted by this License.\\n\\n      \"Source\" form shall mean the preferred form for making modifications,\\n      including but not limited to software source code, documentation\\n      source, and configuration files.\\n\\n      \"Object\" form shall mean any form resulting from mechanical\\n      transformation or translation of a Source form, including but\\n      not limited to compiled object code, generated documentation,\\n      and conversions to other media types.\\n\\n      \"Work\" shall mean the work of authorship, whether in Source or\\n      Object form, made available under the License, as indicated by a\\n      copyright notice that is included in or attached to the work\\n      (an example is provided in the Appendix below).\\n\\n      \"Derivative Works\" shall mean any work, whether in Source or Object\\n      form, that is based on (or derived from) the Work and for which the\\n      editorial revisions, annotations, elaborations, or other modifications\\n      represent, as a whole, an original work of authorship. For the purposes\\n      of this License, Derivative Works shall not include works that remain\\n      separable from, or merely link (or bind by name) to the interfaces of,\\n      the Work and Derivative Works thereof.\\n\\n      \"Contribution\" shall mean any work of authorship, including\\n      the original version of the Work and any modifications or additions\\n      to that Work or Derivative Works thereof, that is intentionally\\n      submitted to Licensor for inclusion in the Work by the copyright owner\\n      or by an individual or Legal Entity authorized to submit on behalf of\\n      the copyright owner. For the purposes of this definition, \"submitted\"\\n      means any form of electronic, verbal, or written communication sent\\n      to the Licensor or its representatives, including but not limited to\\n      communication on electronic mailing lists, source code control systems,\\n      and issue tracking systems that are managed by, or on behalf of, the\\n      Licensor for the purpose of discussing and improving the Work, but\\n      excluding communication that is conspicuously marked or otherwise\\n      designated in writing by the copyright owner as \"Not a Contribution.\"\\n\\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\\n      on behalf of whom a Contribution has been received by Licensor and\\n      subsequently incorporated within the Work.\\n\\n   2. Grant of Copyright License. Subject to the terms and conditions of\\n      this License, each Contributor hereby grants to You a perpetual,\\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\\n      copyright license to reproduce, prepare Derivative Works of,\\n      publicly display, publicly perform, sublicense, and distribute the\\n      Work and such Derivative Works in Source or Object form.\\n\\n   3. Grant of Patent License. Subject to the terms and conditions of\\n      this License, each Contributor hereby grants to You a perpetual,\\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\\n      (except as stated in this section) patent license to make, have made,\\n      use, offer to sell, sell, import, and otherwise transfer the Work,\\n      where such license applies only to those patent claims licensable\\n      by such Contributor that are necessarily infringed by their\\n      Contribution(s) alone or by combination of their Contribution(s)\\n      with the Work to which such Contribution(s) was submitted. If You\\n      institute patent litigation against any entity (including a\\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\\n      or a Contribution incorporated within the Work constitutes direct\\n      or contributory patent infringement, then any patent licenses\\n      granted to You under this License for that Work shall terminate\\n      as of the date such litigation is filed.\\n\\n   4. Redistribution. You may reproduce and distribute copies of the\\n      Work or Derivative Works thereof in any medium, with or without\\n      modifications, and in Source or Object form, provided that You\\n      meet the following conditions:\\n\\n      (a) You must give any other recipients of the Work or\\n          Derivative Works a copy of this License; and\\n\\n      (b) You must cause any modified files to carry prominent notices\\n          stating that You changed the files; and\\n\\n      (c) You must retain, in the Source form of any Derivative Works\\n          that You distribute, all copyright, patent, trademark, and\\n          attribution notices from the Source form of the Work,\\n          excluding those notices that do not pertain to any part of\\n          the Derivative Works; and\\n\\n      (d) If the Work includes a \"NOTICE\" text file as part of its\\n          distribution, then any Derivative Works that You distribute must\\n          include a readable copy of the attribution notices contained\\n          within such NOTICE file, excluding those notices that do not\\n          pertain to any part of the Derivative Works, in at least one\\n          of the following places: within a NOTICE text file distributed\\n          as part of the Derivative Works; within the Source form or\\n          documentation, if provided along with the Derivative Works; or,\\n          within a display generated by the Derivative Works, if and\\n          wherever such third-party notices normally appear. The contents\\n          of the NOTICE file are for informational purposes only and\\n          do not modify the License. You may add Your own attribution\\n          notices within Derivative Works that You distribute, alongside\\n          or as an addendum to the NOTICE text from the Work, provided\\n          that such additional attribution notices cannot be construed\\n          as modifying the License.\\n\\n      You may add Your own copyright statement to Your modifications and\\n      may provide additional or different license terms and conditions\\n      for use, reproduction, or distribution of Your modifications, or\\n      for any such Derivative Works as a whole, provided Your use,\\n      reproduction, and distribution of the Work otherwise complies with\\n      the conditions stated in this License.\\n\\n   5. Submission of Contributions. Unless You explicitly state otherwise,\\n      any Contribution intentionally submitted for inclusion in the Work\\n      by You to the Licensor shall be under the terms and conditions of\\n      this License, without any additional terms or conditions.\\n      Notwithstanding the above, nothing herein shall supersede or modify\\n      the terms of any separate license agreement you may have executed\\n      with Licensor regarding such Contributions.\\n\\n   6. Trademarks. This License does not grant permission to use the trade\\n      names, trademarks, service marks, or product names of the Licensor,\\n      except as required for reasonable and customary use in describing the\\n      origin of the Work and reproducing the content of the NOTICE file.\\n\\n   7. Disclaimer of Warranty. Unless required by applicable law or\\n      agreed to in writing, Licensor provides the Work (and each\\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\\n      implied, including, without limitation, any warranties or conditions\\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\\n      PARTICULAR PURPOSE. You are solely responsible for determining the\\n      appropriateness of using or redistributing the Work and assume any\\n      risks associated with Your exercise of permissions under this License.\\n\\n   8. Limitation of Liability. In no event and under no legal theory,\\n      whether in tort (including negligence), contract, or otherwise,\\n      unless required by applicable law (such as deliberate and grossly\\n      negligent acts) or agreed to in writing, shall any Contributor be\\n      liable to You for damages, including any direct, indirect, special,\\n      incidental, or consequential damages of any character arising as a\\n      result of this License or out of the use or inability to use the\\n      Work (including but not limited to damages for loss of goodwill,\\n      work stoppage, computer failure or malfunction, or any and all\\n      other commercial damages or losses), even if such Contributor\\n      has been advised of the possibility of such damages.\\n\\n   9. Accepting Warranty or Additional Liability. While redistributing\\n      the Work or Derivative Works thereof, You may choose to offer,\\n      and charge a fee for, acceptance of support, warranty, indemnity,\\n      or other liability obligations and/or rights consistent with this\\n      License. However, in accepting such obligations, You may act only\\n      on Your own behalf and on Your sole responsibility, not on behalf\\n      of any other Contributor, and only if You agree to indemnify,\\n      defend, and hold each Contributor harmless for any liability\\n      incurred by, or claims asserted against, such Contributor by reason\\n      of your accepting any such warranty or additional liability.\\n\\n   END OF TERMS AND CONDITIONS\\n\\n   APPENDIX: How to apply the Apache License to your work.\\n\\n      To apply the Apache License to your work, attach the following\\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\\n      replaced with your own identifying information. (Don\\'t include\\n      the brackets!)  The text should be enclosed in the appropriate\\n      comment syntax for the file format. We also recommend that a\\n      file or class name and description of purpose be included on the\\n      same \"printed page\" as the copyright notice for easier\\n      identification within third-party archives.\\n\\n   Copyright [yyyy] [name of copyright owner]\\n\\n   Licensed under the Apache License, Version 2.0 (the \"License\");\\n   you may not use this file except in compliance with the License.\\n   You may obtain a copy of the License at\\n\\n       http://www.apache.org/licenses/LICENSE-2.0\\n\\n   Unless required by applicable law or agreed to in writing, software\\n   distributed under the License is distributed on an \"AS IS\" BASIS,\\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\\n   See the License for the specific language governing permissions and\\n   limitations under the License.\\n'",
    "technique": "File Exploration"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "You have just found DeepPoseKit.",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "DeepPoseKit",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "jgraving",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/jgraving/DeepPoseKit/blob/master/README.md",
    "technique": "GitHub API"
  },
  "releases": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      {
        "authorType": "User",
        "author_name": "jgraving",
        "body": "- Added GUI functionality to set keypoints as visible or not visible (hotkey <kbd>V</kbd>)\r\n- Update imports for TF 2.1.x compatibility",
        "dateCreated": "2020-02-23T14:21:11Z",
        "datePublished": "2020-02-23T20:10:10Z",
        "html_url": "https://github.com/jgraving/DeepPoseKit/releases/tag/v0.3.6",
        "name": "v0.3.6",
        "tag_name": "v0.3.6",
        "tarball_url": "https://api.github.com/repos/jgraving/DeepPoseKit/tarball/v0.3.6",
        "url": "https://api.github.com/repos/jgraving/DeepPoseKit/releases/23913660",
        "zipball_url": "https://api.github.com/repos/jgraving/DeepPoseKit/zipball/v0.3.6"
      },
      {
        "authorType": "User",
        "author_name": "jgraving",
        "body": "- Add support for Tensorflow 2.0",
        "dateCreated": "2019-10-04T15:55:48Z",
        "datePublished": "2019-10-04T15:56:24Z",
        "html_url": "https://github.com/jgraving/DeepPoseKit/releases/tag/v0.3.3",
        "name": "v0.3.3",
        "tag_name": "v0.3.3",
        "tarball_url": "https://api.github.com/repos/jgraving/DeepPoseKit/tarball/v0.3.3",
        "url": "https://api.github.com/repos/jgraving/DeepPoseKit/releases/20478679",
        "zipball_url": "https://api.github.com/repos/jgraving/DeepPoseKit/zipball/v0.3.3"
      },
      {
        "authorType": "User",
        "author_name": "jgraving",
        "body": "- Update to `tensorflow.keras` (stand-alone keras will be deprecated)\r\n- Updates to the `deepposekit.io` API to abstract data generators with `BaseGenerator`, and added `io.utils` with functions for initializing and merging datasets to resolve #3 \r\n- Improved example notebooks with more documentation to resolve #10 #7 \r\n- Added more sanity checks to resolve #8 #7\r\n- Refactored `StackedDenseNet` to simplify and improve performance.\r\n- Updated models including a pretrained `StackedDenseNet` and `DeepLabCut` with multiple ImageNet pretrained backbone models for transfer learning (ResNets, DenseNets, MobileNetsV2)\r\n- Load DeepLabCut (http://deeplabcut.org) data with `io.DLCDataGenerator` to resolve #1 \r\n",
        "dateCreated": "2019-09-30T11:14:11Z",
        "datePublished": "2019-09-30T11:29:25Z",
        "html_url": "https://github.com/jgraving/DeepPoseKit/releases/tag/v0.3.0",
        "name": "v0.3.0",
        "tag_name": "v0.3.0",
        "tarball_url": "https://api.github.com/repos/jgraving/DeepPoseKit/tarball/v0.3.0",
        "url": "https://api.github.com/repos/jgraving/DeepPoseKit/releases/20349056",
        "zipball_url": "https://api.github.com/repos/jgraving/DeepPoseKit/zipball/v0.3.0"
      },
      {
        "authorType": "User",
        "author_name": "jgraving",
        "body": "- Still in early development\r\n- Added bug fixes and user-experience improvements",
        "dateCreated": "2019-09-23T11:58:44Z",
        "datePublished": "2019-09-24T15:38:02Z",
        "html_url": "https://github.com/jgraving/DeepPoseKit/releases/tag/v0.1.1.dev",
        "name": "v0.1.1.dev",
        "tag_name": "v0.1.1.dev",
        "tarball_url": "https://api.github.com/repos/jgraving/DeepPoseKit/tarball/v0.1.1.dev",
        "url": "https://api.github.com/repos/jgraving/DeepPoseKit/releases/20216808",
        "zipball_url": "https://api.github.com/repos/jgraving/DeepPoseKit/zipball/v0.1.1.dev"
      }
    ],
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 299,
      "date": "Sat, 25 Dec 2021 08:39:07 GMT"
    },
    "technique": "GitHub API"
  },
  "topics": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "deep-learning",
      "python",
      "keras",
      "pose-estimation",
      "behavior-analysis",
      "machine-learning",
      "tensorflow",
      "neural-networks",
      "deepposekit",
      "animal-pose-estimation",
      "animal",
      "pose",
      "estimation"
    ],
    "technique": "GitHub API"
  },
  "usage": [
    {
      "confidence": [
        1
      ],
      "excerpt": "DeepPoseKit is designed for easy use. For example, training and saving a model requires only a few lines of code:\n```python\nfrom deepposekit.io import DataGenerator, TrainingGenerator\nfrom deepposekit.models import StackedDenseNet\n\ndata_generator = DataGenerator('/path/to/annotation_data.h5')\ntrain_generator = TrainingGenerator(data_generator)\nmodel = StackedDenseNet(train_generator)\nmodel.fit(batch_size=16, n_workers=8)\nmodel.save('/path/to/saved_model.h5')\n```\nLoading a trained model and running predictions on new data is also straightforward. For example, running predictions on a new video:\n```python\nfrom deepposekit.models import load_model\nfrom deepposekit.io import VideoReader\n\nmodel = load_model('/path/to/saved_model.h5')\nreader = VideoReader('/path/to/video.mp4')\npredictions = model.predict(reader)\n```\n\n",
      "technique": "Header extraction"
    }
  ]
}