{
  "acknowledgement": [
    {
      "confidence": [
        1
      ],
      "excerpt": "Thank you for the original Network Dissection implementation\n\n- [Network Dissection Lite in PyTorch](https://github.com/CSAILVision/NetDissect-Lite)\n\n",
      "technique": "Header extraction"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/ostadabbas/Hierarchical-Network-Dissection",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-01-05T00:40:52Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-08-25T19:27:05Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9850987593829873
      ],
      "excerpt": "This is the official pytorch implementation of the Hierarchical Network Dissection which performs network dissection on several face models as described in the paper. Also, this repo contains the link to the first ever Face Dictionary that contains several face concepts annotated under the same dataset. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9555175917013538
      ],
      "excerpt": "In order to determine if any of the units in the dissected layer has a bias towards any of the 4 global concepts we have provided in the dictionary, we generate feature files per model for each concept. Then these feature files are analyzed to generate a set of probabilities per subgroup and these probabilities are saved in both pickle and text format for reusability and readability respectively with the following names in the 'Non Localizable' folder which is defined in the settings file. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9442550994619775
      ],
      "excerpt": "The first stage of the local concept interpretation process requires us to extract the activation maps of all the images (N) in the Face Dictionary with labelled local concepts for the layer specified in the chosen model loader script accordingly. For all the units (U) in the given layer, we generate N maps from the main.py script which first stores the activations in a numpy memory map. The size of the memory map is smaller for the deeper layers due to the lower resolutions of the activation map (HxW). The first function 'feature_extraction' generates two files and stores them in the auto generated 'result' folder that are: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.970191053531182
      ],
      "excerpt": "Secondly after generating the features, we now estimate the threshold values per unit by using their spatial features and computing a value such that the probability of any spatial location having a value greater than the threshold is equal to 0.005 (99.5 quantile). The second function called 'quantile_threshold' computes that and these values are stored in a file called: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9648487740959808
      ],
      "excerpt": "Finally, we use these thresholds to segment the activation maps for each unit respectively and evaluate them against the binary labels we have assembled in the dictionary per concept to compute their intersections and unions with them. Only those images that have a labelled instance of a given concept are used for this evaluation and once we iterate through the entire dictionary, we obtain a list of intersections and unions for each unit that has a length eqaul to the number of concepts. Then we divide the intersections by the unions and generate a final dataset wide IoU for each unit-concept pair. The concept with the highest IoU is recorded and the unit is said to be interpretable if the top concept has an IoU > 0.04. The third function 'tally' performs this computation and generates a pdf file (as shown below) that displays the top four images with the highest IoU returned for that concept per unit. This function generates two files that record the IoU values and display the dissection report respectively which are: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9920675593113876
      ],
      "excerpt": "Even though we can obtain the dominant concepts per unit based on IoU, more often than not there is more than one concept that manages to obtain a high IoU and it is very likely these concepts lie in a similar region of the face. In that case, it is better to establish a hierarchy of concepts that lie in the same region of the face as that of the top concept returned by Stage 1 pipeline. In order to do that we run the cluster_top.py script as it identifies the facial region and then generates probabilities for every concept within that region of the face. This script identifies all the interpretable concepts in that region and plots the histogram for all local concepts detected by each model and saves their tally as following: \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "Revealing Interpretable Representations learned by Face Inference Models",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/ostadabbas/hierarchical-network-dissection/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 0,
      "date": "Sun, 26 Dec 2021 17:51:14 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/ostadabbas/Hierarchical-Network-Dissection/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "ostadabbas/Hierarchical-Network-Dissection",
    "technique": "GitHub API"
  },
  "installation": [
    {
      "confidence": [
        1
      ],
      "excerpt": "- **Data**\n    - Download the data [here](https://coe.northeastern.edu/Research/AClab/Face_Dictionary/) and put in visual_dictionary folder.\n    - Download the models from [here](https://coe.northeastern.edu/Research/AClab/Face_Dictionary/) and put them in model folder.\n- **Code**\n    - Change flags in settings.py to determine which model to dissect.\n    - Change the name of the layer in model loader scripts to choose which layer to dissect.\n\n\n",
      "technique": "Header extraction"
    }
  ],
  "invocation": [
    {
      "confidence": [
        0.8830049073319228
      ],
      "excerpt": "The individual probabilities of the models can be plotted by setting plot = True in bias_analysis() function in nl_bias.py script. Apart from that each global concept has a plot comparing the number of biased units per subgroup for all dissected models. \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/ostadabbas/Hierarchical-Network-Dissection/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Python"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Hierarchical Network Dissection",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "Hierarchical-Network-Dissection",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "ostadabbas",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/ostadabbas/Hierarchical-Network-Dissection/blob/master/README.md",
    "technique": "GitHub API"
  },
  "requirement": [
    {
      "confidence": [
        1
      ],
      "excerpt": "- Torch=1.5.0\n- PIL\n- opencv\n- numpy\n- matplotlib\n- [facenet-pytorch](https://github.com/timesler/facenet-pytorch)\n- cuda/cudnn (recommended)\n- tqdm\n\n",
      "technique": "Header extraction"
    }
  ],
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 0,
      "date": "Sun, 26 Dec 2021 17:51:14 GMT"
    },
    "technique": "GitHub API"
  }
}