{
  "arxivLinks": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://arxiv.org/abs/1705.02315",
      "https://arxiv.org/abs/1402.1892\n"
    ],
    "technique": "Regular expression"
  },
  "citation": [
    {
      "confidence": [
        0.8611967270461103
      ],
      "excerpt": "Any pre-algorithm checks you perform on your DICOM \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8126072207931951
      ],
      "excerpt": "Describe the following parameters of your algorithm and how they were chosen:  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9319248342079272
      ],
      "excerpt": "You will simply describe how a FDA Validation Plan would be conducted for your algorithm, rather than actually performing the assessment. Describe the following:  \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/Raghuvar/pneumonia_detection_using_X-rays",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2020-07-04T09:54:21Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2020-07-10T11:59:29Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9960251379802186
      ],
      "excerpt": "In this project, you will apply the skills that you have acquired in this 2D medical imaging course  to analyze data from the NIH Chest X-ray Dataset and train a CNN to classify a given chest x-ray for the presence or absence of pneumonia. This project will culminate in a model that can predict the presence of pneumonia with human radiologist-level accuracy that can be prepared for submission to the FDA for 510(k) clearance as software as a medical device. As part of the submission preparation, you will formally describe your model, the data that it was trained on, and a validation plan that meets FDA criteria. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9562099484052093
      ],
      "excerpt": "The project will include access to a GPU for fast training of deep learning architecture, as well as access to 112,000 chest x-rays with disease labels  acquired from 30,000 patients. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9912488864888862,
        0.9967940013694948,
        0.9444386237508038,
        0.9634566936046125
      ],
      "excerpt": "When it comes to pneumonia, chest X-rays are the best available method for diagnosis. More than 1 million adults are hospitalized with pneumonia and around 50,000 die from the disease every \nyear in the US alone. The high prevalence of pneumonia makes it a good candidate for the development of a deep learning application for two reasons: 1) Data availability in a high enough quantity for training deep learning models for image classification 2) Opportunity for clinical aid by providing higher accuracy image reads of a difficult-to-diagnose disease and/or reduce clinical burnout by performing automated reads of very common scans.  \nThe diagnosis of pneumonia from chest X-rays is difficult for several reasons:  \n1. The appearance of pneumonia in a chest X-ray can be very vague depending on the stage of the infection \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9917525483215579,
        0.9865861111494237,
        0.8642222810537064,
        0.8434837336189211
      ],
      "excerpt": "For these reasons, common methods of diagnostic validation performed in the clinical setting are to obtain sputum cultures to test for the presence of bacteria or viral bodies that cause pneumonia, reading the patient's clinical history and taking their demographic profile into account, and comparing a current image to prior chest X-rays for the same patient if they are available. \nThe dataset provided to you for this project was curated by the NIH specifically to address the problem of a lack of large x-ray datasets with ground truth labels to be used in the creation of disease detection algorithms.  \nThe data is mounted in the Udacity Jupyter GPU workspace provided to you, along with code to load the data. Alternatively, you can download the data from the kaggle website and run it locally. You are STRONGLY recommended to complete the project using the Udacity workspace since the data is huge, and you will need GPU to accelerate the training process. \nThere are 112,120 X-ray images with disease labels from 30,805 unique patients in this dataset.  The disease labels were created using Natural Language Processing (NLP) to mine the associated radiological reports. The labels include 14 common thoracic pathologies:  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9495862137011373
      ],
      "excerpt": "The biggest limitation of this dataset is that image labels were NLP-extracted so there could be some erroneous labels but the NLP labeling accuracy is estimated to be >90%. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9898674411359151,
        0.9979369600265219,
        0.9311450075853481
      ],
      "excerpt": "The first part of this project will involve exploratory data analysis (EDA) to understand and describe the content and nature of the data. \nNote that much of the work performed during your EDA will enable the completion of the final component of this project which is focused on documentation of your algorithm for the FDA. This is described in a later section, but some important things to focus on during your EDA may be:  \nThe patient demographic data such as gender, age, patient position,etc. (as it is available) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9802704095460228
      ],
      "excerpt": "The distribution of other diseases that are comorbid with pneumonia \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9798180866128636
      ],
      "excerpt": "Pixel-level assessments of the imaging data for healthy & disease states of interest (e.g. histograms of intensity values) and compare distributions across diseases. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.97282679448549,
        0.9077262476229331
      ],
      "excerpt": "From your findings in the EDA component of this project, curate the appropriate training and validation sets for classifying pneumonia. Be sure to take the following into consideration:  \nDistribution of diseases other than pneumonia that are present in both datasets \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9820486113237982
      ],
      "excerpt": "In this project, you will fine-tune an existing CNN architecture to classify x-rays images for the presence of pneumonia. There is no required archictecture required for this project, but a reasonable choice would be using the VGG16 architecture with weights trained on the ImageNet dataset. Fine-tuning can be performed by freezing your chosen pre-built network and adding several new layers to the end to train, or by doing this in combination with selectively freezing and training some layers of the pre-trained network.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9778113912406394
      ],
      "excerpt": "You may choose or need to do some amount of preprocessing prior to feeding imagees into your network for training and validating. This may serve the purpose of conforming to your model's architecture and/or for the purposes of augmenting your training dataset for increasing your model performance. When performing image augmentation, be sure to think about augmentation parameters that reflect real-world differences that may be seen in chest X-rays.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.888574834087695
      ],
      "excerpt": "In training your model, there are many parameters that can be tweaked to improve performance including:  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9364415600634781,
        0.8311289201569818
      ],
      "excerpt": "* Inclusion and parameters of specific layers in your model  \nYou will be asked to provide descriptions of the methods by which given parameters were chosen in the final FDA documentation. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9481486139534537,
        0.9786811856020146,
        0.9703333507950739
      ],
      "excerpt": "Note that detecting pneumonia is hard even for trained expert radiologists, so you should not expect to acheive sky-high performance. This paper describes some human-reader-level F1 scores for detecting pneumonia, and can be used as a reference point for how well your model could perform. \nThe imaging data provided to you for training your model was transformed from DICOM format into .png to help aid in the image pre-processing and model training steps of this project. In the real world, however, the pixel-level imaging data are contained inside of standard DICOM files.  \nFor this project, create a DICOM wrapper that takes in a standard DICOM file and outputs data in the format accepted by your model. Be sure to include several checks in your wrapper for the following:  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9747524441521177
      ],
      "excerpt": "For this project, you will complete the following steps that are derived from the FDA's official guidance on both the algorithm description and the algorithm performance assessment. Much of this portion of the project relies on what you did during your EDA, model building, and model training. Use figures and statistics from those earlier parts in completing the following documentation. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8620109807112113,
        0.8518644112188635
      ],
      "excerpt": "The architecture of the classifier \nFor each stage of your algorithm, briefly describe the design and function. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8828443023787842
      ],
      "excerpt": "Describe the following parameters of your algorithm and how they were chosen:  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8860851013624382
      ],
      "excerpt": "Also describe the behavior of the following throughout training (use visuals to show): \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8648879350488186
      ],
      "excerpt": "Finally, report the threshold for classification that you chose and the corresponded F1 score, recall, and precision. Give one or two sentences of explanation for why you chose this threshold value.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9678020701691825,
        0.8377872937158486,
        0.8351706895523211,
        0.9754876168888804
      ],
      "excerpt": "For the database of patient data used, provide specific information about the training and validation datasets that you curated separately, including:  \nSize of the dataset \nThe number of positive cases and the its radio to the number of negative cases \nThe patient demographic data (as it is available) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9808313562274644
      ],
      "excerpt": "The co-occurrence frequencies of pneumonia with other diseases and findings \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9888227005882643
      ],
      "excerpt": "The methodology used to establish the ground truth can impact reported performance. Describe how the NIH created the ground truth for the data that was provided to you for this project. Describe the benefits and limitations of this type of ground truth.   \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8688763853049287
      ],
      "excerpt": "Type of imaging modality \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9663454808386875,
        0.8487017416612481
      ],
      "excerpt": "Prevalence of disease of interest \nAny other diseases that should be included or excluded as comorbidities in the population \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "analysis of identifying the pneumonia using X-Rays",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/Raghuvar/pneumonia_detection_using_X-rays/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 2,
      "date": "Sun, 26 Dec 2021 04:46:27 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/Raghuvar/pneumonia_detection_using_X-rays/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "Raghuvar/pneumonia_detection_using_X-rays",
    "technique": "GitHub API"
  },
  "hasExecutableNotebook": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://raw.githubusercontent.com/Raghuvar/pneumonia_detection_using_X-rays/master/downloader.ipynb",
      "https://raw.githubusercontent.com/Raghuvar/pneumonia_detection_using_X-rays/master/Build%20and%20train%20model.ipynb",
      "https://raw.githubusercontent.com/Raghuvar/pneumonia_detection_using_X-rays/master/Untitled.ipynb",
      "https://raw.githubusercontent.com/Raghuvar/pneumonia_detection_using_X-rays/master/Inference.ipynb",
      "https://raw.githubusercontent.com/Raghuvar/pneumonia_detection_using_X-rays/master/EDA.ipynb"
    ],
    "technique": "File Exploration"
  },
  "installation": [
    {
      "confidence": [
        0.847737192505054
      ],
      "excerpt": "Any pre-algorithm checks you perform on your DICOM \n",
      "technique": "Supervised classification"
    }
  ],
  "invocation": [
    {
      "confidence": [
        0.8174540907975313
      ],
      "excerpt": "Training  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.843422915301725
      ],
      "excerpt": "* Training batch size \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/Raghuvar/pneumonia_detection_using_X-rays/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Jupyter Notebook"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Pneumonia Detection from Chest X-Rays",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "pneumonia_detection_using_X-rays",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "Raghuvar",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/Raghuvar/pneumonia_detection_using_X-rays/blob/master/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 1,
      "date": "Sun, 26 Dec 2021 04:46:27 GMT"
    },
    "technique": "GitHub API"
  }
}