{
  "arxivLinks": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://arxiv.org/abs/1705.06830"
    ],
    "technique": "Regular expression"
  },
  "citation": [
    {
      "confidence": [
        0.8650879946950151
      ],
      "excerpt": "Basé sur cet article et cette page TF Hub.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8356013927728488
      ],
      "excerpt": "Paul BUCAMP \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8356013927728488
      ],
      "excerpt": "Notre étude s'est tout d’abord portée sur le modèle NST de d2l se basant sur une optimisation par entraînement. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9998033479129727
      ],
      "excerpt": "Redimensionnement des images à la même taille : on garde le ratio de l'image de contenu en diminuant la taille si besoin afin de réduire la durée de l'entraînement. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9999998305592755,
        0.9502140581228744,
        0.9999257357631157
      ],
      "excerpt": "De manière générale, le modèle tire parti des représentations en couches d’un réseau neuronal convolutif (CNN) afin d’appliquer automatiquement le style d’une image à une autre image. Pour cela, deux images sont utilisées : l’image de contenu et l’image de style. Un réseau neuronal est ensuite utilisé pour modifier l’image de contenu pour la rendre proche en style de l’image de style. Il s’agit donc d'optimiser l’image de contenu avec l’image de style. \nLa méthode présentée par d2l considère l’image synthétisée (en sortie) comme les paramètres d’un modèle, initialisé avec l’image de contenu.  \nL’algorithme utilise un modèle pré-entraîné d’extraction hiérarchique de caractéristiques. Composé de plusieurs couches, on peut choisir la sortie de certains d’entre eux comme caractéristique de contenu ou de style.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9700494325394076,
        0.8707921115408231,
        0.9847135926867628,
        0.9990438480639905
      ],
      "excerpt": "Les fonctions de perte sont calculées à travers une forward propagation, puis les paramètres du modèle (l’image synthétisée en sortie) sont mis jour à travers une back propagation.  \nOn compte 3 fonctions de perte :  \ncontent loss (rend l'image synthétisée et l'image de contenu proches en terme de contenu) ; \nstyle loss (rend l'image synthétisée et l'image de style proches en terme de style) ; \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9504763884891976
      ],
      "excerpt": "A la fin de l’entraînement, les paramètres du modèle sont récupérés pour générer l’image synthétisée finale. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.999998985057747
      ],
      "excerpt": "La mise à jour itérative d'une image pour synthétiser une texture visuelle ou un transfert de style artistique à une image est une procédure d'optimisation lente. Elle exclut aussi toute possibilité d'apprentissage d'une représentation d'un style de peinture. De plus, la modification des (hyper)paramètres n'apportent pas beaucoup de changements sur l'image synthétisée à la fin de son optimisation. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9999186073929216,
        0.9864633984068458,
        0.9999999976050447,
        0.9999998541313708,
        0.9999999998889848,
        0.9999999851885947,
        0.9851576054070618,
        0.9962061571389547,
        0.999634466428013
      ],
      "excerpt": "Les images entrées par l'utilisateur sont d'abord réduites en taille pour réduire le temps de calcul (et le temps d'envoi pour la version en ligne). Un URI en base 64 est crée pour chaque image et envoyé au serveur avant d'être passé à la fonction de prédiction en elle-même. Enfin, unee fois chargées sous forme matricielle, la valeur de chaque pixel est normalisée. \nLes travaux sur le NST ont tout d’abord porté sur une méthode d'optimisation par mise à jour itérative de l’image synthétisée tel que pour la méthode de présentée ci-dessus. \nEnsuite, d’autres travaux ont introduit un second réseau apprenant la transformation de l’image de contenu à sa version artistique. Ce réseau de transfert de style est un réseau de neurones convolutifs formulé dans la structure d'un codeur/décodeur. Le réseau résultant peut réaliser le transfert de style d’une image beaucoup plus rapidement, mais un réseau distinct doit être entraîné pour chaque style de peinture. Cela représente du gaspillage dans la mesure où certains styles de peintures partagent des textures, des palettes de couleurs ou sémantiques d’identification de scène communes.  \nL’idée suivante a donc été de construire un réseau de transfert de style avec une architecture typique encoder/decoder mais spécialisant les paramètres de normalisation pour chaque style de peinture : conditional instance normalization, la normalisation de chaque unité d’activation, de sorte que la transformation linéaire de chaque peinture soit unique. Ainsi, un vecteur d’intégration (embedding) d’environ 300-d représente le style artistique d’une peinture. \nEn explorant cette question, un fait très surprenant a été trouvé sur le rôle de la normalisation dans les réseaux de transfert de style : pour modéliser un style, il suffit de spécialiser les paramètres de mise à l'échelle et de décalage après la normalisation à chaque style spécifique. En d'autres termes, tous les poids convolutifs d'un réseau de transfert de style peuvent être partagés entre de nombreux styles, et il suffit de régler les paramètres pour une transformation affine après normalisation pour chaque style. \nLe modèle NST de Google Brain est donc la combinaison de modèles dont la méthode est d’apprendre la caractérisation de l’image de style aux paramètres de style directement. Dans le cas du modèle de Google Brain, pour faire le NST d’une image de style vers une image de contenu, deux réseaux sont utilisés : le style transfer <img src=\"https://render.githubusercontent.com/render/math?math=T(.%2C%5Cvec%20S)\"> et le style prediction <img src=\"https://render.githubusercontent.com/render/math?math=P(.)\">.  \nRéseau <img src=\"https://render.githubusercontent.com/render/math?math=T\">:  <img src=\"https://render.githubusercontent.com/render/math?math=T(.%2C%5Cvec%20S)\"> peut ainsi faire le transfert de style en une seule propagation avant de n’importe quelle image de style à partir du moment qu’on connaît le vecteur <img src=\"https://render.githubusercontent.com/render/math?math=%5Cvec%20S%20%3D%20(%5Cgamma_s%2C%20%5Cbeta_s)\">, calculé par le réseau <img src=\"https://render.githubusercontent.com/render/math?math=P(.)\">. \n<img src=\"https://render.githubusercontent.com/render/math?math=T(.%2C%5Cvec%20S)\"> utilise la normalisation pour transformer une couche d'activation <img src=\"https://render.githubusercontent.com/render/math?math=z\"> en une activation normalisée <img src=\"https://render.githubusercontent.com/render/math?math=%5Ctilde%20z\"> spécifique à un style <img src=\"https://render.githubusercontent.com/render/math?math=s\"> de sorte que <img src=\"https://render.githubusercontent.com/render/math?math=%5Ctilde%20z%20%3D%20%5Cgamma_s%5Cleft(%5Cfrac%7Bz%20-%20%5Cmu%7D%7B%5Csigma%7D%5Cright)%20%2B%20%5Cbeta_s\">, où <img src=\"https://render.githubusercontent.com/render/math?math=%5Cfrac%7Bz%20-%20%5Cmu%7D%7B%5Csigma%7D\"> représente la couche <img src=\"https://render.githubusercontent.com/render/math?math=z\"> normalisée, et <img src=\"https://render.githubusercontent.com/render/math?math=%5Ctilde%20z\"> est la normalisation d'instance conditionnelle. Ils effectuent une mise à l'échelle et un déplacement à l'aide de vecteurs de paramètres dépendants du style. \nRéseau <img src=\"https://render.githubusercontent.com/render/math?math=P\">: Le réseau <img src=\"https://render.githubusercontent.com/render/math?math=P(.)\"> fait la prédiction du vecteur <img src=\"https://render.githubusercontent.com/render/math?math=%5Cvec%20S\"> à partir de l’image de style donnée en entrée. Il est basé sur le modèle pré-entraîné Inception-v3 : selon l’article, il calcule la moyenne à travers tous les channels d’activation de la couche Mixed-6e et retourne un feature vector sur lequel il applique 2 couches fully-connected pour prédire <img src=\"https://render.githubusercontent.com/render/math?math=%5Cvec%20S\">. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9865374311292784,
        0.9992485561361633,
        0.9997120744252818
      ],
      "excerpt": "Cette méthode est très avantageuse, que ce soit par la qualité des résultats produits, par la vitesse de rendu, ou par l'étendue des styles compatibles.  \nDes améliorations d'ordre pratique pourraient être faites au niveau de l'interface utilisateur, comme le choix de la taille de l'image de sortie. \nNous avons mis en place une plateforme d'essai du modèle de Google Brain en utilisant le code disponible sur TF Hub et en l'intégrant à un serveur Python en utilisant Flask. Le serveur dispose d'une interface web (HTML/CSS/JS) qui permet à l'utilisateur de choisir une image de style et une image de contenu et d'obtenir le résultat du transfert de style. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9939383674869147,
        0.8348362997093185
      ],
      "excerpt": "Cliquer sur les boutons Browse pour choisir une image de contenu et de style :  \nUne miniature de prévisualisation apparaît pour chaque image. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9538405059445785
      ],
      "excerpt": "Actuellement, les méthodes et modèles présentés réalisent le transfert de style d'une image à une autre image, typiquement d'une peinture ou texture à une photographie. Une autre application du NST serait l'application d'un style calligraphique à du texte. Ensuite, une possibilité serait l'application d'un style visuel (peinture/texture) en temps réel à une vidéo. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9874896680299456,
        0.9972474703159213
      ],
      "excerpt": "Tutoriel de NST d2l : https://d2l.ai/chapter_computer-vision/neural-style.html  \nInception-v3, Rethinking the Inception Architecture for Computer Vision : https://arxiv.org/pdf/1512.00567.pdf  \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/RemiArbache/style-transfer-M2",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-10-03T15:00:30Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-11-05T21:08:50Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        1
      ],
      "excerpt": "Le NST permet, à partir d'une image de contenu (ex: une photo) et d'une image de référence de style (ex: une peinture), de créer une image qui maintienne le contenu de la première tout en reproduisant le style de la seconde. [Source](https://www.tensorflow.org/tutorials/generative/style_transfer )\n\nAutrement dit, l’algorithme NST manipule des images dans le but de leur donner l’apparence ou le style visuel d’une autre image. Ces algorithmes utilisent des réseaux neuronaux profonds pour pouvoir réaliser la transformation d’images.\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        1
      ],
      "excerpt": "Ce projet a pour objectif la découverte du Neural Style Transfer (NST) à travers l’utilisation des modèles de d2l et de Google Brain. L'objectif est de réaliser un transfert d'une image de style à une image de contenu, et et de créer un site web d’application du modèle de Google Brain. \nCe readMe permet d’expliquer la méthode de NST de d2l suivant un principe d’optimisation pour ensuite la comparer avec la méthode de Google Brain qui permet l’obtention en une boucle de l’image synthétisée sans entraînement préalable sur les images données en entrée.\nCe dépôt contient la mise en place d'un site web / API pour faire la démonstration de l’application du modèle choisi, créé par Google Brain, prenant des images en entrée pour donner en sortie l’image synthétisée.\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        0.8070593771974934
      ],
      "excerpt": "Schéma exemple avec un CNN d’extraction de caractéristiques à 3 couches : \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "Academic project aiming to experiment with Neural Style Transfer",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/RemiArbache/style-transfer-M2/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 0,
      "date": "Sun, 26 Dec 2021 23:53:33 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/RemiArbache/style-transfer-M2/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "RemiArbache/style-transfer-M2",
    "technique": "GitHub API"
  },
  "hasExecutableNotebook": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://raw.githubusercontent.com/RemiArbache/style-transfer-M2/main/notebook/neural_style.ipynb"
    ],
    "technique": "File Exploration"
  },
  "installation": [
    {
      "confidence": [
        0.914915317283376,
        0.9717106327039013
      ],
      "excerpt": "python -m flask run \nVersion disponible en ligne hebergée par Heroku. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8773344959568669
      ],
      "excerpt": "La version déployée en ligne peut présenter des performances réduites car Heroku ne supporte pas tensorflow-gpu et utilise donc tensorflow-cpu. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.834708152648845
      ],
      "excerpt": "Code Inception-v3 GitHub : https://github.com/pytorch/vision/blob/6db1569c89094cf23f3bc41f79275c45e9fcb3f3/torchvision/models/inception.py#L64  \n",
      "technique": "Supervised classification"
    }
  ],
  "invocation": [
    {
      "confidence": [
        0.8295854008755725
      ],
      "excerpt": "python -m flask run \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8921498016224351
      ],
      "excerpt": "Deux images (.png, .jpg) \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.885229443891788
      ],
      "excerpt": "| <img src=\"images/paysage.jpg\" alt=\"paysage\" style=\"zoom:75%;\" /> |        |  | \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.885229443891788
      ],
      "excerpt": "| <img src=\"images/paysage.jpg\" alt=\"paysage\" style=\"zoom:75%;\" /> |        |  | \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8213380337316241
      ],
      "excerpt": "Cliquer sur le bouton Predict pour obtenir un résultat : \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/RemiArbache/style-transfer-M2/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Jupyter Notebook",
      "HTML",
      "JavaScript",
      "Python",
      "Shell"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "name": "MIT License",
      "url": "https://api.github.com/licenses/mit"
    },
    "technique": "GitHub API"
  },
  "licenseText": {
    "confidence": [
      1.0
    ],
    "excerpt": "b'MIT License\\n\\nCopyright (c) 2021 RemiArbache\\n\\nPermission is hereby granted, free of charge, to any person obtaining a copy\\nof this software and associated documentation files (the \"Software\"), to deal\\nin the Software without restriction, including without limitation the rights\\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\\ncopies of the Software, and to permit persons to whom the Software is\\nfurnished to do so, subject to the following conditions:\\n\\nThe above copyright notice and this permission notice shall be included in all\\ncopies or substantial portions of the Software.\\n\\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\\nSOFTWARE.\\n'",
    "technique": "File Exploration"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "style-transfer-M2",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "style-transfer-M2",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "RemiArbache",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/RemiArbache/style-transfer-M2/blob/main/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 0,
      "date": "Sun, 26 Dec 2021 23:53:33 GMT"
    },
    "technique": "GitHub API"
  }
}