{
  "arxivLinks": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://arxiv.org/abs/1807.08518\n\n**Our key contribution is not to implement a Neural Turing Machine in code but to make training stable and reliable. We do not observe the slow learning or gradients becoming NaN that other implementations have reported.**\n\nYou can cite the paper as follows:\n\n```\n@article{collierbeel2018ntms, title={Implementing Neural Turing Machines,\nauthor={Collier, Mark and Beel, Joeran},\njournal={International Conference on Artificial Neural Networks, ICANN.}, year={2018}}\n```\n\nThis work was done with [Joeran Beel](https://www.scss.tcd.ie/joeran.beel/",
      "https://arxiv.org/abs/1410.5401",
      "https://arxiv.org/abs/1410.5401"
    ],
    "technique": "Regular expression"
  },
  "citation": [
    {
      "confidence": [
        0.9086892148066392
      ],
      "excerpt": "Optimizer: RMSProp - learning rate = 10^-4 \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/swampxx/Ntm-Mann",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2019-06-21T12:57:57Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2019-07-11T07:58:12Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9478662172928489,
        0.9283035792980974
      ],
      "excerpt": "This repository contains a stable, successful Tensorflow implementation of a Neural Turing Machine which has been tested on the Copy, Repeat Copy and Associative Recall tasks from the original paper. \nBelow are some sample outputs on the Copy and Associative Recall tasks. We replicated the hyperparameters from the original paper for the 2 tasks: \n",
      "technique": "Supervised classification"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/swampxx/Ntm-Mann/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 0,
      "date": "Wed, 29 Dec 2021 23:56:25 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/swampxx/Ntm-Mann/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "swampxx/Ntm-Mann",
    "technique": "GitHub API"
  },
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/swampxx/Ntm-Mann/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Python"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "name": "GNU Lesser General Public License v3.0",
      "url": "https://api.github.com/licenses/lgpl-3.0"
    },
    "technique": "GitHub API"
  },
  "licenseText": {
    "confidence": [
      1.0
    ],
    "excerpt": "b'                   GNU LESSER GENERAL PUBLIC LICENSE\\n                       Version 3, 29 June 2007\\n\\n Copyright (C) 2007 Free Software Foundation, Inc. http://fsf.org/\\n Everyone is permitted to copy and distribute verbatim copies\\n of this license document, but changing it is not allowed.\\n\\n\\n  This version of the GNU Lesser General Public License incorporates\\nthe terms and conditions of version 3 of the GNU General Public\\nLicense, supplemented by the additional permissions listed below.\\n\\n  0. Additional Definitions.\\n\\n  As used herein, \"this License\" refers to version 3 of the GNU Lesser\\nGeneral Public License, and the \"GNU GPL\" refers to version 3 of the GNU\\nGeneral Public License.\\n\\n  \"The Library\" refers to a covered work governed by this License,\\nother than an Application or a Combined Work as defined below.\\n\\n  An \"Application\" is any work that makes use of an interface provided\\nby the Library, but which is not otherwise based on the Library.\\nDefining a subclass of a class defined by the Library is deemed a mode\\nof using an interface provided by the Library.\\n\\n  A \"Combined Work\" is a work produced by combining or linking an\\nApplication with the Library.  The particular version of the Library\\nwith which the Combined Work was made is also called the \"Linked\\nVersion\".\\n\\n  The \"Minimal Corresponding Source\" for a Combined Work means the\\nCorresponding Source for the Combined Work, excluding any source code\\nfor portions of the Combined Work that, considered in isolation, are\\nbased on the Application, and not on the Linked Version.\\n\\n  The \"Corresponding Application Code\" for a Combined Work means the\\nobject code and/or source code for the Application, including any data\\nand utility programs needed for reproducing the Combined Work from the\\nApplication, but excluding the System Libraries of the Combined Work.\\n\\n  1. Exception to Section 3 of the GNU GPL.\\n\\n  You may convey a covered work under sections 3 and 4 of this License\\nwithout being bound by section 3 of the GNU GPL.\\n\\n  2. Conveying Modified Versions.\\n\\n  If you modify a copy of the Library, and, in your modifications, a\\nfacility refers to a function or data to be supplied by an Application\\nthat uses the facility (other than as an argument passed when the\\nfacility is invoked), then you may convey a copy of the modified\\nversion:\\n\\n   a) under this License, provided that you make a good faith effort to\\n   ensure that, in the event an Application does not supply the\\n   function or data, the facility still operates, and performs\\n   whatever part of its purpose remains meaningful, or\\n\\n   b) under the GNU GPL, with none of the additional permissions of\\n   this License applicable to that copy.\\n\\n  3. Object Code Incorporating Material from Library Header Files.\\n\\n  The object code form of an Application may incorporate material from\\na header file that is part of the Library.  You may convey such object\\ncode under terms of your choice, provided that, if the incorporated\\nmaterial is not limited to numerical parameters, data structure\\nlayouts and accessors, or small macros, inline functions and templates\\n(ten or fewer lines in length), you do both of the following:\\n\\n   a) Give prominent notice with each copy of the object code that the\\n   Library is used in it and that the Library and its use are\\n   covered by this License.\\n\\n   b) Accompany the object code with a copy of the GNU GPL and this license\\n   document.\\n\\n  4. Combined Works.\\n\\n  You may convey a Combined Work under terms of your choice that,\\ntaken together, effectively do not restrict modification of the\\nportions of the Library contained in the Combined Work and reverse\\nengineering for debugging such modifications, if you also do each of\\nthe following:\\n\\n   a) Give prominent notice with each copy of the Combined Work that\\n   the Library is used in it and that the Library and its use are\\n   covered by this License.\\n\\n   b) Accompany the Combined Work with a copy of the GNU GPL and this license\\n   document.\\n\\n   c) For a Combined Work that displays copyright notices during\\n   execution, include the copyright notice for the Library among\\n   these notices, as well as a reference directing the user to the\\n   copies of the GNU GPL and this license document.\\n\\n   d) Do one of the following:\\n\\n       0) Convey the Minimal Corresponding Source under the terms of this\\n       License, and the Corresponding Application Code in a form\\n       suitable for, and under terms that permit, the user to\\n       recombine or relink the Application with a modified version of\\n       the Linked Version to produce a modified Combined Work, in the\\n       manner specified by section 6 of the GNU GPL for conveying\\n       Corresponding Source.\\n\\n       1) Use a suitable shared library mechanism for linking with the\\n       Library.  A suitable mechanism is one that (a) uses at run time\\n       a copy of the Library already present on the user\\'s computer\\n       system, and (b) will operate properly with a modified version\\n       of the Library that is interface-compatible with the Linked\\n       Version.\\n\\n   e) Provide Installation Information, but only if you would otherwise\\n   be required to provide such information under section 6 of the\\n   GNU GPL, and only to the extent that such information is\\n   necessary to install and execute a modified version of the\\n   Combined Work produced by recombining or relinking the\\n   Application with a modified version of the Linked Version. (If\\n   you use option 4d0, the Installation Information must accompany\\n   the Minimal Corresponding Source and Corresponding Application\\n   Code. If you use option 4d1, you must provide the Installation\\n   Information in the manner specified by section 6 of the GNU GPL\\n   for conveying Corresponding Source.)\\n\\n  5. Combined Libraries.\\n\\n  You may place library facilities that are a work based on the\\nLibrary side by side in a single library together with other library\\nfacilities that are not Applications and are not covered by this\\nLicense, and convey such a combined library under terms of your\\nchoice, if you do both of the following:\\n\\n   a) Accompany the combined library with a copy of the same work based\\n   on the Library, uncombined with any other library facilities,\\n   conveyed under the terms of this License.\\n\\n   b) Give prominent notice with the combined library that part of it\\n   is a work based on the Library, and explaining where to find the\\n   accompanying uncombined form of the same work.\\n\\n  6. Revised Versions of the GNU Lesser General Public License.\\n\\n  The Free Software Foundation may publish revised and/or new versions\\nof the GNU Lesser General Public License from time to time. Such new\\nversions will be similar in spirit to the present version, but may\\ndiffer in detail to address new problems or concerns.\\n\\n  Each version is given a distinguishing version number. If the\\nLibrary as you received it specifies that a certain numbered version\\nof the GNU Lesser General Public License \"or any later version\"\\napplies to it, you have the option of following the terms and\\nconditions either of that published version or of any later version\\npublished by the Free Software Foundation. If the Library as you\\nreceived it does not specify a version number of the GNU Lesser\\nGeneral Public License, you may choose any version of the GNU Lesser\\nGeneral Public License ever published by the Free Software Foundation.\\n\\n  If the Library as you received it specifies that a proxy can decide\\nwhether future versions of the GNU Lesser General Public License shall\\napply, that proxy\\'s public statement of acceptance of any version is\\npermanent authorization for you to choose that version for the\\nLibrary.\\n'",
    "technique": "File Exploration"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Neural Turing Machine",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "Ntm-Mann",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "swampxx",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/swampxx/Ntm-Mann/blob/master/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 0,
      "date": "Wed, 29 Dec 2021 23:56:25 GMT"
    },
    "technique": "GitHub API"
  },
  "usage": [
    {
      "confidence": [
        1
      ],
      "excerpt": "```python\nfrom ntm import NTMCell\n\ncell = NTMCell(num_controller_layers, num_controller_units, num_memory_locations, memory_size,\n    num_read_heads, num_write_heads, shift_range=3, output_dim=num_bits_per_output_vector,\n    clip_value=clip_controller_output_to_value)\n\noutputs, _ = tf.nn.dynamic_rnn(\n    cell=cell,\n    inputs=inputs,\n    time_major=False)\n```\n\nThe implementation is derived from https://github.com/snowkylin/ntm, another open source NTM implementation. We make small but meaningful changes to the linked code that have a large effect on making our implementation more reliable to train and faster to converge as well as being easier to integrate with Tensorflow. Our contribution is:\n- We compare three different memory initialization schemes and find that initializing the memory contents of a Neural Turing Machine to small constant values works much better than random initilization or backpropagating through memory initialization.\n- We clip the outputs from the NTM controller into a range, which helps with optimization difficulties.\n- The NTMCell implements the [Tensorflow RNNCell interface](https://www.tensorflow.org/api_docs/python/tf/contrib/rnn/RNNCell) so can be used directly with [tf.nn.dynamic_rnn](https://www.tensorflow.org/api_docs/python/tf/nn/dynamic_rnn), etc.\n- We never see loss go to NaN as some other implementations report.\n- We implement 3 of the 5 tasks from the NTM paper. We run many experiments and report convergence speed and generalization performance for our implementation, compared to an LSTM, a DNC and for 3 memory contents initialization schemes.\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        1
      ],
      "excerpt": "![Neural Turing Machine Copy Task - Seq len=20](/img/copy_ntm_20_0.png)\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        1
      ],
      "excerpt": "![Neural Turing Machine Copy Task - Seq len=40](/img/copy_ntm_40_1.png)\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        1
      ],
      "excerpt": "![Neural Turing Machine Associate Recall Task - Seq len=6 items](/img/associative_recall_ntm_6_0.png)\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        1
      ],
      "excerpt": "![Neural Turing Machine Associate Recall Task - Seq len=12 items](/img/associative_recall_ntm_12_0.png)\n\nIn order to interpret how the NTM used its external memory we trained a network with 32 memory locations on the Copy task and graphed the read and write head address locations over time.\n\nAs you can see from the below graphs, the network first writes the sequence to memory and then reads it back in the same order it wrote it to memory. This uses both the content and location based addressing capabilities of the NTM. The pattern of writes followed by reads is what we would expect of a reasonable solution to the Copy task.\n\n",
      "technique": "Header extraction"
    }
  ]
}