{
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/tdrussell/IllustrationGAN",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2016-08-30T15:38:42Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-11-30T10:08:28Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9316286914962396,
        0.8340572329346629,
        0.8748861764523572,
        0.9178375792983713,
        0.9568221214402907,
        0.9788782496125324,
        0.8128672742154842,
        0.9253543359307231
      ],
      "excerpt": "A simple, clean TensorFlow implementation of Generative Adversarial Networks with a focus on modeling illustrations. \nThese images were generated by the model after being trained on a custom dataset of about 20,000 anime faces that were automatically cropped from illustrations using a face detector. \nIt is theoretically possible for the generator network to memorize training set images rather than actually generalizing and learning to produce novel images of its own. To check for this, I randomly generate images and display the \"closest\" images in the training set according to mean squared error. The top row is randomly generated images, the columns are the closest 5 images in the training set. \nIt is clear that the generator does not merely learn to copy training set images, but rather generalizes and is able to produce its own unique images. \nGenerative Adversarial Networks consist of two neural networks: a discriminator and a generator. The discriminator receives both real images from the training set and generated images produced by the generator. The discriminator outputs the probability that an image is real, so it is trained to output high values for the real images and low values for the generated ones. The generator is trained to produce images that the discriminator thinks are real. Both the discriminator and generator are trainined simultaneously so that they compete against each other. As a result of this, the generator learns to produce more and more realistic images as it trains. \nThe model is based on DCGANs, but with a few important differences: \nNo strided convolutions. The generator uses bilinear upsampling to upscale a feature blob by a factor of 2, followed by a stride-1 convolution layer. The discriminator uses a stride-1 convolution followed by 2x2 max pooling. \nMinibatch discrimination. See Improved Techniques for Training GANs for more details. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9844728928861602
      ],
      "excerpt": "A novel regularization term applied to the generator network. Normally, increasing the number of fully connected layers in the generator beyond one triggers one of the most common failure modes when training GANs: the generator \"collapses\" the z-space and produces only a very small number of unique examples. In other words, very different z vectors will produce nearly the same generated image. To fix this, I add a small auxiliary z-predictor network that takes as input the output of the last fully connected layer in the generator, and predicts the value of z. In other words, it attempts to learn the inverse of whatever function the generator fully connected layers learn. The z-predictor network and generator are trained together to predict the value of z. This forces the generator fully connected layers to only learn those transformations that preserve information about z. The result is that the aformentioned collapse no longer occurs, and the generator is able to leverage the power of the additional fully connected layers. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "A simple, clean TensorFlow implementation of Generative Adversarial Networks with a focus on modeling illustrations.",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/tdrussell/IllustrationGAN/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 53,
      "date": "Mon, 27 Dec 2021 15:54:58 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/tdrussell/IllustrationGAN/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "tdrussell/IllustrationGAN",
    "technique": "GitHub API"
  },
  "installation": [
    {
      "confidence": [
        0.9597097124156551
      ],
      "excerpt": "Dependencies: TensorFlow, PrettyTensor, numpy, matplotlib \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/tdrussell/IllustrationGAN/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Python"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "IllustrationGAN",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "IllustrationGAN",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "tdrussell",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/tdrussell/IllustrationGAN/blob/master/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 264,
      "date": "Mon, 27 Dec 2021 15:54:58 GMT"
    },
    "technique": "GitHub API"
  }
}