{
  "citation": [
    {
      "confidence": [
        0.8944178096468923
      ],
      "excerpt": "Video surveillance \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9944484218006108,
        0.9912556242864674,
        0.9944484218006108
      ],
      "excerpt": "[1] https://arxiv.org/pdf/2001.05566.pdf \n[2] https://arxiv.org/pdf/2007.00047.pdf \n[3] https://arxiv.org/pdf/2108.11250v1.pdf \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/ThanhPham1987/Segmentation",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-06-09T05:19:46Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2021-11-25T03:10:46Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.8922751718234522
      ],
      "excerpt": "Semantic segmentation performs pixel-level labeling with a set of object categories (e.g., human, car, tree, sky) for all image pixels.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.88997382147096
      ],
      "excerpt": "Medical image analysis (tumor boundary extraction and measurement of tissue volumes). \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9987280700425724,
        0.9852823283372347
      ],
      "excerpt": "This section provides a detailed review of more than a hundred deep learning-based segmentation methods proposed until 2019, grouped into 10 categories (based on their model architecture). It is worth mentioning that there are some pieces that are common among many of these works, such as having encoder and decoder parts, skip-connections, multi-scale analysis, and more recently the use of dilated convolution. Because of this, it is difficult to mention the unique contributions of each work, but easier to group them based on their underlying architectural contribution over previous works. Besides the architectural categorization \nof these models, one can also group them based on the segmentation goal into: semantic, instance, panoptic, and depth segmentation categories. But due to the big difference in terms of volume of work in those tasks, we decided to follow the architectural grouping. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9894255754277557,
        0.9700103223826373,
        0.9967409458985791,
        0.9924747801742523
      ],
      "excerpt": "Long et al. [31] proposed one of the first deep learning works for semantic image segmentation, using a fully convolutional network (FCN). An FCN (Figure 7) includes only convolutional layers, which enables it to take an image of arbitrary size and produce a segmentation map of the same size. The authors modified existing CNN architectures, such as VGG16 and GoogLeNet, to manage non-fixed sized input and output, by replacing all fully-connected layers with the fully-convolutional layers. As a result, the model outputs a spatial segmentation map instead of classification scores. \nThrough the use of skip connections in which featuremaps from the final layers of the model are up-sampled and fused with feature maps of earlier layers (Figure 8), the model combines semantic information (from deep, coarse layers) and appearance information (from shallow, fine layers) in order to produce accurate and detailed segmentations. The model was tested on PASCAL VOC, NYUDv2, and SIFT Flow, and achieved state-of-the-art segmentation performance. \nThis work is considered a milestone in image segmentation, demonstrating that deep networks can be trained for semantic segmentation in an end-to-end manner on variablesized images. However, despite its popularity and effectiveness, the conventional FCN model has some limitations—it is not fast enough for real-time inference, it does not take into account the global context information in an efficient way, and it is not easily transferable to 3D images. Several efforts have attempted to overcome some of the limitations of the FCN. \nFor instance, Liu et al. [32] proposed a model called ParseNet, to address an issue with FCN—ignoring global context information. ParseNet adds global context to FCNs by using the average feature for a layer to augment the features at each location. The feature map for a layer is pooled over the whole image resulting in a context vector. This context vector is normalized and unpooled to produce new feature maps of the same size as the initial ones. These feature maps are then concatenated. In a nutshell, ParseNet is an FCN with the described module replacing the convolutional layers (Figure 9). \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.853157802330831,
        0.9518407016163712
      ],
      "excerpt": "(1) to describe something very exactly  \n(2) to decide or show the exact limits of something;  \n",
      "technique": "Supervised classification"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/ThanhPham1987/Segmentation/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 0,
      "date": "Thu, 23 Dec 2021 19:26:12 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/ThanhPham1987/Segmentation/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "ThanhPham1987/Segmentation",
    "technique": "GitHub API"
  },
  "invocation": [
    {
      "confidence": [
        0.8216270093103228
      ],
      "excerpt": "For example: \n",
      "technique": "Supervised classification"
    }
  ],
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/ThanhPham1987/Segmentation/issues{/number}",
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Segmentation",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "Segmentation",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "ThanhPham1987",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "User",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/ThanhPham1987/Segmentation/blob/main/README.md",
    "technique": "GitHub API"
  },
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 2,
      "date": "Thu, 23 Dec 2021 19:26:12 GMT"
    },
    "technique": "GitHub API"
  }
}