{
  "arxivLinks": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://arxiv.org/abs/1511.06434"
    ],
    "technique": "Regular expression"
  },
  "citation": [
    {
      "confidence": [
        1
      ],
      "excerpt": "All references to papers, techniques, previous work, repositories you used should be collected at the bottom:\n- Alec Radford, et al. “Unsupervised Representation Learning with Deep Convolutional Generative Adversarial Networks.” ArXiv.org, Cornell University, 7 Jan. 2016, arxiv.org/abs/1511.06434.\n- Pytorch. “Pytorch/Examples.” GitHub, 21 May 2020, github.com/pytorch/examples/tree/master/dcgan.\n- Professor Robert Twomey, \"dsc160-code/Style_Transfer\", https://github.com/roberttwomey/dsc160-code/tree/master/examples/style_transfer_tensorflow\n- Professor Robert Twomey, \"ml-art-code/DCGAN_Pytorch\", https://github.com/roberttwomey/ml-art-code/tree/master/week8/DCGAN_Pytorch\n\n",
      "technique": "Header extraction"
    },
    {
      "confidence": [
        0.9414616401702977,
        0.8654671031158477
      ],
      "excerpt": "- Yijun Liu yil724@ucsd.edu \n- Da Gong dagong@ucsd.edu \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9966309197581503
      ],
      "excerpt": "Butler, Judith. “Performative Acts and Gender Constitution: An Essay in Phenomenology and Feminist Theory.” Theatre Journal, vol. 40, no. 4, 1988, pp. 519–531. JSTOR, www.jstor.org/stable/3207893. Accessed 26 May 2020. \n",
      "technique": "Supervised classification"
    }
  ],
  "codeRepository": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/ucsd-dsc-arts/dsc160-final-404-not-found-1",
    "technique": "GitHub API"
  },
  "dateCreated": {
    "confidence": [
      1.0
    ],
    "excerpt": "2020-05-25T05:15:44Z",
    "technique": "GitHub API"
  },
  "dateModified": {
    "confidence": [
      1.0
    ],
    "excerpt": "2020-06-11T09:20:51Z",
    "technique": "GitHub API"
  },
  "description": [
    {
      "confidence": [
        0.9264469371976236,
        0.9607526669878986
      ],
      "excerpt": "DSC160 Data Science and the Arts - Final Project - Generative Arts - Spring 2020 \nProject Team Members:  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9993536416669316,
        0.9683570200543314,
        0.9975422985482412,
        0.9964845346308357
      ],
      "excerpt": "Pop culture is filled with symbolic representations. One of the most significant and powerful representations is the imagery of superheroes. If you dissect the notion of prevalent superheroes, it is not difficult to notice that most of them are white males with extreme gender characteristics, such as masculinity. This single-handed over-representation brings us to the topic of this art project. To reconstruct the gender characteristics of superheroes and diversify them, in this art project, we aim to recreate faces of superheroes in Frida Kahlo's perspective, who was an artist famous for exploring sexuality, gender and Politics in her paintings.  \nTo collect data, we firstly found this dataset on Kaggle https://www.kaggle.com/vibster2397/superheroes. Since the model we use will requires thousands of pictures, we decided to use web scraping to collect superheros of both Marvel and D.C. universes from https://www.superherodb.com/characters/ and Frida Kalho's portraits from https://www.frida-kahlo-foundation.org/. Firstly, we will use our heroes datasets as our training data to recreate new superhero faces using Deep Convolutional Generative Adversarial Network with PyTorch. After finishing recreating new faces, we will use CNN and Gram Matrix to style transfer superheroes faces in a Frida Kahlo style, by which we aim to emphasize femininity and lessen the masculinity.If things go as we plan, we will recreate gender-neutral style superheros and present them sequentially in a video in which we showed how they are created.  \nPossible challenges might arise in creating visually pleasant, high resolution portraits since we are new to this area and have no actual experience in applying what we learned in real world problems. Other challenges might include the detailed criteria of femininity. To expand on the scope of classroom topics, we recreate faces of humans instead of animals and combine the techniques of DCGAN with CNN.  \nWe are interested in this topic primarily because we noticed that superheros movies were subconsciously promoting toxic masculinity and the under-representation of feminine qualities. Judith Butler once said gender was socially constructed. To rephrase her saying, sex is a biological characteristic, while gender is socially constructed. In this art project, we aim to reconstruct the gender notions of superheroes. We want to redefine the faces of superheros through combining the masculinity within old superheros with the fluidity of gender in Kahlo' paintings to create gender-neutral superheros.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8067084967371246
      ],
      "excerpt": "- These are the example code and pre-existing models that we used.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.995492379597866
      ],
      "excerpt": "  This pre-existing DCGAN (Deep Convolution Generative Adversarial Networks) model is based on Pytorch. As this paper indicates, DCGAN is an unsupervised learning model that could work perfectly on learning a hierarchy of representations from object parts to scenes in both the generator and discriminator.  \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9909297875394317,
        0.9493277993158521
      ],
      "excerpt": "  When transfering superheroes into the style of Frida's works, we refer to this code example. This transformer is based on tensorflow and the benefit of this model is its feedforward attribute -- train a network to do the stylizations for a given painting beforehand so that it can produce stylized images instantly. \n- Training data. Our Data are collected in different websites. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8226806590057462,
        0.8173196760400967,
        0.8691804263374514
      ],
      "excerpt": "We collected superheroes from those website by hand. \n  - Frida Kahlo Dataset: This website contains 99 paintings by Frida Kahlo.<br/> \n  We scrape wikiart page to get the artworks from Frida Kahlo, a Mexican painter famous for her depiction on neutral-gender style self-portraits. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.8979411005071259,
        0.9473532762794532,
        0.8391721826799569,
        0.9650266602792442
      ],
      "excerpt": "- Data Acquisition/ Scraping \n  * Scraping: This is the code we used for scraping Frida's artworks from Wiki-art. \n- code for preprocessing \n  * DCGAN: We preprocessed import data through the libray of torchvision.datasets. All imported image is scaled and normalized for applying pytorch algorithm. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.9861818386102041,
        0.9292493874028752,
        0.9852246411670448,
        0.9633385831932668,
        0.8321857323461699,
        0.9200776863602729
      ],
      "excerpt": "  * DCGAN: This is the code we used to train the DCGAN model, from this code, we generated new superheroes based on our input DC and Marvel datasets. \n  * Style transfer: We used this style transfer to combine the style of Frida Kahlo into the new-generated superheroes from DCGAN. \nWe compiled the samples of 500 epochs results into one video. In the video, we can see that the generated result improves over the time. However, about one minute into the video, we can see that there are lots of duplicated resulting images. In order to have satisfying results from DCGAN, we acquire a database much larger than 3000 images. However, our database is limited as the number of heroes in comics are limited. To achieve better results, we duplicated the data base three times. It could be the reason that we have similar resulting images. Among the resulting faces we got, there are many faces that are recognizable and gender neutral. This result on the top right is like an alien version of Valkyrie. However, it also contains masculinity. This is clearly a strong gender-neutral superheroes. \nWe also have the results after using style transfer. The resulting images of gender neutral heroes are more recognizable comparing to results from DCGAN. However, the resulting image shares great similarity with the original images. It is more like apply frida image as a filter on top of the hero images. We do not really see the application of gender neutral process in the resulting images.  \nWe compiled the generated 500 pictures of epochs into a video and the foloowing video is the result: \nThese are the generated superheros from the 500 epochs we generated using DCGAN:                                                        \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        0.948316607865482,
        0.8308999543763336,
        0.9962042030080634,
        0.9997771059025342,
        0.9769826386906475,
        0.875270131172919
      ],
      "excerpt": "This is one of the result from the 451th epoch in DCGAN process, which contains some human faces: \nThese are the style-transferred results: \nWe attempted to recreate new superheroes with our own datasets of superheroes in which male and female superheroes maintain an approximate equal ratio of male and female. In the new images, the images are not very clear; but the generated superheroes’ gender characteristics are weakened, yet they still showed some kind of physical sex characteristics such as really strong jaw lines, one of the representations of masculinity. After style transferring them, we saw that their masculinity was slightly weakened, but overall there were no big changes in regards to strong physical characteristics. \nOur attempt to recreate new superheroes are based on our observation of the over-represented toxic masculinity and an unbalanced gender representation and our aspiration to change this current situation. Our datasets include almost all kinds of superheroes ever created in these two major comic companies and an overall more balanced gender ratio, which makes our dataset comparatively diverse. Then we style-transferred them with Frida Kahlo’ paintings. We chose her because her paintings are famous for their gender fluidity and discovery of sexualities; also, they reflect Kahlo’s inner world that constantly encompasses her own battle with her accidents, heartbreak with her loved one, and her mental illness; the gender fluidity and fragility, we believed can weaken the strong masculinity in the current super heroes representations. Our computational approach is based on the understanding of machine learning models, which are different from traditional artistic production methods since they are usually created by humans. Our attempts of recreating new superheroes from a diverse superheroes pool are inspired by the Feminism movement and Black Lives Matter movement since both of them call for social justice that is based on aspiration for more equality and less bias, which was represented as a form of over representation of one single social group, white males especially, and under representation of other social groups.  \nSince our generated images do not have high resolution and clear faces, our future directions can be adopting a new model, such as styleGAN, just as Professor Twomey himself suggested, and conduct latent search using Frida Kahlo’s paintings instead of simple style-transferring them, since latent search can better apply the characteristics of images to others. \nProvide an account of individual members and their efforts/contributions to the specific tasks you accomplished. \n",
      "technique": "Supervised classification"
    },
    {
      "confidence": [
        1.0
      ],
      "excerpt": "dsc160-final-404-not-found-1 created by GitHub Classroom",
      "technique": "GitHub API"
    }
  ],
  "downloadUrl": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/ucsd-dsc-arts/dsc160-final-404-not-found-1/releases",
    "technique": "GitHub API"
  },
  "forks_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 1,
      "date": "Wed, 22 Dec 2021 23:23:46 GMT"
    },
    "technique": "GitHub API"
  },
  "forks_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/ucsd-dsc-arts/dsc160-final-404-not-found-1/forks",
    "technique": "GitHub API"
  },
  "fullName": {
    "confidence": [
      1.0
    ],
    "excerpt": "ucsd-dsc-arts/dsc160-final-404-not-found-1",
    "technique": "GitHub API"
  },
  "hasExecutableNotebook": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "https://raw.githubusercontent.com/ucsd-dsc-arts/dsc160-final-404-not-found-1/master/Final_Project_Group_404-not-found.ipynb",
      "https://raw.githubusercontent.com/ucsd-dsc-arts/dsc160-final-404-not-found-1/master/style_transfer_keras.ipynb",
      "https://raw.githubusercontent.com/ucsd-dsc-arts/dsc160-final-404-not-found-1/master/.ipynb_checkpoints/style_transfer_keras-checkpoint.ipynb",
      "https://raw.githubusercontent.com/ucsd-dsc-arts/dsc160-final-404-not-found-1/master/.ipynb_checkpoints/dcgan_train-checkpoint.ipynb",
      "https://raw.githubusercontent.com/ucsd-dsc-arts/dsc160-final-404-not-found-1/master/code/scrape_frida_arts.ipynb",
      "https://raw.githubusercontent.com/ucsd-dsc-arts/dsc160-final-404-not-found-1/master/code/.ipynb_checkpoints/scrape_frida_arts-checkpoint.ipynb",
      "https://raw.githubusercontent.com/ucsd-dsc-arts/dsc160-final-404-not-found-1/master/dcgan_results/100%20epoch%20result.ipynb"
    ],
    "technique": "File Exploration"
  },
  "issueTracker": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://api.github.com/repos/ucsd-dsc-arts/dsc160-final-404-not-found-1/issues{/number}",
    "technique": "GitHub API"
  },
  "languages": {
    "confidence": [
      1.0
    ],
    "excerpt": [
      "Jupyter Notebook"
    ],
    "technique": "GitHub API"
  },
  "license": {
    "confidence": [
      1.0
    ],
    "technique": "GitHub API"
  },
  "long_title": {
    "confidence": [
      1.0
    ],
    "excerpt": "Reconstruct Gender-Neutral Superheros in Frida Kahlo's Narrative",
    "technique": "Regular expression"
  },
  "name": {
    "confidence": [
      1.0
    ],
    "excerpt": "dsc160-final-404-not-found-1",
    "technique": "GitHub API"
  },
  "owner": {
    "confidence": [
      1.0
    ],
    "excerpt": "ucsd-dsc-arts",
    "technique": "GitHub API"
  },
  "ownerType": {
    "confidence": [
      1.0
    ],
    "excerpt": "Organization",
    "technique": "GitHub API"
  },
  "readme_url": {
    "confidence": [
      1.0
    ],
    "excerpt": "https://github.com/ucsd-dsc-arts/dsc160-final-404-not-found-1/blob/master/README.md",
    "technique": "GitHub API"
  },
  "requirement": [
    {
      "confidence": [
        1
      ],
      "excerpt": "Any implementation details or notes we need to repeat your work. \n- Additional libraries you are using for this project\nNone. All libraries are listed in all notebooks.\n- Does this code require other pip packages, software, etc?\nWe used only latest version of pytorch, tensorflow and scipy.\n- Does this code need to run on some other (non-datahub) platform? (CoLab, etc.)\nNone. Due to the relatively small calculation need, any platform with individual GPU can run all notebooks.\n\n\n",
      "technique": "Header extraction"
    }
  ],
  "stargazers_count": {
    "confidence": [
      1.0
    ],
    "excerpt": {
      "count": 1,
      "date": "Wed, 22 Dec 2021 23:23:46 GMT"
    },
    "technique": "GitHub API"
  }
}